[
{"source_name": "BusinessInsider", "title": "'The worst is in the rearview mirror': Why Wall Street thinks Tesla's comeback story is finally here", "title_link": "https://markets.businessinsider.com/news/stocks/tesla-stock-prediction-tsla-price-elon-musk-robotaxi-ai-deliveries-2024-7", "Description": "After a rocky stretch for Tesla stock and a lot of drama surrounding Elon Musk's legal battles, the electric vehicle maker could finally be poised for a comeback, according to a chorus of Wall Street analysts. Investors have been eyeing a potential rebound in the stock for more than a year, with Tesla sales having slid 15% over the last twelve months. Tesla deliveries slumped for the second quarter in a row, but they were stronger than analysts had expected, with clocking in at 443,956 , compared to estimates of 436,000. Those figures could be a sign better days are ahead for the carmaker, especially as Musk puts the soap opera surrounding his pay package to bed and investors eye new artificial intelligence developments on the horizon. Tesla getting its mojo back? Morgan Stanley strategists said in a note on Tuesday. Little more than 2 weeks ago our clients were preparing for shareholders to reject Elon Musk's 2018 comp package potentially setting up a change of management and strategy, compounding many months of negative newsflow. Fast forward to today, clients are beginning to ask us about positive catalysts into 2Q results and beyond. Tesla also reduced its inventory over the second quarter and boosted its energy storage to an all-time high. Higher energy storage in particular was a show stealer update, strategists said, as it suggests Tesla could benefit from increased energy demand stemming from the AI boom. As Gen AI acceleration spurs a multigenerational increase in energy demand, electricity generation, and data center investment, we believe investors will begin to pay more attention to Tesla Energy which we value at $36 per Tesla share ($130bn) as the business uniquely positioned to benefit from investment in the US electric grid accelerated by the AI boom. Morgan Stanley reiterated its overweight rating on Tesla stock with a price target of $310, implying another 30% upside. The stock continues to ride a wave of positive momentum following its annual meeting in mid-June, according to Garrett Nelson, a senior stock strategist at CFRA Research. We think Musk successfully shifted investor focus to long-term opportunities in AI, robotics, energy storage, and other business lines, diverting attention away from near-term challenges. Wall Street is focused are on Tesla's Robotaxi, Nelson added, the full self-driving service Musk has teased for months. The company has been hard at work on an autonomous car, which Musk himself has said could be a massive driver of the company's future growth. CFRA maintained its buy rating on the stock and raised its price target to $250 a share, implying just 1% upside. Other strategists had even more bullish calls following the better-than-expected deliveries figure. I think the stock is going to double or triple, maybe even more, over the next few years. Again, we're early innings, Keith Fitz-Gerald, the principal of Keith Fitz-Gerald Research, said to CNBC on Tuesday. This is about power, this about robotics, this is perhaps the best under-valued AI on the planet right now. And love him or hate him, Musk knows what's he's doing. Tesla could see a sharp rally in the second half of the year, as the Robotaxi's debut represents the turning point for the company, Wedbush Securities analyst Dan Ives previously said. Wedbush reiterated its outperform rating on Tesla and raised its price target to $300 a share. In the most bullish scenario, Tesla stock could rally to $400 by the end of the year, Ives said, implying 63% upside from current levels. The key for Tesla stock is the Street recognizing that Tesla is the most undervalued AI play in the market in our view, Ives said in a note. In a nutshell, the worst is in the rear-view mirror for Tesla as we believe the EV demand story is starting to return to the disruptive tech stalwart ahead of a historical Robotaxi Day on August 8th, he later added. Tesla shares surged as much as 10% on Tuesday after it reported deliveries, and pushed 6% higher on Wednesday to trade around $246. The stock has reversed nearly all of the losses it's seen in 2024, with shares now down less than 2% year-to-date. Read next Indices Commodities Currencies Stocks Jump to"},
{"source_name": "BusinessInsider", "title": "The bond market is acting like Trump will win", "title_link": "https://markets.businessinsider.com/news/bonds/trump-election-odds-treasury-bond-yields-inflation-deficit-debt-economy-2024-7", "Description": "The world's biggest financial market is swaying after Thursday's presidential debate, as the odds of a second Donald Trump presidency jumped among forecasters. US Treasury yields surged and prices dropped following the first debate, indicating investors are starting to price in a Trump victory in November, market veteran Ed Yardeni wrote in a note. The 10-year Treasury yield rose from 4.29% on Thursday afternoon to 4.48% today, the highest level since May 31, he wrote on Monday. That was in spite of the lowest y/y print for the personal consumption expenditures deflator since March 2021 on Friday, he added, referring to the Federal Reserve's preferred inflation gauge, which showed pricing pressures easing last month. Yields are rising chiefly on the long-dated end of the curve. It's a sign that investors' long-term expectations for the economy may have shifted, Yardeni said, even as the interest rate outlook remains stable. At the same time, climbing yields on Treasury Inflation Protection Securities indicate upside in real yields. 10-year TIPS gained 14 basis points since Thursday, he said. We think markets see a potential mix of stronger economic growth, higher inflation, and more Treasury supply in the event Trump wins, Yardeni explained. The spike in yields could partially be explained by deficit concerns, as economics experts say a second Trump presidency would likely widen the federal deficit by up to $5 trillion through the coming decade, Yardeni added. The Republican candidate has pledged to extend individual and estate tax cuts he introduced in his first term, which are set to expire next year. As bond traders are sensitive to high levels of government debt, unchecked deficit spending could prompt market vigilantes to stop buying US bonds and send yields soaring , Yardeni has repeatedly warned. Perhaps the bond market is overreacting since much can change between now and November's presidential election. But that's not to say that other financial markets won't follow suit, pricing in the rising probability of a Trump win as well, Yardeni said. After the debate, odds that Trump would be elected in November grew to 57% from 52%, according to cited data from PredictIt. Biden's odds fell to 31%. Read next Indices Commodities Currencies Stocks Jump to"},
{"source_name": "BusinessInsider", "title": "Decoding 13 Analyst Evaluations For Intl Flavors & Fragrances", "title_link": "https://markets.businessinsider.com/news/stocks/decoding-13-analyst-evaluations-for-intl-flavors-fragrances-1033527738", "Description": "In the latest quarter, 13 analysts provided ratings for Intl Flavors & Fragrances (NYSE:IFF), showcasing a mix of bullish and bearish perspectives. In the table below, you'll find a summary of their recent ratings, revealing the shifting sentiments over the past 30 days and comparing them to the previous months. Insights from analysts' 12-month price targets are revealed, presenting an average target of $100.54, a high estimate of $116.00, and a low estimate of $75.00. This upward trend is apparent, with the current average reflecting a 12.55% increase from the previous average price target of $89.33. In examining recent analyst actions, we gain insights into how financial experts perceive Intl Flavors & Fragrances. The following summary outlines key analysts, their recent evaluations, and adjustments to ratings and price targets. To gain a panoramic view of Intl Flavors & Fragrances's market performance, explore these analyst evaluations alongside essential financial indicators. Stay informed and make judicious decisions using our Ratings Table. Stay up to date on Intl Flavors & Fragrances analyst ratings. International Flavors & Fragrances is the largest specialty ingredients producer globally. The company sells ingredients for the food, beverage, health, household goods, personal care, and pharmaceutical industries. The company makes proprietary formulations, partnering with customers to deliver custom solutions. The nourish segment, which generates roughly half of revenue, is a leading flavor producer and also sell texturants, plant-based proteins, and other ingredients. The health and biosciences business, which generates around one fourth of revenue, is a global leader in probiotics and enzymes. IFF is also one of the leading fragrance producers in the world. Market Capitalization Analysis: The company's market capitalization surpasses industry averages, showcasing a dominant size relative to peers and suggesting a strong market position. Revenue Growth: Intl Flavors & Fragrances's revenue growth over a period of 3 months has faced challenges. As of 31 March, 2024, the company experienced a revenue decline of approximately -4.23% . This indicates a decrease in the company's top-line earnings. As compared to competitors, the company encountered difficulties, with a growth rate lower than the average among peers in the Materials sector. Net Margin: Intl Flavors & Fragrances's net margin excels beyond industry benchmarks, reaching 2.07% . This signifies efficient cost management and strong financial health. Return on Equity (ROE): Intl Flavors & Fragrances's ROE falls below industry averages, indicating challenges in efficiently using equity capital. With an ROE of 0.42%, the company may face hurdles in generating optimal returns for shareholders. Return on Assets (ROA): Intl Flavors & Fragrances's ROA falls below industry averages, indicating challenges in efficiently utilizing assets. With an ROA of 0.19%, the company may face hurdles in generating optimal returns from its assets. Debt Management: Intl Flavors & Fragrances's debt-to-equity ratio is below industry norms, indicating a sound financial structure with a ratio of 0.77 . Analyst ratings serve as essential indicators of stock performance, provided by experts in banking and financial systems. These specialists diligently analyze company financial statements, participate in conference calls, and engage with insiders to generate quarterly ratings for individual stocks. Some analysts also offer predictions for helpful metrics such as earnings, revenue, and growth estimates to provide further guidance as to what to do with certain tickers. It is important to keep in mind that while stock and sector analysts are specialists, they are also human and can only forecast their beliefs to traders. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "The big winners of the AI boom are the most boring companies imaginable", "title_link": "https://markets.businessinsider.com/news/stocks/ai-stocks-to-invest-artificial-intelligence-data-center-energy-companies-2024-6", "Description": "Picture a stuffy, windowless room with servers lined back-to-back. It's hot, with thousands of computers operating at once. Massive industrial-size fans are whirring in an attempt to cool things down. Across the road, ground has been broken on another data center. A whole industrial complex is popping up. The construction companies in charge can barely keep up with demand. The scene encapsulates the immense computing power required to fuel the artificial-intelligence boom. And while it's a far cry from the glitz and glamour of the megacap tech firms that dominate headlines , some of the movement's biggest winners will be the companies working on the back end. This specifically means data centers , which will be increasingly key for storing information as AI becomes more mainstream. A growing chorus of analysts say they represent one of the most overlooked beneficiaries of the AI shift. This new architecture on gen AI, you basically have to upgrade around a trillion dollars of infrastructure, Ted Mortonson, a managing director and tech strategist at Baird, said. And it's very early. If you use the baseball analogy, we're still probably not even at the start of the game. Consider that Goldman Sachs says data-center power demand is set to surge 160% by the end of the decade, with the bank noting that a ChatGPT-powered search sucks up to 10 times as much electricity as a basic Google search. That kind of spike in power demand hasn't been seen in the US since the early years of this century, the Goldman analysts said in a report. It will be stoked partly by electrification and industrial reshoring, but also by AI. Extending from there, the AI revolution could be a boon for a number of construction, utility, and electrical companies that make up the data-center landscape. Typically viewed as the market's most boring and defensive sectors, they could offer some of the most exciting investment opportunities. Companies are already pouring billions into creating data centers, and stocks related to their construction and power supply are seeing outsize gains. For starters, utilities represent the third-best-performing sector in the S&P 500 over the past six months, out of 11 total. The group trails only the information-technology and communication-services sectors that feature pure-play AI juggernauts like Meta, Nvidia, and Alphabet. Normally, when growth stocks are leading the way, more defensive sectors like utilities perform the worst. That's not been the case. On a single-stock basis, Digital Realty Trust — the only data-center real-estate investment trust listed on the New York Stock Exchange — has jumped 38% over the past year, while the Global X Data Center & Digital Infrastructure ETF has climbed 12%. Both those stock returns far exceed the 4% gain for the iShares Core US REIT ETF over the same period. Stocks that aid large electricity use have also had a strong 2024. Super Micro Computer — whose liquid-cooling technology has been called a must-have for AI hardware — is up 200% year to date. Nvidia may be the king of AI, but even it is only up 150% in 2024. Meanwhile, Vertiv — which also makes power and cooling equipment for data centers — is up 80% this year. Its 435% gain since Nvidia's initial blockbuster quarter 13 months ago marks an outperformance of 130 percentage points. The company's dominance recently earned it the label of the real AI darling from Bank of America. Globally, grid- and electricity-equipment stocks in the US, South Korea, India, and Europe have rallied as much as 140% from levels at the start of the year, JPMorgan analysts said in recent research. Investors probably aren't used to seeing energy and utility stocks as a gold mine, given the sector's muted returns over the past decade, according to Travis Miller, an energy and utilities strategist from Morningstar. But strong growth is coming: The firm expects to see 10% growth each year in the utility sector over the next 10 years. I don't think investors fully realize the impact data-center growth has, Miller told Business Insider. While traditional hardware companies and their data-center and real-estate counterparts soar, software stocks have been largely left in the dust. Hardware-tech stocks have outperformed their software peers by 30 percentage points this year amid skyrocketing demand for graphics processing units , data centers, and other physical computing equipment. It's a 180-degree reversal from the past decade when software firms — lauded for their high profit margins and asset-light business models — beat their hardware peers by more than 250 percentage points. Why the shift? Mortonson said it's difficult for software companies to build around AI. This gen-AI cycle is infrastructure, all infrastructure, Mortonson previously told BI in an interview, adding that cloud companies were set to spend over $200 billion this year on data centers. That's the horsepower, or the engine, of Gen AI, he said. Additionally, on a comparative-valuation basis, traditional tech stocks associated with software look expensive relative to energy and data-center names. Utilities, meanwhile, look to be about 5% undervalued , Miller said. Still, despite recent outperformance, it may take years for the data-center boom to fully mature. The earliest data centers could significantly influence corporate earnings is 2028, Miller estimated. That means investors could be waiting awhile to fully realize the trade's potential. There's also the risk that the US doesn't build as many data centers as anticipated over concerns on whether we have the energy capacity to support them, he added. Despite that prospect, he still expects considerable expansion. It's been a generation since utilities had this much growth potential that we see during the next 10 years, Miller said. Read next Indices Commodities Currencies Stocks Jump to"},
{"source_name": "BusinessInsider", "title": "Bed Bath & Beyond board members were concerned Ryan Cohen got insider info before his $60 million windfall, new deposition details show", "title_link": "https://markets.businessinsider.com/news/stocks/bed-bath-beyond-ryan-cohen-insider-trading-accusations-bbby-stock-2024-6", "Description": "Bed Bath & Beyond board members were concerned Ryan Cohen received insider information before making $60 million selling the company's stock, according to a deposition by CEO Sue Gove . I certainly had questions about that, said Gove, who was named CEO of Bed Bath & Beyond in October 2022. Probably most other board members were also concerned that some on the board were funneling insider information to Cohen, Gove added in her testimony as part of a shareholder lawsuit against the activist investor, who is the current CEO of GameStop. Ben Rosenzweig, one of the directors on Bed Bath & Beyond's board, was known to have private contact with Cohen, the deposition said. Their conversations revolved around the personalities of other board members and whether Cohen's nominees for Bed Bath & Beyond's board were let in on calls, according to the testimony. In a conversation with Gove, Rosenzweig indicated he was representing Ryan, Gove said. She believed Rosenzweig's conversations with Cohen were inappropriate due to his role as an independent director. Gove said she did not completely trust Rosenzweig or Cohen. In particular, she said she was in a concerned state when Rosenzweig suggested he was acting as Ryan's agent. I didn't trust him. I didn't trust what was taking place, Gove added of Cohen. There was a lot of things that had taken place between, you know, him and … and Ben and the whole process that always left me uncomfortable. We were very careful with our conversations with him. Rosenweig and other directors, though, have said in their testimonies that they've never given insider info to Cohen. Cohen was given non-public information on one occasion but under an agreement that prevented him from trading on it, Rosenzweig said in his deposition. Lawyers for Cohen and Gove did not immediately respond to a request for comment from Business Insider. Cohen was accused in a shareholder lawsuit of insider trading and misleading Bed Bath & Beyond investors after making a fortune on the stock in 2022, when he sold his stake in the struggling retailer before the stock tanked. Bed Bath & Beyond filed for Chapter 11 bankruptcy in April 2023. Read next Indices Commodities Currencies Stocks Jump to"},
{"source_name": "BusinessInsider", "title": "Warren Buffett says he'll put his $130 billion fortune into a charitable trust run by his children after he dies", "title_link": "https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-charity-donation-gates-foundation-brk-billionaire-2024-6", "Description": "Warren Buffett will make philanthropy his final act. The billionaire Berkshire Hathaway CEO plans to put the majority of his wealth into a new charitable trust managed by his three children, he told The Wall Street Journal . At present, Warren owns close to $130 billion in Berkshire shares. I feel very, very good about the values of my three children, and I have 100% trust in how they will carry things out, the legendary investor said. Upon his death, Susie, Howie and Peter Buffett will then have to unanimously decide the best philanthropic use for their father's vast fortune. Each is already responsible for their own foundations, WSJ said. Susie Buffett chairs the education and social justice-oriented Sherwood Foundation, and the Susan Thompson Buffett Foundation, focused on reproductive rights. Howie Buffett heads the Howard G. Buffett Foundation, which is involved in food security and the mitigation of conflict and human trafficking. Peter Buffett and his wife are in charge of the NoVo Foundation. The organization leads several projects, including work with indigenous groups. I like to think I can think outside the box, but I'm not sure if I can think outside the box when it's 6 feet below the surface and do a better job than three people who are on the surface who I trust completely, Buffett said. He has not directed his children on how to use the funds. Since 2006, the 93-year-old billionaire has already been contributing to the four foundations run by his children, as well as to the Bill & Melinda Gates Foundation Trust. The practice will continue until his passing, though donations to the latter will then end. The Gates Foundation has no money coming after my death, he told WSJ. Until 2021, he served as a trustee of the Gates Foundation. In the 18 years since he started donating, Buffett has given 5% of his remaining Berkshire shares each year. To fund his latest round of giving, Berkshire announced that Buffett was converting 8,674 of Berkshire Class A shares into Class B ones. Read next Indices Commodities Currencies Stocks Jump to"},
{"source_name": "BusinessInsider", "title": "Tesla stock pops 10% as deliveries beat estimates and Wall Street sees stronger days ahead", "title_link": "https://markets.businessinsider.com/news/stocks/tesla-stock-price-reaction-q2-deliveries-china-robotaxi-dan-ives-2024-7", "Description": "Tesla shares spiked as much as 10% on Tuesday after second-quarter deliveries beat estimates. The EV-maker delivered 444,000 units during the period, exceeding estimates of 438,000. Wedbush Securities says it's a sign the company is finally on the upswing after a difficult period. This was a huge comeback performance from Tesla and Musk with the Street expecting a clear miss this quarter with EV demand still choppy globally, analyst Dan Ives wrote on Tuesday, citing that deliveries outpaced what even bullish investors hoped for. He added: In a nutshell, the worst is in the rear view mirror for Tesla as we believe the EV demand story is starting to return to the disruptive tech stalwart ahead of a historical Robotaxi Day on August 8th. Tesla stock was down 16% in 2024 through Monday's close, although Tuesday's move trimmed that to an 8% year-to-date loss. Ives thinks the comeback will continue in the second half of 2024. Apart from its deliveries win, he notes that Tesla also enjoyed a second quarter mini rebound in China, which has brought about price stabilization. Another source of momentum will come on August 8, when Tesla hosts its Robotaxi day, Ives said. The firm is set to unveil its long-teased autonomous taxi vehicle during the event, which Ives says is a demonstration that the company is following on its word to unleash full self-driving technology. We continue to believe that Tesla is more of an AI and robotics play than a traditional car company.....now the rubber meets the road as the Street anticipates August 8th as a key linchpin day for the Tesla story, Ives said. Not everyone on Wall Street shares Ives' optimism. Some have warned that Tesla faces as much as a 91% correction , given lasting industry headwinds and problems in the firm's own business approach. Read next Indices Commodities Currencies Stocks Jump to"},
{"source_name": "BusinessInsider", "title": "These retail traders lost big in the first meme stock episode. Here's why they won't stop betting on GameStop.", "title_link": "https://markets.businessinsider.com/news/stocks/gamestop-roaring-kitty-gme-stock-price-rally-meme-traders-wallstreetbets-2024-6", "Description": "GameStop stock has seen a resurgence this year, and traders who lost big time in the first round of meme-stock mania say they're still tempted by the possibility of striking it rich betting on the ailing video game retailer. The stock is up about 43% year-to-date but was up as much as 178% in May when the 2024 rally kicked off. Interest in the stock was revived overnight after the trader Keith Gill — known on social media as Roaring Kitty — began posting about it on X in early May and then later on Reddit, where he shared screenshots of his brokerage statement showing a $116 million stake. Based on data at the end of March, Gill's 9 million shares of GameStop made him the fourth-largest holder of the stock . His posts broke a years-long silence and reinvigorated the meme-stock faithful on Reddit and other forums. Business Insider spoke with retail traders, who asked to use only their first name for privacy, about how past losses are impacting their decision to go long GameStop again. Dan, a 29-year-old retail investor who jumped into the meme-stock world in 2021, estimates he put around $40,000 into GameStop during the pandemic after seeing several promising threads on the stock on the subreddit r/WallStreetBets. His stake multiplied to around $200,000 in value before the stock tumbled again. He ultimately sold his shares for a loss, according to brokerage statements viewed by Business Insider. I found a lot of Reddit users, particularly on the Wall Street Bets community, come up with all this sort of diligence and research about GameStop. Then I kind of went down that rabbit hole, he said of his first foray into GameStop. Then the initial dump happened, so to speak, from the $300 range back down to the $100 range, and I was needless to say very distraught. It was just a crushing blow to my spirit and everything. Never did it occur to Dan to sell his shares when GameStop peaked. The prospect that the stock would soar even higher was too intoxicating, he says. I drank the Kool-Aid, so to speak, of the Reddit community and the GameStop zealots, he said. The FOMO or the fear of missing out was so high that at the time there was no part of me that even considered selling. So obviously in retrospect, it would have been a good call. Dan ended up speaking to therapists to help him come to terms with his losses. Still, he couldn't help himself from scooping up more GameStop shares when the stock rocketed higher this year. I dabbled a little bit with this current uptrend, certainly nowhere near the levels I was putting in before. I made a little bit on it, then I lost a little bit on it, so it's just been kind of a wash, he said, adding that he was mostly drawn to the latest rally out of amusement. Brian, another retail trader who invested in GameStop in 2020, says he was also drawn back in amid this year's RoaringKitty-fueled rally. When he posted, I kind of dabbled into it, he told BI. You see all the hype around it, and then you see the price just shoot up. It's hard not to want to just jump in. The allure of GameStop stock has been the potential for a big, quick payday, Brian added, and plowing cash into a meme stock is like buying a lotto ticket for a chance at financial independence. [They] could essentially just make you financially free. You never have to work, he said. I live in the Bay area of California, so it's very hard out here if you don't have a very well-paid job or if you don't have a dual income … So I was looking for something that could gain me the freedom to not have to work and grind it out every day. Others echoed that sentiment, noting that the chance to hit it big is too enticing to sit it out as the stock starts going parabolic. I've been unemployed since November and I've been struggling to find work, said Zaine, another retail trader. He never traded meme stocks but has bet against risky assets during the pandemic. His portfolio ballooned to as much as $75,000 before plunging to near zero, screenshots of his brokerage account show. You go to these outlets thinking, I can just make a little bit of money on the side to kind of just survive, he said. And it ends up being this snowball effect that, if you don't look at yourself in the mirror, you can really end up losing everything. Read next Indices Commodities Currencies Stocks Jump to"},
{"source_name": "BusinessInsider", "title": "Lumber prices have plunged 24% as this year's home builder season fails to meet expectations", "title_link": "https://markets.businessinsider.com/news/commodities/lumber-prices-plunge-home-building-season-demand-falls-flat-2024-6", "Description": "Lumber prices have plunged this year as the peak home-building season falls flat amid subdued demand. The essential homebuilding commodity has seen futures pricing plunge 24% from its mid-March peak to $473 per 1,000 board feet. The sharp decline is an about-face from the start of the year, when lumber brokers were excited about 2024 prospects for the commodity due to a US housing market that is sorely in need of new homes. We entered 2024 with optimism for the year to come with a housing deficit that needs to be filled, commodity lumber and structural panel prices reset to a pre-covid range, and a Fed that stopped raising interest rates with hopes of many cuts to come, Sherwood Lumber senior vice president Josh Goodman told Business Insider. That optimism drove a build-up in lumber inventory at the start of the year, and that inventory is still getting worked through as the home building season appears to not be as strong as it was expected to be, according to Goodman. US housing starts and new building permits have been steadily falling this year, declining 4% and 6% in May, respectively. Home builders have been slowing down new construction projects because sales of new homes have also been steadily declining this year as consumers grapple with lingering affordability issues driven by high mortgage rates and stubbornly high home prices. Putting added pressure on lumber prices is that the commodity is experiencing a period of oversupply. What many did not recognize is that new demand has been declining faster than the sawmill production. Commodity Forest Product markets continue to be oversupplied, Sherwood Lumber COO Kyle Little told Business Insider. And falling demand combined with rising supply can be a powerful dynamic that puts downward pressure on prices. Last week's housing report provided confirmation for many that demand is somewhat worse that most realized. Current supply needs to be consumed and the market is indicating that it will….albeit at a lower price, Little said. Read next Indices Commodities Currencies Stocks Jump to"},
{"source_name": "BusinessInsider", "title": "Here's Why You Should Retain Glaukos Stock for Now", "title_link": "https://markets.businessinsider.com/news/stocks/here-s-why-you-should-retain-glaukos-stock-for-now-1033527723", "Description": "Glaukos Corporation (NYSE:GKOS) is well-poised for growth on the back of favorable clinical trial results and a robust product pipeline. However, stiff competition is a concern. Shares of this Zacks Rank #3 (Hold) company have risen 49.7% year to date compared with the industry's 5.4% growth. The S&P 500 Index has also increased 15% in the same time frame. Glaukos, with a market capitalization of $5.91 billion, is a leading ophthalmic medical technology and pharmaceutical company. It projects earnings growth of 1.3% for 2024, followed by 43.1% growth in 2025, and expects to maintain its strong performance in terms of revenues as well. The company has a trailing four-quarter average negative earnings surprise of 4.74%. Image Source: Zacks Investment Research In 2023, Glaukos witnessed sales returning to growth after experiencing a downturn in 2022. This positive shift can be attributed to a more favorable macroeconomic climate and the introduction of a series of new products in recent quarters. The first-quarter results also reflected the strength. The company anticipates sustained robust demand in its international Glaucoma and Corneal Health product lines to support its top-line growth in the rest of 2024. The commercial launch of the iStent infinite in 2023 has provided a significant lift to the U.S. glaucoma franchise, positioning it as a key growth catalyst in the forthcoming quarters. The company's optimistic revenue projections for 2024 indicate a positive trajectory. Meanwhile, the new local coverage determinations, proposed in June 2023, are likely to remove certain ophthalmic goniotomy and canaloplasty procedures from coverage. This is also expected to have a positive impact on the iStent business in 2024. Over recent quarters, GKOS has launched a suite of products, including iPrime, iAccess and iStent, which have been instrumental in boosting the company's revenues. In December, the company achieved a milestone by securing FDA approval for its latest product, iDose TR, to lower intraocular pressure in individuals with ocular hypertension or open-angle glaucoma. These innovations are expected to continue to bolster Glaukos' growth trajectory into 2024. Earlier this month, the company received a permanent Healthcare Common Procedure Coding System J-code from the U.S. Centers for Medicare and Medicaid Services that should drive patient access in the United States. This is because it will likely accelerate the billing and physician reimbursement procedures. In May, Glaukos announced first-quarter 2024 results. The company's net sales were $85.6 million, up 16% year over year. Revenues for 2024 are estimated to be in the range of $357-$365 million, implying a year-over-year improvement of 13.4-16%. Although Glaukos has a promising pipeline, it has faced setbacks in terms of clinical development or regulatory activities. Any potential clinical or regulatory setback can have an adverse impact on the company's share price, thereby hurting investors' wealth. The FDA denied approval to a pre-market approval application for the ab-externo device for glaucoma, MicroShunt. The company is currently evaluating alternate regulatory pathways for approval, and its commercial launch in the United States remains uncertain. Moreover, Glaukos currently relies on a limited number of third-party suppliers, in some cases sole suppliers, to supply components for the iStent, the iStent inject models and other pipeline products. If one or more of these suppliers cease to provide the company with sufficient quantities of components or drugs in a timely manner or on acceptable terms, it would have to seek alternative sources of supply. Glaukos' production of the iStent, iStent inject models and other products in development depends on a select group of third-party suppliers, occasionally exclusive ones. If any of these suppliers fail to deliver the necessary components or drugs in a timely manner or on acceptable terms, Glaukos would be compelled to find other suppliers to maintain its production line. The bottom-line estimate for GKOS is pegged at a loss of $2.24 per share for 2024, which narrowed 2 cents in the past 30 days. The Zacks Consensus Estimate for 2024 revenues is pinned at $362.3 million, indicating growth of 15.1% from the top line recorded in 2023. Some better-ranked stocks in the broader medical space that have announced quarterly results are DaVita (NYSE:DVA), Ecolab (NYSE:ECL) and Universal Health Services (NYSE:UHS). DaVita, carrying a Zacks Rank #2 (Buy) at present, has an estimated long-term growth rate of 13.6%. DVA's earnings surpassed estimates in each of the trailing four quarters, the average surprise being 29.4%. DaVita's shares have risen 32.1% compared with theindustry's 5% growth so far this year. Ecolab, carrying a Zacks Rank of 2 at present, has an estimated long-term growth rate of 13.3%. ECL's earnings surpassed estimates in each of the trailing four quarters, the average surprise being 1.7%. Ecolab's shares have rallied 18.8% against theindustry's 21.9% decline so far this year. Universal Health Services has an Earnings ESP of +2.91% and a Zacks Rank #2 at present. UHS has an estimated earnings growth rate of 30.5% for 2024. UHS' earnings surpassed estimates in each of the trailing four quarters, delivering an average surprise of 8.12%. The company's shares have rallied 21.2% compared to theindustry's 18.5% increase so far this year. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Demystifying Oceaneering International: Insights From 4 Analyst Reviews", "title_link": "https://markets.businessinsider.com/news/stocks/demystifying-oceaneering-international-insights-from-4-analyst-reviews-1033527735", "Description": "4 analysts have expressed a variety of opinions on Oceaneering International (NYSE:OII) over the past quarter, offering a diverse set of opinions from bullish to bearish. The following table provides a quick overview of their recent ratings, highlighting the changing sentiments over the past 30 days and comparing them to the preceding months. Analysts have recently evaluated Oceaneering International and provided 12-month price targets. The average target is $29.25, accompanied by a high estimate of $34.00 and a low estimate of $21.00. This upward trend is evident, with the current average reflecting a 1.74% increase from the previous average price target of $28.75. The standing of Oceaneering International among financial experts becomes clear with a thorough analysis of recent analyst actions. The summary below outlines key analysts, their recent evaluations, and adjustments to ratings and price targets. Navigating through these analyst evaluations alongside other financial indicators can contribute to a holistic understanding of Oceaneering International's market standing. Stay informed and make data-driven decisions with our Ratings Table. Stay up to date on Oceaneering International analyst ratings. Oceaneering International Inc is a global provider of engineered services and products robotic solutions to the offshore energy, defense, aerospace, manufacturing and entertainment industries. Most of Oceaneering's products are produced for the offshore oil and gas market. It had a 2020 segment realignment to promote synergies and cost efficiency. The five segments are subsea robotics; manufactured products; offshore projects group; integrity management and digital solutions; and aerospace and defense technologies. Within the segments are two businesses - services and products provided primarily to the oil and gas industry. The firm is also involved in the offshore renewables and mobility solutions industries. Market Capitalization Analysis: Falling below industry benchmarks, the company's market capitalization reflects a reduced size compared to peers. This positioning may be influenced by factors such as growth expectations or operational capacity. Revenue Growth: Oceaneering International's remarkable performance in 3 months is evident. As of 31 March, 2024, the company achieved an impressive revenue growth rate of 11.57% . This signifies a substantial increase in the company's top-line earnings. As compared to competitors, the company surpassed expectations with a growth rate higher than the average among peers in the Energy sector. Net Margin: Oceaneering International's net margin is below industry standards, pointing towards difficulties in achieving strong profitability. With a net margin of 2.53%, the company may encounter challenges in effective cost control. Return on Equity (ROE): The company's ROE is below industry benchmarks, signaling potential difficulties in efficiently using equity capital. With an ROE of 2.42%, the company may need to address challenges in generating satisfactory returns for shareholders. Return on Assets (ROA): The company's ROA is below industry benchmarks, signaling potential difficulties in efficiently utilizing assets. With an ROA of 0.68%, the company may need to address challenges in generating satisfactory returns from its assets. Debt Management: With a high debt-to-equity ratio of 1.46 , Oceaneering International faces challenges in effectively managing its debt levels, indicating potential financial strain. Benzinga tracks 150 analyst firms and reports on their stock expectations. Analysts typically arrive at their conclusions by predicting how much money a company will make in the future, usually the upcoming five years, and how risky or predictable that company's revenue streams are. Analysts attend company conference calls and meetings, research company financial statements, and communicate with insiders to publish their ratings on stocks. Analysts typically rate each stock once per quarter or whenever the company has a major update. Some analysts will also offer forecasts for metrics like growth estimates, earnings, and revenue to provide further guidance on stocks. Investors who use analyst ratings should note that this specialized advice comes from humans and may be subject to error. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Implied Volatility Surging for Green Dot Stock Options", "title_link": "https://markets.businessinsider.com/news/stocks/implied-volatility-surging-for-green-dot-stock-options-1033527715", "Description": "Investors in Green Dot Corporation (NYSE:GDOT) need to pay close attention to the stock based on moves in the options market lately. That is because the Jul 19, 2024 $17.50 Call had some of the highest implied volatility of all equity options today. Implied volatility shows how much movement the market is expecting in the future. Options with high levels of implied volatility suggest that investors in the underlying stocks are expecting a big move in one direction or the other. It could also mean there is an event coming up soon that may cause a big rally or a huge sell-off. However, implied volatility is only one piece of the puzzle when putting together an options trading strategy. Clearly, options traders are pricing in a big move for Green Dot shares, but what is the fundamental picture for the company? Currently, Green Dot is a Zacks Rank #3 (Hold) in the Financial Transaction Services industry that ranks in the Top 26 % of our Zacks Industry Rank. Over the last 30 days, no analyst has increased the earnings estimates for the current quarter, while one has dropped the estimates. The net effect has taken our Zacks Consensus Estimate for the current quarter from 30 cents per share to 20 cents in that period. Given the way analysts feel about Green Dot right now, this huge implied volatility could mean there's a trade developing. Oftentimes, options traders look for options with high levels of implied volatility to sell premium. This is a strategy many seasoned traders use because it captures decay. At expiration, the hope for these traders is that the underlying stock does not move as much as originally expected. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Charter Communications Faces Analyst Warnings on Broadband Revenue Challenges", "title_link": "https://markets.businessinsider.com/news/stocks/charter-communications-faces-analyst-warnings-on-broadband-revenue-challenges-1033527734", "Description": "Citigroup analyst Michael Rollins downgraded Charter Communications Inc (NASDAQ:CHTR) from Neutral to Sell and lowered the price target from$280to$255. The stock fell on Wednesday. The analyst noted that Charter faces risks to both estimates and valuation as the organic broadband environment becomes tougher relative to consensus expectations. Also Read: Verizon, AT&T, And T-Mobile Set For Gains, Goldman Sachs Cites AI and Data Center Demand The discontinuation of the Affordable Connectivity Program (ACP) is likely to exacerbate broadband subscriber and revenue headwinds over the next 12 months, and consensus 2025 EBITDA expectations seem too optimistic, as per Rollins. The reduction in his target price reflects an FV/EBITDA multiple contraction to 6.0x on his below-consensus EBITDA outlook for 2025, partly offset by some recognition of FCF’s future recovery once it gets through this elevated capital investment cycle. Rollins noted the upcoming second-quarter and third-quarter results as potentially harmful catalysts that are likely to highlight the headwinds on broadband pricing and volumes, especially with ACP’s recent discontinuation and unlikely revival. When buying a stock for a longer time horizon, it is important for investors to assess where they think the stock is headed in the future. When mapping a stock's future trajectory, investors should consider factors including the future earnings expectations and expected performance against a benchmark. Charter Communications revenue has grown at an average rate of 4.26% annually over the past 5 years. The average 1-year price target from analysts is $285.82, representing an expected -5.12% downside in 2025. While past performance is not a guarantee of future results, investors should also look at a stock's historical performance when compared to both a benchmark index and the company's peers. Shares of Charter Communications have seen an annualized return of -25.35%, underperforming the S&P500 index by 33.6%. This compares to -7.73% growth in the overall Communication Services sector. Charter Communications has a beta of 1.22. CHTR Price Action: Charter Communications shares closed lower by 0.74% at $301.25 on Wednesday. Also Read: Photo via Shutterstock Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Forecasting The Future: 6 Analyst Projections For CarGurus", "title_link": "https://markets.businessinsider.com/news/stocks/forecasting-the-future-6-analyst-projections-for-cargurus-1033527737", "Description": "6 analysts have expressed a variety of opinions on CarGurus (NASDAQ:CARG) over the past quarter, offering a diverse set of opinions from bullish to bearish. The following table summarizes their recent ratings, shedding light on the changing sentiments within the past 30 days and comparing them to the preceding months. Analysts provide deeper insights through their assessments of 12-month price targets, revealing an average target of $27.25, a high estimate of $30.00, and a low estimate of $25.00. Surpassing the previous average price target of $24.60, the current average has increased by 10.77%. A comprehensive examination of how financial experts perceive CarGurus is derived from recent analyst actions. The following is a detailed summary of key analysts, their recent evaluations, and adjustments to ratings and price targets. To gain a panoramic view of CarGurus's market performance, explore these analyst evaluations alongside essential financial indicators. Stay informed and make judicious decisions using our Ratings Table. Stay up to date on CarGurus analyst ratings. CarGurus Inc is a company that acts as an online automotive marketplace connecting buyers and sellers of new and used cars. The company provides three types of marketplace Listing products, Restricted Listings, and Enhanced or Featured Listing through which it offers real-time and historical data analyzing the connections and pricing analysis. The listing platforms offer auto manufacturers and others to buy advertising on the company's site and target consumers based on the make, model, and zip code of the cars. The company operates through two segments namely U.S. Marketplace and Digital Wholesale. It generates majorityof revenue from the U.S. Marketplace. Market Capitalization: Indicating a reduced size compared to industry averages, the company's market capitalization poses unique challenges. Revenue Growth: CarGurus's revenue growth over a period of 3 months has faced challenges. As of 31 March, 2024, the company experienced a revenue decline of approximately -6.97% . This indicates a decrease in the company's top-line earnings. As compared to competitors, the company encountered difficulties, with a growth rate lower than the average among peers in the Communication Services sector. Net Margin: CarGurus's net margin surpasses industry standards, highlighting the company's exceptional financial performance. With an impressive 9.87% net margin, the company effectively manages costs and achieves strong profitability. Return on Equity (ROE): The company's ROE is a standout performer, exceeding industry averages. With an impressive ROE of 3.59%, the company showcases effective utilization of equity capital. Return on Assets (ROA): CarGurus's ROA excels beyond industry benchmarks, reaching 2.38% . This signifies efficient management of assets and strong financial health. Debt Management: With a below-average debt-to-equity ratio of 0.34 , CarGurus adopts a prudent financial strategy, indicating a balanced approach to debt management. Benzinga tracks 150 analyst firms and reports on their stock expectations. Analysts typically arrive at their conclusions by predicting how much money a company will make in the future, usually the upcoming five years, and how risky or predictable that company's revenue streams are. Analysts attend company conference calls and meetings, research company financial statements, and communicate with insiders to publish their ratings on stocks. Analysts typically rate each stock once per quarter or whenever the company has a major update. In addition to their assessments, some analysts extend their insights by offering predictions for key metrics such as earnings, revenue, and growth estimates. This supplementary information provides further guidance for traders. It is crucial to recognize that, despite their specialization, analysts are human and can only provide forecasts based on their beliefs. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Fed Minutes Suggest Officials Still Not Ready To Begin Cutting Interest Rates", "title_link": "https://markets.businessinsider.com/news/interestrates/fed-minutes-suggest-officials-still-not-ready-to-begin-cutting-interest-rates-1033527765", "Description": "(RTTNews) - The Federal Reserve released the minutes of its latest monetary policy meeting on Wednesday, revealing officials are still not prepared to begin cutting interest rates. The minutes of the June 11-12 meeting said participants noted that progress in reducing inflation toward the Fed's 2 percent target had been slower this year than they had expected last December. They emphasized that they did not expect that it would be appropriate to lower the target range for the federal funds rate until additional information had emerged to give them greater confidence that inflation was moving sustainably toward the Committee's 2 percent objective, the Fed said. Participants also emphasized the importance of conditioning future policy decisions on incoming data, the evolving economic outlook, and the balance of risks. During the meeting, the Fed once again decided to maintain the target range for the federal funds rate at 5.25 to 5.50 percent, as was widely expected. Fed officials also provided their latest economic projections at the meeting, with the forecasts suggesting just one interest rate cut this year compared to the three predicted in March. However, the accompanying dot plot suggested there is some division among Fed officials about the outlook for rates this year. The division was also reflected in the minutes of the meeting, which said most participants view the current policy stance as restrictive but some noted there was uncertainty about the degree of restrictiveness of current policy. Some remarked that the continued strength of the economy, as well as other factors, could mean that the longer-run equilibrium interest rate was higher than previously assessed, in which case both the stance of monetary policy and overall financial conditions may be less restrictive than they might appear, the Fed said. The central bank added, A couple of participants noted that the longer-run equilibrium interest rate was a better guide for determining where the federal funds rate may need to move over the longer run than for assessing the restrictiveness of current policy. Some participants emphasized the need for patience in allowing the restrictive policy stance to restrain aggregate demand and further moderate inflation pressures, the minutes said. Several participants also observed that rates might need to be raised if inflation were to persist at an elevated level or to increase further, the Fed said, while a number of participants remarked that monetary policy should stand ready to respond to unexpected economic weakness. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Cracking The Code: Understanding Analyst Reviews For Vulcan Materials", "title_link": "https://markets.businessinsider.com/news/stocks/cracking-the-code-understanding-analyst-reviews-for-vulcan-materials-1033527736", "Description": "Throughout the last three months, 5 analysts have evaluated Vulcan Materials (NYSE:VMC), offering a diverse set of opinions from bullish to bearish. The table below summarizes their recent ratings, showcasing the evolving sentiments within the past 30 days and comparing them to the preceding months. Analysts provide deeper insights through their assessments of 12-month price targets, revealing an average target of $301.6, a high estimate of $322.00, and a low estimate of $272.00. Surpassing the previous average price target of $287.00, the current average has increased by 5.09%. The analysis of recent analyst actions sheds light on the perception of Vulcan Materials by financial experts. The following summary presents key analysts, their recent evaluations, and adjustments to ratings and price targets. Capture valuable insights into Vulcan Materials's market standing by understanding these analyst evaluations alongside pertinent financial indicators. Stay informed and make strategic decisions with our Ratings Table. Stay up to date on Vulcan Materials analyst ratings. Vulcan Materials is the United States' largest producer of construction aggregates (crushed stone, sand, and gravel). Its largest markets include Texas, California, Virginia, Tennessee, Georgia, Florida, North Carolina, and Alabama. In 2023, Vulcan sold 234.3 million tons of aggregates, 13.4 million tons of asphalt mix, and 7.5 million cubic yards of ready-mix. As of Dec. 31, 2022, the company had nearly 16 billion tons of aggregates reserves. Market Capitalization Analysis: Above industry benchmarks, the company's market capitalization emphasizes a noteworthy size, indicative of a strong market presence. Negative Revenue Trend: Examining Vulcan Materials's financials over 3 months reveals challenges. As of 31 March, 2024, the company experienced a decline of approximately -6.26% in revenue growth, reflecting a decrease in top-line earnings. In comparison to its industry peers, the company trails behind with a growth rate lower than the average among peers in the Materials sector. Net Margin: Vulcan Materials's net margin is below industry standards, pointing towards difficulties in achieving strong profitability. With a net margin of 6.64%, the company may encounter challenges in effective cost control. Return on Equity (ROE): Vulcan Materials's ROE lags behind industry averages, suggesting challenges in maximizing returns on equity capital. With an ROE of 1.37%, the company may face hurdles in achieving optimal financial performance. Return on Assets (ROA): Vulcan Materials's ROA is below industry standards, pointing towards difficulties in efficiently utilizing assets. With an ROA of 0.72%, the company may encounter challenges in delivering satisfactory returns from its assets. Debt Management: Vulcan Materials's debt-to-equity ratio is below the industry average at 0.51 , reflecting a lower dependency on debt financing and a more conservative financial approach. Ratings come from analysts, or specialists within banking and financial systems that report for specific stocks or defined sectors (typically once per quarter for each stock). Analysts usually derive their information from company conference calls and meetings, financial statements, and conversations with important insiders to reach their decisions. Analysts may supplement their ratings with predictions for metrics like growth estimates, earnings, and revenue, offering investors a more comprehensive outlook. However, investors should be mindful that analysts, like any human, can have subjective perspectives influencing their forecasts. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "NIO Stock Continues to Climb on Record Q2 Deliveries", "title_link": "https://markets.businessinsider.com/news/stocks/nio-stock-continues-to-climb-on-record-q2-deliveries-1033527751", "Description": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips Chinese electric vehicle manufacturer Nio (NYSE: NIO ) enjoyed a strong outing in the market following a near doubling of vehicle deliveries last month. Adding to the positive sentiment, the broader EV sector has witnessed impressive results. Moving forward, though, the focus will be on maintaining momentum. That may not be so easy given global economic challenges. Earlier this week, Nio announced a record month in June . Deliveries shot up to 21,209 vehicles, representing an increase of 98.1% on a year-over-year basis. Further, the company delivered 57,373 vehicles in the three months ended June. That came out to a 143.9% rise compared to the year-ago period. Cumulatively, deliveries hit 537,020 as of June 30. In a nod to the sustainability sentiments that underline NIO stock and other EV plays, the Chinese automaker recently released its annual environmental, social and governance report. This document details both initiatives and accomplishments in forwarding a more sustainable future. Bolstering enthusiasm for NIO stock is the fact that other Chinese EV makers have flourished. In particular, Zeekr (NYSE: ZK ) – which is owned by Geely Automobile (OTCMKTS: GELYY ) – has been swinging higher off the back of its own record month. In June, the company delivered 20,106 vehicles , bringing its year-to-date count to 87,870. On the other side of the world, sector giant Tesla (NASDAQ: TSLA ) saw its fortunes surge following strong second-quarter stats. During the period, the company produced 410,831 vehicles and delivered 443,956 . The latter print beat analyst expectations, which called for deliveries of 439,000 vehicles. Naturally, the bullishness boosted NIO stock. Nevertheless, the next step for the EV sector is to maintain and grow this momentum. That may be easier said than done. According to the latest ADP report, private payroll growth in the U.S. slipped lower in June, adding 150,000 jobs. Per CNBC , this figure was “below the upwardly revised 157,000 in May and the Dow Jones consensus estimate for 160,000. The total was the lowest monthly gain since January.” As for the Chinese economy, earlier this year, Reuters reported that China has struggled with structural employment challenges . Adding a wrinkle to NIO stock and other Chinese businesses, the nation’s Generation Z demographic is witnessing a rise in so-called “ revenge saving ” – aggressively saving money rather than flaunting wealth. It runs counter to dynamics seen in other countries, potentially impacting economic recovery efforts. On the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article.The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines . On the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article. A former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia. The post NIO Stock Continues to Climb on Record Q2 Deliveries appeared first on InvestorPlace . Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Eli Lilly's Alzheimer's Therapy's Broad Label Reflects Regulatory Confidence in Anti-Amyloid Antibodies: Analyst", "title_link": "https://markets.businessinsider.com/news/stocks/eli-lilly-s-alzheimer-s-therapy-s-broad-label-reflects-regulatory-confidence-in-anti-amyloid-antibodies-analyst-1033527516", "Description": "On Tuesday, the FDA approved Eli Lilly and Co’s (NYSE:LLY) Kisunla (donanemab) once-monthly injection for IV infusion) for adults with early symptomatic Alzheimer’s disease. Once-monthly, Kisunla is the first and only amyloid plaque-targeting therapy with evidence to support stopping therapy when amyloid plaques are removed,which can result in lower treatment costs and fewer infusions. Also Read: Why Is Eli Lilly Stock Trading Higher Premarket Tuesday? Amyloid is a protein produced naturally in the body that can clump together to create amyloid plaques. The excessive buildup of amyloid plaques in the brain may lead to memory and thinking issues associated with Alzheimer’s disease. In the TRAILBLAZER-ALZ 2 Phase 3 study, individuals treated with Kisunla who were less advanced in their disease showed a 35% reduction in decline compared with placebo on the integrated Alzheimer’s Disease Rating Scale (iADRS), which measures memory, thinking, and daily functioning. The overall population’s response to treatment was also statistically significant using theiADRS at 22%. Among the two groups analyzed, participants treated with Kisunla had up to a 39% lower risk of progressing to the next clinical stage of disease than those taking a placebo. Among the overall population of participants, Kisunla reduced amyloid plaques on average by 61% at six months, 80% at 12 months, and 84% at 18 months compared to the start of the study. Kisunla approval follows that of Biogen Inc’s (NASDAQ:BIIB) / Eisai Ltd’s (OTC:ESALF) (OTC:ESAIY) Leqembi as the second approved anti-beta-amyloid monoclonal antibody for Alzheimer’s in as many years. Kisunla will be the more expensive per-year option, with a list price of $32,000, compared to Leqembi, which is priced at $26,500 annually. However, it comes with the option of stopping dosing early if minimal levels of amyloid plaque are identified via PET scan, which could offset longer-term costs (47% of donanemab-treated subjects in TRAILBLAZER-2 stopped therapy after 12 months). William Blair states that Kisunla’s broad label reflects AdCom sentiment and regulatory confidence in anti-amyloid antibodies for Alzheimer’s treatment. The analyst writes this was an expected outcome and should have only a marginal impact on Biogen’s shares. While Kisunla is a strong competitor to Leqembi, there is ample market space for both, given the over 6 million Alzheimer’s patients in the U.S. A second approval will bolster confidence in anti-amyloid antibody efficacy following the Aduhelm setback. Eisai forecasts $350 million in Leqembi sales from March 2024 to March 2025, and the analyst will monitor the uptake, noting Kisunla’s initial potential advantages. Overall, William Blair maintains an Outperform rating for Biogen, seeing Leqembi as a crucial growth driver despite a slower start. Goldman Sachs writes the approval label as in line with expectations, with similar warnings and monitoring requirements outlined for Leqembi and no requirement for tau-based screening. Goldman Sachs updates the model to reflect the increased probability of success on the program to 100% in the U.S., with Eli Lilly’s price target of $793 (vs. $785 prior). Biogen focuses on the launch’s progress regarding infrastructural/logistical bottlenecks. A Goldman Sachs analyst writes that Kisunla’s entry is a positive development in building/expanding the market overall for this generation of Alzheimer’s disease therapeutics. Price Action: LLY shares are down 2.21% at $886.90, and BIIB stock is down 2.43% at $223.27 at the last check on Wednesday. Read Next: Photo via Shutterstock Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Do Options Traders Know Something About Cabot Stock We Don't?", "title_link": "https://markets.businessinsider.com/news/stocks/do-options-traders-know-something-about-cabot-stock-we-don-t-1033527546", "Description": "Investors in Cabot Corporation (NYSE:CBT) need to pay close attention to the stock based on moves in the options market lately. That is because the Jul 19, 2024 $80 Call had some of the highest implied volatility of all equity options today. Implied volatility shows how much movement the market is expecting in the future. Options with high levels of implied volatility suggest that investors in the underlying stocks are expecting a big move in one direction or the other. It could also mean there is an event coming up soon that may cause a big rally or a huge sell-off. However, implied volatility is only one piece of the puzzle when putting together an options trading strategy. Clearly, options traders are pricing in a big move for Cabot shares, but what is the fundamental picture for the company? Currently, Cabot is a Zacks Rank #2 (Buy) in the Chemical - Diversified industry that ranks in the Bottom 27% of our Zacks Industry Rank. Over the last 60 days, three analysts have increased their earnings estimates for the current quarter, while one has dropped the estimates. The net effect has taken our Zacks Consensus Estimate for the current quarter from $1.72 per share to $1.74 in that period. Given the way analysts feel about Cabot right now, this huge implied volatility could mean there's a trade developing. Oftentimes, options traders look for options with high levels of implied volatility to sell premium. This is a strategy many seasoned traders use because it captures decay. At expiration, the hope for these traders is that the underlying stock does not move as much as originally expected. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Robinhood Buys Pluto Capital, Eyes Wealth Business", "title_link": "https://markets.businessinsider.com/news/stocks/robinhood-buys-pluto-capital-eyes-wealth-business-1033527545", "Description": "Robinhood Markets (NASDAQ:HOOD) has announced the acquisition of Pluto Capital Inc., an innovative AI-powered investment research platform. This acquisition marks a significant step for the company as it aims to enhance its offerings with intelligent, data-driven investing tools. With the integration of Pluto's advanced capabilities, the company is set to revolutionize the investment experience for its users. Enhancing Data Analysis and Personalization: Pluto Capital brings to the table its advanced data analytics capabilities, powered by state-of-the-art large language models (LLMs). These models can process and interpret real-time personal and global financial data, enabling quicker identification of trends and opportunities in the market. This technology will give Robinhood's investors a competitive edge, allowing them to make more informed decisions. Pluto's algorithms excel in tailoring investment strategies to individual customer profiles. Pluto offers highly customized recommendations by analyzing factors, including risk tolerance, investment goals and historical behavior. This personalized approach ensures that each investor receives strategies aligned with their unique financial objectives. Real-Time Insights and Portfolio Optimization: One of the standout features of Pluto is its ability to provide real-time updates and insights. This capability allows investors to make swift decisions, optimizing their portfolios continuously for better outcomes. The integration of Pluto's AI-driven analysis into Robinhood's platform means that investors can balance growth and risk according to their individual preferences, enhancing overall investment performance. Jacob Sansbury, the founder and CEO of Pluto, will join Robinhood to accelerate the integration of these AI-powered capabilities across the platform. Sansbury's expertise in artificial intelligence and his mission to democratize finance will be instrumental in driving Robinhood's innovation forward. Robinhood's acquisition of Pluto is part of a broader strategy to expand its global and domestic footprint. Recently, the company announced plans to acquire Bitstamp, a leading cryptocurrency exchange, for approximately $200 million. This move underscores Robinhood's commitment to diversifying its product offerings beyond traditional transaction-related revenues. In addition to the Bitstamp deal, Robinhood is exploring various avenues to enhance its financial services. The company's foray into retirement accounts and its intention of offering advisory services indicate a strategic shift toward becoming a comprehensive financial services provider. By incorporating AI-powered tools and expanding its service portfolio, the company aims to attract a wider range of customers and solidify its position in the market. Last year, Robinhood acquired X1 Inc., a platform that offers a no-fee credit card with rewards on each purchase. The acquisition, valued at approximately $95 million in cash, expanded its product offerings beyond trading and helped diversify its revenue streams. Further, this March, the company unveiled its first-ever credit card. Integrating Pluto Capital will significantly contribute to Robinhood's revenue diversification efforts. The company can introduce new revenue streams from advisory and management fees by offering highly customized investment strategies and real-time portfolio optimization. The steady income from asset management services will complement the company's existing revenue sources, which include trading fees and interest income. Moreover, adopting AI technologies will enhance operational efficiencies, reducing costs and improving customer satisfaction. This diversified revenue model will bolster Robinhood's financial stability and enhance shareholder value over the long term. Shares of this Zacks Rank #2 (Buy) company have jumped 76.3% this year, significantly outperforming the industry's growth of 16.5%. Image Source: Zacks Investment Research Earlier this week, BlackRock announced a deal to acquire Preqin, a premier provider of private markets data, for almost $3.2 billion (£2.55 billion) in cash. This acquisition marks a significant milestone in the company's strategy to enhance its private markets capabilities by integrating investments, technology and data across the entire portfolio. The integration of London-based Preqin's extensive data and research tools with BlackRock's Aladdin platform will create an unmatched private markets technology and data provider. By bringing together Preqin's capabilities with Aladdin's workflow functionalities, BLK aims to deliver a comprehensive solution for fund managers and investors. The move is expected to enhance transparency and access in private markets as well as streamline investment processes. In June, Piper Sandler (NYSE:PIPR) announced a definitive agreement to buy Aviditi Advisors, an alternative investment bank. The acquisition will enhance the company's capabilities in fundraising, secondary solutions and direct investment capital. Thus, it will further solidify PIPR's leadership position in the private equity M&A and capital markets sectors. Following the completion of the acquisition (expected in the third quarter of 2024), Aviditi will form Piper Sandler's private capital advisory group. This will, thereby, expand PIPR's investment banking platform. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Should You Retain Markel Group Stock in Your Portfolio?", "title_link": "https://markets.businessinsider.com/news/stocks/should-you-retain-markel-group-stock-in-your-portfolio-1033527544", "Description": "Markel Group Inc. (NYSE:MKL) has been gaining momentum on the back of new business volume, strong retention levels, an improving rate environment, higher interest income on cash equivalents, strategic buyouts and favorable growth estimates. The Zacks Consensus Estimate for Markel Group's 2024 revenues is pegged at $14.95 billion, implying a year-over-year improvement of 4.6%. The consensus estimate for 2025 earnings per share and revenues indicates an increase of 21% and 5.6%, respectively, from the corresponding 2024 estimates. Earnings have grown 46.2% in the past five years, better than the industry average of 14.4%. Markel Group has a decent earnings surprise history. It beat estimates in two of the last four quarters and missed twice, the average being 33.41%. The Zacks Consensus Estimate for 2024 and 2025 has moved 2% and 1.9% north, respectively, in the past 60 days, reflecting analyst optimism. MKL currently carries a Zacks Rank #3 (Hold). The stock has gained 11.2% against the industry's decline of 5.6% year to date. Image Source: Zacks Investment Research Markel Group's trailing 12-month ROE was 11.2%, up 310 basis points year over year. ROE reflects its efficiency in using its shareholders' funds. MKL has been generating improved premiums. An improvement in new business volume, strong retention levels, continued increases in rates and expanded product offerings should help the insurer retain the momentum. Investment income should continue to benefit from an improving rate environment, higher interest income on cash equivalents, fixed maturity securities and short-term investments due to higher yields. Markel Group considers strategic buyouts a prudent approach to ramp up its growth profile. Acquisitions have helped the company enhance its surety capabilities, ramp up Markel Ventures' revenues and expand its reinsurance product offerings. The insurer has been pursuing acquisitions to achieve profitable growth in insurance operations and create additional value on a diversified basis in Markel Ventures' operations. Higher revenues at construction services and transportation-related businesses due to a combination of increased demand, higher prices and growth, as well as a rise in production at one of the equipment manufacturing businesses are expected to boost operating revenues. The increase also reflected a full-year contribution from Metromont. Banking on a strong capital position, the insurer has engaged in share buybacks. In the first quarter of 2024, MKL doubled its share buyback to $161 million, as its shares traded at a discount. The company has a share repurchase program authorized by the board to buy back up to $750 million of shares. As of Mar 31, 2024, $553.5 million remained available for repurchases under the program. In 2023, the company repurchased shares for $445 million. However, Markel Group is exposed to catastrophe loss, inducing volatility in underwriting results. Exposure to cat loss always remains a concern, given its unprecedented nature. Also, the company has been experiencing an increase in operating expenses due to higher losses and loss adjustment expenses, underwriting, acquisition and insurance expenses. MKL should strive to ensure that growth in total revenues outpaces the rise in expenses. Otherwise, the operating margin is likely to suffer. Some better-ranked stocks from the Diversified Operations industry are Griffon Corporation (NYSE:GFF), Carlisle Companies Incorporated (NYSE:CSL) and ITT Inc. (NYSE:ITT). While Griffon sports a Zacks Rank #1 (Strong Buy), Carlisle and ITT carry a Zacks Rank #2 (Buy) each at present. Griffon delivered a four-quarter average earnings surprise of 33.45%. Year to date, GFF has rallied 6.2%. The Zacks Consensus Estimate for GFF's 2024 and 2025 earnings implies year-over-year growth of 10.1% and 20.6%, respectively. Carlisle delivered a four-quarter average earnings surprise of 16.97%. Year to date, CSL has gained 29.8%. The Zacks Consensus Estimate for CSL's 2024 and 2025 earnings implies year-over-year growth of 28.4% and 8.9%, respectively. ITT beat earnings estimates in three of the last four quarters and matched in the one, the average being 6.49%. Shares of ITT have risen 6.3% year to date. The Zacks Consensus Estimate for ITT's 2024 and 2025 earnings implies year-over-year growth of 12.2% and 13.7%, respectively. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "CMS Energy Rides on Investments and Renewable Expansion", "title_link": "https://markets.businessinsider.com/news/stocks/cms-energy-rides-on-investments-and-renewable-expansion-1033527588", "Description": "CMS Energy Corporation (NYSE:CMS) is making systematic investments to strengthen its operations and benefit by providing high-quality services to its customers. The company is also expanding its renewable generation portfolio, thereby reducing coal-generating units to further promote clean energy. However, this Zacks Rank #3 (Hold) company is exposed to unfavorable costs associated with the shutdown of solid waste disposal facilities for coal ash and fluctuating commodity prices, which act as a headwind. CMS Energy is investing heavily in infrastructure renovations, infrastructure replacements and clean power production to increase customer satisfaction and improve the resiliency of its operation. CMS Energy plans to make capital expenditures worth $17 billion during the 2024-2028 period. CMS Energy intends to install roughly 8,000 MW of solar production by 2040. It also plans to deploy battery storage, beginning in 2024, with 75 MW of energy storage by 2027 and an additional 475 MW by 2040. The company has also announced intentions to build an 85 MW solar array at the former D.E. Karn coal-generating facility. The facility is anticipated to be operational by 2026. Such measures should help CMS Energy expand its renewable energy generation portfolio. Like other utility service providers, CMS Energy is increasingly focusing on making grids more resilient and reliable to support a smooth transition of the industry toward more clean energy adoption, reduce outages for their customers and protect their infrastructure against severe weather conditions, thereby reducing operating costs. A decline in operating costs and higher availability of electricity in its systems will enhance its earnings. As environmental laws on reducing carbon emissions during electricity generation become more stringent, there is still cause for concern despite the fact that the company's power-generating facilities have implemented many pollution control measures. Approximately 20% of its overall power mix was made up of coal as of Dec 31, 2023. CMS incurs considerable expenditures associated with the development, operation and closure of solid waste disposal facilities for coal ash. In order to comply with these laws, consumers anticipate that the company will need to spend $238 million between 2024 and 2028. CMS Energy does not always protect all of its activities against fluctuations in commodity prices. Variations in commodity prices might negatively impact CMS Energy's operational performance if the company has unhedged positions. Some better-ranked stocks from the same industry are CenterPoint Energy (NYSE:CNP), IDACORP, Inc. (NYSE:IDA) and Consolidated Edison (NYSE:ED), each carrying a Zacks Rank #2 (Buy) at present. CenterPoint Energy's long-term (three to five years) earnings growth rate is 7%. The Zacks Consensus Estimate for the company's 2024 sales indicates an improvement of 1% from the prior-year reported figure. IDACORP delivered an average earnings surprise of 6.81% in the last four quarters. The Zacks Consensus Estimate for IDA's 2024 sales suggests an increase of 1.1% from the prior-year reported figure. Consolidated Edison's long-term earnings growth rate is 7.4%. The Zacks Consensus Estimate for ED's 2024 sales calls for an improvement of 3.1% from the prior-year reported figure. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Taiwan Semiconductor's Expansion in AI and 2nm Technology Set to Boost Future Growth, Analyst Says", "title_link": "https://markets.businessinsider.com/news/stocks/taiwan-semiconductor-s-expansion-in-ai-and-2nm-technology-set-to-boost-future-growth-analyst-says-1033527587", "Description": "Taiwan Semiconductor Manufacturing Co (NYSE:TSM) will hold a press conference on July 18. As demand for generative AI continues to expand, UBS gave TSMC a “Buy” rating with a target price of 1,070 yuan. The “four questions” from UBS include the outlook for the semiconductor cycle, gross profit margin trends, capital expenditure updates and order visibility for 2025, and the potential advancement of 2nm processes, UDN reports. UBS noted the semiconductor cycle will benefit from solid cloud AI and high-performance computing (HPC) applications. They expect TSMC’s gross profit margin to rise due to expanding AI demand and advanced process technology. UBS estimates EPS from 2024 to 2028 to be 40.14 yuan, 53.27 yuan, 60.75 yuan, 69.5 yuan, and 80.23 yuan, respectively. UBS analyst Lin Lijun highlighted TSMC’s 2025 outlook, noting increased revenue forecasts and improved demand for 2nm technology. UBS revised TSMC’s capital expenditure from $35 billion to $37 billion, with capital intensity reaching 34%. Lin Lijun is optimistic about TSMC maintaining its position as the primary CoWoS supplier in 2025, with a market share of over 80%. TSMC’s wafer production capacity will likely reach 40,000 per month by 2024 and 55,000 by the end of 2025, courtesy of Nvidia Corp (NASDAQ:NVDA) and other cloud computing applications. Demand for TSMC’s 3nm process remains strong, driven by new products from major SoC players, Intel Corp’s (NASDAQ:INTC) outsourcing orders, and Apple Inc’s (NASDAQ:AAPL) iPhone replacement cycle. Price Action: TSM shares traded higher by 3.75%at$182.29 at the last check Wednesday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo by Ivan Marc via Shutterstock Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Ride the Crude Rally with These 3 Promising Energy Stocks", "title_link": "https://markets.businessinsider.com/news/stocks/ride-the-crude-rally-with-these-3-promising-energy-stocks-1033527586", "Description": "Oil prices have entered a bullish phase, recently reaching a two-month high, capturing significant investor attention. This upward trend indicates a strong and sustained interest in the energy sector, suggesting that energy companies are poised for substantial growth. With oil prices anticipated to remain stable throughout the year, the outlook for these companies appears highly promising. West Texas Intermediate (WTI) crude price is trading at more than $80 per barrel, which is highly favorable for exploration and production activities. WTI crude recently touched $83.38 per barrel, the highest mark since Apr 26. Also, in its short-term energy outlook, the U.S. Energy Information Administration (EIA) projected the average spot price of West Texas Intermediate crude at $79.70 per barrel this year, still favorable for upstream operations. Oil prices remain bullish due to the potential for solid summer fuel demand, depleting inventories and tightening commodity supply. Additionally, concerns over Middle East tensions and the consequent risk of reduced global oil supply are contributing to the sustained upward pressure on prices. High oil prices favor oil exploration and production activities, raising the demand for oilfield services. Oilfield service providers assist upstream companies in efficiently setting up oil and gas wells, benefiting from the heightened activity in the sector. Employing our proprietary stock screener, we have zeroed in on three leading energy stocks, Chevron Corporation (NYSE:CVX), SLB and SM Energy Company (NYSE:SM), that are well-poised to capitalize on a promising crude pricing environment. All the stocks carry a Zacks Rank #2 (Buy). Chevron generates most of its earnings from its upstream operations. The integrated energy giant has a strong foothold in the Permian – the most prolific basin in the United States – where a significant portion of the energy major's acreage has minimum royalty payments. Thus, CVX will generate handsome cashflows through its upstream business, banking on handsome oil prices. In addition to maintaining disciplined capital spending, Chevron has a strong balance sheet, providing a solid foundation to rely on during unfavorable energy market conditions. To expand its premier asset portfolio, SM Energy recently agreed to acquire 80% of XCL Resources' oil and gas assets in the Uinta Basin for $2.04 billion. The value-driven acquisition, likely to close in September this year, will increase its inventory of net locations and boost its oil production. SM Energy is also committed to maintaining its strong balance sheet, which it can rely on during low oil prices. SLB , via its Well Construction business unit, offers products and services aimed at enhancing drilling efficiency and optimizing well placement and performance. As rising oil prices stimulate exploration and production activities, the demand for Well Construction services is expected to grow, positioning SLB to benefit significantly. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "This Oil And Gas Company Has 'Top-Tier Cost Structure, Strong Operational Performance': Analyst", "title_link": "https://markets.businessinsider.com/news/stocks/this-oil-and-gas-company-has-top-tier-cost-structure-strong-operational-performance-analyst-1033527620", "Description": "Shares of Permian Resources Corp (NYSE:PR) were climbing in early trading on Wednesday. The company's increased Delaware footprint and strong M&A track record should support continued organic and inorganic growth, according to BMO Capital Markets. The Permian Resources Analyst: Phillip Jungwirth upgraded the rating for Permian Resources from Market Perform to Outperform, while keeping the price target unchanged at $21. The Permian Resources Thesis: The company has a large-scale and low-cost footprint in Delaware, Jungwirth said in the upgrade note. Check out other analyst stock ratings. Permian Resources has built a sizable position in the Delaware Basin through organic growth, large scale M&A, bolt-ons, and grassroots leasing, the analyst wrote. The scale of more than 400,000 net acres and solid execution have given Permian Resources a top-tier cost structure and strong operational performance, he added. Management estimates 15+ years of inventory, which supports optionality on production growth of 0–10% depending on macro conditions, Jungwirth stated. The Earthstone deal has generated impressive synergy outperformance and additional operating cost improvements are possible, he further said. PR Price Action: Shares of Permian Resources had risen by 1.93% to $16.64 at the time of publication on Wednesday. Now Read: Image: Shutterstock Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "This Charter Communications Analyst Turns Bearish; Here Are Top 5 Downgrades For Wednesday", "title_link": "https://markets.businessinsider.com/news/stocks/this-charter-communications-analyst-turns-bearish-here-are-top-5-downgrades-for-wednesday-1033527619", "Description": "Top Wall Street analysts changed their outlook on these top names. For a complete view of all analyst rating changes, including upgrades, downgrades and initiations, please see our analyst ratings page. Check This Out: How To Earn $500 A Month From AZZ Stock Ahead Of Q1 Earnings Report Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "General Motors Q2 US Deliveries Rise on Strong EV Sales", "title_link": "https://markets.businessinsider.com/news/stocks/general-motors-q2-us-deliveries-rise-on-strong-ev-sales-1033527584", "Description": "General Motors Company (NYSE:GM) reported its best quarterly sales in the United States in more than three years, with significant increases in full-size pickup trucks and EVs. The automaker sold 696,086 units in the second quarter, rising 0.6% year over year and the highest since the fourth quarter of 2020. EV deliveries rose 40% year over year to 21,930 units, comprising only 3.2% of total second-quarter sales. The year-over-year rise in EV sales was fueled by electric Hummer, which sold 2,929 units in the second quarter compared with 47 units in the year-ago period. LYRIQ is rapidly gaining traction in the EV market, with second-quarter sales increasing 26% compared with the first quarter. GM sold approximately 229,000 full-size pickup trucks, up 6% year over year, marking the highest quarterly sales since 2021. However, General Motors' total sales for the first half of the year were down 0.4% year over year, totaling around 1.3 million vehicles. GM's second-quarter sales are projected to be slightly above the overall industry. Cox Automotive and Edmunds, both auto industry forecasters, anticipate second-quarter sales industrywide, including Jul 1, 2024, to remain roughly level from a year earlier due to slowing retail demand. The automaker is making a strong push on SUVs and plans to release eight all-new or redesigned internal combustion engine SUVs by the end of the year. A significant unknown factor in the second quarter is the impact of cyberattacks on dealer software provider CDK Global. The Jun 19, 2024, ransomware attack forced CDK, a market leader, to shut down its dealer management system, affecting nearly half of all dealerships in North America. Per GM, dealers using the CDK platform are striving to meet high customer demand despite challenging conditions. Some deliveries might be delayed until the third quarter. Dealers, including the largest publicly traded ones, were compelled to delay sales or find workarounds due to the attacks. Per Automotive News, five out of the six major publicly traded franchised dealership groups use CDK as their primary dealership management system provider. Those dealership groups include Asbury Automotive Group, AutoNation Inc., Group 1 Automotive Inc., Lithia Motors Inc. and Sonic Automotive Inc. The Hyundai brand reported sales of 214,719 vehicles in the second quarter, rising 2.2% from the year-ago quarter. Kia, which releases sales figures monthly, saw a 6.5% decline in June sales. For the first half of the year, Kia's sales were down approximately 2%, totaling 386,460 vehicles. GM currently carries a Zacks Rank #3 (Hold). Some better-ranked stocks in the auto space are Blue Bird Corporation (NASDAQ:BLBD), Geely Automobile Holdings Limited (OTC:GELYY) and American Axle & Manufacturing Holdings, Inc. (NYSE:AXL), each sporting a Zacks Rank #1 (Strong Buy) at present. The consensus estimate for BLBD's 2024 sales and earnings suggests year-over-year growth of 17.29% and 155.14%, respectively. The EPS estimates for 2024 and 2025 have improved 63 cents and 69 cents, respectively, in the past 60 days. The Zacks Consensus Estimate for GELYY's 2024 sales suggests year-over-year growth of 36.63%. The EPS estimates for 2024 and 2025 have improved 21 cents and 34 cents, respectively, in the past 60 days. The Zacks Consensus Estimate for AXL's 2024 sales and earnings suggests year-over-year growth of 3.05% and 544.44%, respectively. The EPS estimates for 2024 have moved up 5 cents in the past 60 days. The EPS estimates for 2025 have moved up 20 cents in the past 30 days. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Mortgage Applications Fall As Rates Climb Back Above 7%", "title_link": "https://markets.businessinsider.com/news/etf/mortgage-applications-fall-as-rates-climb-back-above-7-1033527616", "Description": "Mortgage applications have slowed as the average interest rate for 30-year mortgages has gone back above 7%. Loan requests declined 2.6% on a seasonally adjusted basis as of June 28 from a week earlier, according to data from the Mortgage Bankers Association's Weekly Applications Survey. The average contract interest rate for 30-year fixed-rate mortgages with loan balances below $766,550 or less rose to 7.03% from 6.93%. The same interest rate for 15-year fixed-rate mortgages increased to 6.56% from 6.46%. Mortgage rates moved higher last week, crossing the 7 percent mark, even as the latest inflation data has kept market expectations alive for a rate cut from the Fed later this year, Chief Economist Mike Fratantoni said in a statement. “Purchase applications decreased the final full week of June, even as both new and existing inventories have increased over the past few months.” Also Read: Mortgage Rates Fall For Third Straight Week With Signs Of Lower Inflation, Fed Rates The Federal Reserve has kept its key interest rate between 5.25% and 5.50% as it aims to push a 3.4% rate of inflation to 2%, but it does plan on cutting the rate once later this year. Data released by Freddie Mac on Wednesday showed the 30-year fixed-rate mortgage averaged 6.95%, up from 6.86% the previous week and 6.81% a year ago. The 15-year FRM averaged 6.25%, rising from 6.16% last week and slightly higher than the 6.24% average a year earlier. Price Action: Mortgage lender stocks trended downward in Wednesday’s mid-morning trading. JPMorgan Chase & Co. (NYSE:JPM) slipped 0.40% to $208.00, while Bank of America Corporation (NYSE:BAC) declined 0.28% to $40.81 and Wells Fargo & Company fell 0.98% to $60.37. Mortgage-backed security exchange-traded funds picked up ground by mid-morning. The iShares MBS ETF (NASDAQ:MBB) and the Vanguard Mortgage-Backed Securities ETF (NASDAQ:VMBS) both rose 0.58%, while the SPDR Bloomberg Barclays Mortgage Backed Bond ETF (NYSE:MBG) moved up 0.11%. Read Now: Image created using artificial intelligence via Midjourney. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "European Stocks Close On Firm Note On Rate Cut Hopes", "title_link": "https://markets.businessinsider.com/news/stocks/european-stocks-close-on-firm-note-on-rate-cut-hopes-1033527625", "Description": "(RTTNews) - European stocks closed higher on Wednesday, with investors building up some positions ahead of elections in the U.K., and France, scheduled to take place on Thursday and Sunday, respectively. Investors digested the latest batch of economic data from Europe and the U.S., as well as some corporate news from the region. Dovish comments from Federal Reserve Chair Jerome Powell aided sentiment. On Tuesday, Powell acknowledged progress in disinflation but added that officials need more confidence before cutting interest rates. On the political front, over 200 candidates have reportedly withdrawn from France's runoff election to block far-right, as Macron and left-wing coalition unite. Marine Le Pen said that the National Rally would still try and form a government even if they failed to achieve an overall majority. Elsewhere in the U.K., the Labour Party is set to grab 484 out of the total 650 seats in the Parliament, a pre-poll company Survation projected. The pan European Stoxx 600 climbed 0.74%. The U.K.'s FTSE 100 gained 0.61%, while Germany's DAX and France's CAC 40 jumped 1.16% and 1.24%, respectively. Switzerland's SMI edged up 0.06%. Among other markets in Europe, Austria, Belgium, Finland, Greece, Netherlands, Poland, Portugal, Spain, Sweden and Turkiye ended notably higher. Iceland and Norway edged up marginally, while Denmark and Russia closed weak. In the UK market, International Consolidated Airlines Group rallied 5.51%. EasyJet gained 4.2%, and Fresnillo climbed 4.1%. Barclays Group, Burberry Group, Antofagasta, Croda International, Vistry Group, Rio Tinto, Mondi, United Utilities, Howden Joinery, Rentokil Initial, Severn Trent, Schrodders, Glencore, Persimmon, Entain, Prudential and Rolls-Royce Holdings gained 2 to 3.5%. JD Sports Fashion dropped 4%. after Barclays downgraded the stock to underweight from equalweight. 3i Group, Hikma Pharmaceuticals, B&M European Value Retail, Shell and Reckitt Benckiser ended moderately lower. In the German market, Rheinmetall, Sartorius, Siemens Energy, Deutsche Bank, Zalando, Deutsche Post, Continental, MTU Aero Engines and HeidelbergCement climbed 2 to 5%. Vonovia, RWE, Infineon, Bayer, Porsche, SAP, BASF, Siemens, Mercedes-Benz, and E.ON also posted notable gains. Munich RE, Daimler Truck Holding, Hannover Rueck, Henkel, Qiagen, Beiersdorf and Siemens Healthineers closed lower by 0.5 to 1.4%. In the French market, Teleperformance surged more than 5%. Saint-Gobain, Airbus Group, Pernod Ricard, STMicroElectronics, Accor, Veolia, BNP Paribas, Thales, Edenred, Credit Agricole, Dassault Systemes, Societe Generale, Schneider Electric and AXA gained 2 to 3.3%. In economic news, euro area private sector expanded at the end of the second quarter but the growth lost momentum due to the softening demand and weaker sales, final results of the HCOB Purchasing Managers' survey, compiled by S&P Global, showed. The composite output index registered 50.9 in June, down from 52.2 in the previous month. The score was slightly above the flash score of 50.8. Data from Eurostat showed eurozone producer prices continued to decline in May but the pace of decrease softened as the decline in energy prices slowed further. Producer prices posted an annual fall of 4.2% in May after a 5.7% decrease in April. Prices were expected to grow 4.1%. Excluding energy, producer prices were down 0.4%, following April's 0.9% decrease. The UK service sector's growth moderated further in June to the lowest level in seven months amid softer demand conditions ahead of the upcoming general election, final survey data from S&P Global showed. The S&P Global Services Purchasing Managers' Index dropped to 52.1 in June from 52.9 in the previous month. The flash score was 51.2. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Costco Up 30% in 1H: How Should Investors Play in 2H?", "title_link": "https://markets.businessinsider.com/news/stocks/costco-up-30-in-1h-how-should-investors-play-in-2h-1033527585", "Description": "Costco Wholesale Corporation (NASDAQ:COST), a stalwart in the retail sector, has demonstrated resilience amid market volatility, rewarding investors with substantial returns. The Issaquah, Washington-based company, known for its membership-based warehouse model, has significantly outperformed both its industry peers and the broader S&P 500 index in the first half of the year. Costco's robust performance can be attributed to its strategic initiatives, effective pricing strategies and consistent growth in membership numbers. These factors have driven impressive sales growth and bolstered investor confidence. Costco's stock has surged approximately 30.1% year to date, surpassing the industry's 17% rise. Closing at $859.36 as of Jul 2, shy of its 52-week high of $873.96 reached on Jun 18, 2024, the stock shows potential for further upward movement. Image Source: Zacks Investment Research Technical indicators are supportive of Costco's strong performance. The stock is trading above both its 50-day and 200-day moving averages, indicating robust upward momentum and price stability. This technical strength reflects positive market perception and confidence in Costco's financial health and prospects. Image Source: Zacks Investment Research Costco continues to be one of the dominant warehouse retailers based on the expanse and quality of merchandise offered. A customer-centric approach, strategic pricing, merchandise initiatives and an emphasis on memberships have helped Costco post consistent sales growth. Costco's net sales for May increased by 8.1%, reaching $19.64 billion, up from $18.16 billion in the same period last year. This follows improvements of 7.1% in April and 9.4% in March, reflecting a strong and consistent sales performance over the past few months. Comparable sales for the four weeks ended Jun 2, 2024 advanced 6.4%. This followed an increase of 5.6% in April and 7.7% in March. One of Costco's unique strengths is its membership-based business model. The company boasts high membership renewal rates, often exceeding 90%, which indicates strong customer loyalty and a steady stream of recurring revenues. Membership fees provide a stable income regardless of economic conditions. Costco's total paid memberships reached approximately 74.5 million by the end of the third quarter of fiscal 2024, marking a 7.8% year-over-year increase. Additionally, membership income saw 7.6% growth in the quarter. Costco's digital and e-commerce initiatives continue to gain traction, contributing to overall sales growth. Total e-commerce sales grew 20.7% during the third quarter of fiscal 2024. Deliveries through Costco logistics rose 28% in the quarter. Costco Next, the curated marketplace, added eight new vendors, bringing the total to 75. App downloads increased 32% year over year, and site traffic jumped 16%, reflecting Costco's successful digital engagement strategies. The expansion of the partnership with Uber Eats to cover all of Canada and 17 U.S. states enhances Costco's delivery capabilities and customer convenience, potentially driving further e-commerce growth. Costco's sturdy balance sheet equips it to deal with cyclical downturns and tap growth opportunities. With cash & cash equivalents (including short-term investments of $1,095 million) of $11,499 million at the end of the third quarter of fiscal 2024, Costco looks quite comfortable from the liquidity point of view. Also, solid cash flow generation allows it to raise dividends consistently. The company generated an operating cash flow of $8,381 million for the 36 weeks ended May 12, 2024. COST's payout ratio is 29, with a five-year dividend growth rate of 12.6%. The company last raised its quarterly dividend by 13.7%. Reflecting the positive sentiment around Costco, the Zacks Consensus Estimate for earnings per share has seen upward revisions. Over the past 30 days, analysts have increased their estimates for both the current and next fiscal year by 0.4% to $16.27 and $17.58 per share, respectively. These estimates indicate expected year-over-year growth rates of 10.8% and 8.1%, respectively. Image Source: Zacks Investment Research With the decline of stimulus-driven spending and persistently high interest rates, the industry finds itself at a pivotal juncture. Inflationary pressures are causing consumers to be more judicious with their disposable income, affecting various merchandise categories and creating hurdles for retailers. The drop in U.S. consumer sentiment in June signals further potential challenges as decreased consumer confidence could lead to reduced spending, exacerbating the industry's struggle. It is essential to acknowledge the presence of the aforementioned headwinds, which may pose challenges to Costco's stock. Additionally, margins remain a critical area to monitor, with potential concerns stemming from any deleverage in the SG&A rate. Despite Costco's strong technical performance, there are concerns from a valuation standpoint. Costco is currently trading at a premium compared to its industry peers, such as Dollar General Corporation (NYSE:DG), Target Corporation (NYSE:TGT) and Ross Stores (NASDAQ:ROST). Costco's forward 12-month price-to-earnings ratio stands at 49.47, significantly higher than the industry's ratio of 30.73 and the S&P 500's ratio of 21.50. This suggests that investors may be paying a high price relative to the company's expected earnings growth. COST has a Value Score of C. Image Source: Zacks Investment Research Costco continues to be a standout performer, driven by its resilient business model, strategic initiatives and strong financial fundamentals. While economic uncertainties pose challenges, Costco's proactive approach positions it well for sustained growth. Potential new shareholders might consider the current valuation before entering, but current stakeholders should maintain their position in this Zacks Rank #3 (Hold) stock. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "BlackRock's Outlook Lowered by Moody's on Debt Concern", "title_link": "https://markets.businessinsider.com/news/stocks/blackrock-s-outlook-lowered-by-moody-s-on-debt-concern-1033527615", "Description": "BlackRock 's (NYSE:BLK) outlook has been downgraded to negative from stable by Moody's Investors Service. The action followed the company's announcement to acquire Preqin for almost $3.2 billion (£2.55 billion) in cash. This marked the second major deal for the company. Also, the rating agency affirmed the senior unsecured Aa3 ratings of BlackRock and its subsidiary BlackRock Funding, Inc. Additionally, the company's long-term and short-term issuer ratings have been affirmed at Aa3 and P-1, respectively. The change in BlackRock's rating outlook to negative is attributed to the substantial size and scope of two significant acquisitions announced within a brief period. Alongside the recently disclosed buyout of Preqin, which will be financed through new debt, BlackRock Funding has already secured debt to finance the $3.0 billion cash component of its $12 billion acquisition of Global Infrastructure Partners (GIP). This GIP deal is expected to close later this year. These acquisitions are set to elevate BlackRock's adjusted debt by more than $6 billion, taking it to approximately $14.7 billion. Consequently, the company's leverage ratio is projected to rise to between 1.6 and 1.7, slightly exceeding Moody's leverage-related downgrade trigger of 1.5. While Moody's anticipates that BlackRock's leverage ratio will eventually decline below 1.5, this is unlikely to be achieved within the next 12 months. The immediate financial benefit from Preqin is expected to be minimal, with projected revenues of $240 million in 2024, which is approximately 1% of BlackRock's overall revenues. The acquisition is driven by anticipated growth, as Preqin's revenues have witnessed a compound annual rate of around 20% in recent years. Preqin, a leading private markets data provider, aligns well with BlackRock's evolving strategy of transforming into an investment services software platform. The integration is expected to generate revenue synergies as BLK combines Preqin's data with its alternative asset management platform, eFront, which facilitates the creation, management and monitoring of alternative asset portfolios. The negative outlook underscores concerns that BlackRock's leverage may remain above the downgrade threshold of 1.5x adjusted EBITDA, even after the full integration of the Preqin and GIP acquisitions. Moody's will closely monitor the company's progress in integrating these acquisitions and fostering their growth. There is concern that the simultaneous absorption of two major acquisitions could strain BlackRock's management resources despite having a strong track record with large acquisitions. For BlackRock to maintain its current rating, it must demonstrate success in accelerating growth in technology-based revenues, increasing investment advisory and performance fees from alternative management and reducing its leverage multiple. Conversely, a lack of progress in achieving acquisition goals and reducing leverage could result in a downgrade. Given the negative outlook, a rating upgrade is unlikely in the near term. As pointed out by Moody's, BlackRock has sufficient experience in integrating large deals. Hence, we believe once the Preqin and GIP acquisitions are complete and the company starts generating synergies, a high debt burden will not be a major concern. Over the past year, shares of BlackRock have gained 13.7%, underperforming the industry's rally of 26.3%. Image Source: Zacks Investment Research Currently, BLK carries a Zacks Rank #3 (Hold). Last month, Bank OZK 's (NASDAQ:OZK) ratings and outlook were affirmed by Moody's Ratings. This decision underscores the balance between the bank's strong financial metrics and the risks associated with its substantial exposure to commercial real estate (CRE) loans. The rating agency has affirmed all the ratings and assessments of Bank OZK, including its long-term local currency deposit rating of A3 and short-term local currency deposit rating of Prime-2. Despite the affirmation, the outlook on the bank's long-term deposit and issuer ratings remains negative. Further, Associated Banc-Corp 's (NYSE:ASB) outlook was reaffirmed as stable by Moody's. The rating agency also reiterated the company's Baa3 standalone baseline credit assessment. Further, the company's issuer rating of Baa3 for long-term senior unsecured notes remained unchanged. Per Moody's, ASB's ratings affirmation reflected the balance between its credit headwinds due to its significantly concentrated portfolio in CRE loans and the offsetting qualitative and quantitative risk mitigating factors. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "9 Analysts Assess Hancock Whitney: What You Need To Know", "title_link": "https://markets.businessinsider.com/news/stocks/9-analysts-assess-hancock-whitney-what-you-need-to-know-1033527635", "Description": "Throughout the last three months, 9 analysts have evaluated Hancock Whitney (NASDAQ:HWC), offering a diverse set of opinions from bullish to bearish. The table below offers a condensed view of their recent ratings, showcasing the changing sentiments over the past 30 days and comparing them to the preceding months. In the assessment of 12-month price targets, analysts unveil insights for Hancock Whitney, presenting an average target of $50.78, a high estimate of $57.00, and a low estimate of $45.00. Consistency is reflected as the current average remains at the same level as the previous average price target. A clear picture of Hancock Whitney's perception among financial experts is painted with a thorough analysis of recent analyst actions. The summary below outlines key analysts, their recent evaluations, and adjustments to ratings and price targets. Analyzing these analyst evaluations alongside relevant financial metrics can provide a comprehensive view of Hancock Whitney's market position. Stay informed and make data-driven decisions with the assistance of our Ratings Table. Stay up to date on Hancock Whitney analyst ratings. Hancock Whitney Corp operates bank offices and financial centers. The company offers a range of traditional and online banking services to commercial, small business and retail customers, providing a variety of transaction and savings deposit products, treasury management services, secured and unsecured loan products (including revolving credit facilities), letters of credit and similar financial guarantees. The Bank provides trust and investment management services to retirement plans, corporations and individuals and provides its customers access to investment advisory and brokerage products. Market Capitalization Analysis: The company's market capitalization is below the industry average, suggesting that it is relatively smaller compared to peers. This could be due to various factors, including perceived growth potential or operational scale. Negative Revenue Trend: Examining Hancock Whitney's financials over 3 months reveals challenges. As of 31 March, 2024, the company experienced a decline of approximately -3.75% in revenue growth, reflecting a decrease in top-line earnings. As compared to competitors, the company encountered difficulties, with a growth rate lower than the average among peers in the Financials sector. Net Margin: Hancock Whitney's net margin is impressive, surpassing industry averages. With a net margin of 30.7%, the company demonstrates strong profitability and effective cost management. Return on Equity (ROE): Hancock Whitney's financial strength is reflected in its exceptional ROE, which exceeds industry averages. With a remarkable ROE of 2.82%, the company showcases efficient use of equity capital and strong financial health. Return on Assets (ROA): Hancock Whitney's financial strength is reflected in its exceptional ROA, which exceeds industry averages. With a remarkable ROA of 0.3%, the company showcases efficient use of assets and strong financial health. Debt Management: The company maintains a balanced debt approach with a debt-to-equity ratio below industry norms, standing at 0.09 . Analysts are specialists within banking and financial systems that typically report for specific stocks or within defined sectors. These people research company financial statements, sit in conference calls and meetings, and speak with relevant insiders to determine what are known as analyst ratings for stocks. Typically, analysts will rate each stock once a quarter. Analysts may supplement their ratings with predictions for metrics like growth estimates, earnings, and revenue, offering investors a more comprehensive outlook. However, investors should be mindful that analysts, like any human, can have subjective perspectives influencing their forecasts. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Navigating 12 Analyst Ratings For Western Alliance", "title_link": "https://markets.businessinsider.com/news/stocks/navigating-12-analyst-ratings-for-western-alliance-1033527634", "Description": "Throughout the last three months, 12 analysts have evaluated Western Alliance (NYSE:WAL), offering a diverse set of opinions from bullish to bearish. The table below offers a condensed view of their recent ratings, showcasing the changing sentiments over the past 30 days and comparing them to the preceding months. Analysts' evaluations of 12-month price targets offer additional insights, showcasing an average target of $75.33, with a high estimate of $86.00 and a low estimate of $68.00. This current average represents a 3.87% decrease from the previous average price target of $78.36. In examining recent analyst actions, we gain insights into how financial experts perceive Western Alliance. The following summary outlines key analysts, their recent evaluations, and adjustments to ratings and price targets. To gain a panoramic view of Western Alliance's market performance, explore these analyst evaluations alongside essential financial indicators. Stay informed and make judicious decisions using our Ratings Table. Stay up to date on Western Alliance analyst ratings. Western Alliance Bancorporation is a Las Vegas-based holding company with regional banks operating in Nevada, Arizona, and California. The bank offers retail banking services and focuses on mortgages for retail customers and commercial loans. The company's reportable segments are Commercial segment includes provides commercial banking and treasury management products and services to small and middle-market businesses, specialized banking services to sophisticated commercial institutions and investors within niche industries, as well as financial services to the real estate industry. Consumer Related segment offers both commercial banking services to enterprises in consumer-related sectors and consumer banking services, such as residential mortgage banking. Corporate & Other. Market Capitalization Analysis: Below industry benchmarks, the company's market capitalization reflects a smaller scale relative to peers. This could be attributed to factors such as growth expectations or operational capacity. Positive Revenue Trend: Examining Western Alliance's financials over 3 months reveals a positive narrative. The company achieved a noteworthy revenue growth rate of 28.89% as of 31 March, 2024, showcasing a substantial increase in top-line earnings. In comparison to its industry peers, the company stands out with a growth rate higher than the average among peers in the Financials sector. Net Margin: Western Alliance's net margin is impressive, surpassing industry averages. With a net margin of 30.18%, the company demonstrates strong profitability and effective cost management. Return on Equity (ROE): The company's ROE is a standout performer, exceeding industry averages. With an impressive ROE of 2.99%, the company showcases effective utilization of equity capital. Return on Assets (ROA): The company's ROA is below industry benchmarks, signaling potential difficulties in efficiently utilizing assets. With an ROA of 0.24%, the company may need to address challenges in generating satisfactory returns from its assets. Debt Management: Western Alliance's debt-to-equity ratio is notably higher than the industry average. With a ratio of , the company relies more heavily on borrowed funds, indicating a higher level of financial risk. Benzinga tracks 150 analyst firms and reports on their stock expectations. Analysts typically arrive at their conclusions by predicting how much money a company will make in the future, usually the upcoming five years, and how risky or predictable that company's revenue streams are. Analysts attend company conference calls and meetings, research company financial statements, and communicate with insiders to publish their ratings on stocks. Analysts typically rate each stock once per quarter or whenever the company has a major update. Some analysts also offer predictions for helpful metrics such as earnings, revenue, and growth estimates to provide further guidance as to what to do with certain tickers. It is important to keep in mind that while stock and sector analysts are specialists, they are also human and can only forecast their beliefs to traders. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Expert Ratings For Huntington Bancshares", "title_link": "https://markets.businessinsider.com/news/stocks/expert-ratings-for-huntington-bancshares-1033527633", "Description": "Huntington Bancshares (NASDAQ:HBAN) has been analyzed by 16 analysts in the last three months, revealing a diverse range of perspectives from bullish to bearish. The following table provides a quick overview of their recent ratings, highlighting the changing sentiments over the past 30 days and comparing them to the preceding months. Analysts' evaluations of 12-month price targets offer additional insights, showcasing an average target of $15.5, with a high estimate of $18.00 and a low estimate of $11.50. The average price target has stayed the same, reflecting a consistent view from analysts. In examining recent analyst actions, we gain insights into how financial experts perceive Huntington Bancshares. The following summary outlines key analysts, their recent evaluations, and adjustments to ratings and price targets. Assessing these analyst evaluations alongside crucial financial indicators can provide a comprehensive overview of Huntington Bancshares's market position. Stay informed and make well-judged decisions with the assistance of our Ratings Table. Stay up to date on Huntington Bancshares analyst ratings. Huntington Bancshares Inc is a regional bank holding company headquartered in Columbus, Ohio. The bank operates in two business segments: Consumer & Regional Banking and Commercial Banking. The bank derives the maximum of its revenue from the Consumer & Business Banking segment. The other segment of the bank consists of Treasury and others. The bank also provides auto dealer, equipment finance, investment management, trust, brokerage, capital market services, and other services. Market Capitalization Analysis: Above industry benchmarks, the company's market capitalization emphasizes a noteworthy size, indicative of a strong market presence. Negative Revenue Trend: Examining Huntington Bancshares's financials over 3 months reveals challenges. As of 31 March, 2024, the company experienced a decline of approximately -8.69% in revenue growth, reflecting a decrease in top-line earnings. As compared to competitors, the company encountered difficulties, with a growth rate lower than the average among peers in the Financials sector. Net Margin: Huntington Bancshares's net margin lags behind industry averages, suggesting challenges in maintaining strong profitability. With a net margin of 21.84%, the company may face hurdles in effective cost management. Return on Equity (ROE): Huntington Bancshares's ROE is below industry averages, indicating potential challenges in efficiently utilizing equity capital. With an ROE of 2.26%, the company may face hurdles in achieving optimal financial returns. Return on Assets (ROA): Huntington Bancshares's ROA lags behind industry averages, suggesting challenges in maximizing returns from its assets. With an ROA of 0.2%, the company may face hurdles in achieving optimal financial performance. Debt Management: With a high debt-to-equity ratio of 0.88 , Huntington Bancshares faces challenges in effectively managing its debt levels, indicating potential financial strain. Within the domain of banking and financial systems, analysts specialize in reporting for specific stocks or defined sectors. Their work involves attending company conference calls and meetings, researching company financial statements, and communicating with insiders to publish analyst ratings for stocks. Analysts typically assess and rate each stock once per quarter. Some analysts will also offer forecasts for metrics like growth estimates, earnings, and revenue to provide further guidance on stocks. Investors who use analyst ratings should note that this specialized advice comes from humans and may be subject to error. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Europe Is Turning Cash Flow Positive, 'We'll See What Happens In The U.S.,' Says Curaleaf's Boris Jordan", "title_link": "https://markets.businessinsider.com/news/stocks/europe-is-turning-cash-flow-positive-we-ll-see-what-happens-in-the-u-s-says-curaleaf-s-boris-jordan-1033527632", "Description": "On July 1, 2024, Boris Jordan , chairman of Curaleaf Holdings (OTC:CURLF), participated in a fireside chat with Pablo Zuanic , senior analyst to discussCuraleaf's strategic initiatives in Europe and the hemp derivatives market. Jordan noted that Curaleaf anticipated European market's potential three years ago and strategically capitalized on its growth, especially in Germany. Germany is running ahead of our expectations for the first quarter. We are now about 40% above our internal targets for the second quarter. We're on a run rate of between $100 and $120 million for the year,” Jordan stated, predicting substantial growth in the coming quarters. Read Also:Curaleaf International Is Beating Illicit Cannabis Prices In UK And Germany - What's Next For EU Expansion? Jordan noted Curaleaf's strategy to balance supply by maintaining 50% of their product and sourcing the remaining 50% from other suppliers. This approach helps manage price fluctuations and ensures a diverse product range, from Portugal and Canada. Most operators in Germany and Europe, including other wholesalers, operate at single-digit gross margins. Curaleaf, however, achieves close to a 40% gross margin due to our vertical integration, full supply chain control, and strong ground-level relationships, Jordan said. In 2022, Curaleaf acquired a 55% stake in Four 20 Pharma GmbH , a fully EU-GMP & GDP licensed German producer and distributor of medical cannabis. Curaleaf plans to develop the remaining shares by the end of next year. Jordan praised the entrepreneurial skills of Four 20 Pharma's founders and the synergy between the companies. The acquisition of NGC also strategically boosted Curaleaf's margins by eliminating intermediary costs. “420 Pharma was buying almost 100% of their capacity through NGC. Most of the NGC capacity was going to Germany through Four 20 Pharma. When we bought Four 20 Pharma, we realized we were paying NGC a 25 to 30% margin for buying, repackaging, and reselling their product under our European brand. We questioned why we were financing this company and paying that margin, so we decided to buy them,” Jordan explained. “This mutual agreement allowed us to increase our margins dramatically. We now control a fully GMP-certified indoor facility that can export to Europe, acquired at a discounted price. The timing and price were very good, and it made strategic sense to do it. Jordan revealed that Curaleaf had considered the hemp derivatives market three years ago but faced internal resistance and high supply chain costs. Recent developments allowed them to compete effectively, leading to the launch of seltzers and gummies. If you look at existing markets, growth is reasonably flat because the regulated market serves long-time users. Hemp has opened new markets with broader product distribution, pressuring the regulated market. We must be in this market as it's a major hedge and brand expansion, Jordan said. We decided to build our brands ourselves since we have the infrastructure and no barriers to entry. Select is one of the most recognized brands, and distributors prefer a regulated brand with a good safety reputation. We're also considering low-dose products like hemp cigarettes and microdose products. Jordan also discussed Curaleaf's plans in Ohio, Pennsylvaniaand Florida. In Florida, Curaleaf aims to have 85 stores operational by the time adult-use legislation potentially passes, with significant cultivation capacity ready to meet demand. In Ohio, Curaleaf plans to open eight stores within a year, leveraging its strong wholesale business. In Pennsylvania, they are prepared for substantial growth with existing and expandable cultivation facilities. “In Pennsylvania, we have more than enough capacity to meet the demand. It's one of our best markets, it is one state where we could expand further on the retail side, Jordan told Zuanic. He also touched on the bigger picture: rescheduling cannabis. We'll see what happens in the U.S. with rescheduling and make decisions based on that. We have a call option on our local partner, and over the next six months, we aim to consolidate to 100% ownership in our European business. If we don't get Schedule III, we can spin out the European business and list it on a major exchange or bring in a partner. Europe is just turning cash flow positive, which is very exciting, and we're focused on that. Read Next:Beyond Europe And North America: Curaleaf's Strategist On Cannabis Markets In Australia, New Zealand, And Israel These issues will be a hot topicat the upcoming Benzinga Cannabis Capital Conference in Chicago this Oct. 8-9. Join us to get more insight into what the wave of weed legalization means for the future of investing in theindustry. Hear directly from top executives, investors, advocates, and policymakers.Get your tickets nowbefore prices go up by followingthis link. Photo: AI-Generated Image. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "First Foundation Stock Plunges After $228M Fundraise: Regional Bank Has Heavy Commercial Real Estate Exposure", "title_link": "https://markets.businessinsider.com/news/etf/first-foundation-stock-plunges-after-228m-fundraise-regional-bank-has-heavy-commercial-real-estate-exposure-1033527697", "Description": "Shares of First Foundation Inc. (NYSE:FFWM), a Texas-based regional bank facing commercial real-estate risks, dropped significantly on Wednesday after it received some badly needed help from a group of investors led by Fortress Investment Group . The stock closed at $6.58 a share on Tuesday but fell 24.7% to $4.95 by mid-day on Wednesday. Fortress, Canyon Partners , Strategic Value Bank Partners , North Reef Capital and other investors agreed to buy $228 million in common and preferred shares at $4.10 each fromthe Dallas bank, which has about $14 billion in assets, according to the firms, the Wall Street Journal reported. Fortress will invest $115 million in First Foundation as part of the deal, while Canyon Partners will invest $46 million. Strategic Value and North Reef Capital plan to invest $22 million each. Fortress will own 24.9% of the bank after the deal closes, while other investors will own as much as 10%. Also Read: EXCLUSIVE: Regional Banks A Buying Opportunity Amid ‘Ridiculously Cheap Valuations,’ Veteran Value Investor Says The infusion is intended to give First Foundation some time to sell off certain loans, according to people close to the matter. The commercial real-estate market has suffered as a result of higher interest rates and the rise of remote work leading to widespread declines in property values. That has increasingly threatened to leave banks with big losses, especially smaller institutions that hold higher concentrations of loans in that sector. Higher rates have also caused the amount of interest that banks must pay up to depositors to rise, causing the value of fixed-rate securities they hold to fall. That pressure has pushed some regional banks to find ways to raise cash, and more banks are expected to execute similar deals to boost their finances, industry executives say, according to the Journal. Federal Reserve Chair Jerome Powell has said there will likely be more failures related to commercial real estate but that there is no risk to the broader financial system, the Journal reported. D.A. Davidson & Co. raised its outlook on First Foundation following the announced capital raise, upgrading the stock from Neutral to Buy and raising the price target from $6.57 to $9. “While near term profitability remains under pressure, we view the raise as a clearing event, allowing the company the capacity to sell loans, reducing concentration levels and earnings pressure, and build its [allowance for credit losses], while maintaining solid capital levels,” analyst Gary Tenner said in a note on Wednesday. “Announced $228M equity investment provides balance sheet flexibility and capital boost.” Retail bank exchange-traded funds also fell by Wednesday’s mid-day trading. SPDR S&P Regional Banking ETF (NYSE:KRE) slipped 1.29%, Direxion Daily Regional Banks Bull 3X Shares ETF (NYSE:DPST) fell 3.89% and iShares U.S. Regional Banks ETF (NYSE:IAT) declined 0.95%. Read Now: Photo: Shutterstock Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Stellantis Q2 US Sales Fall Despite Strategic Shifts", "title_link": "https://markets.businessinsider.com/news/stocks/stellantis-q2-us-sales-fall-despite-strategic-shifts-1033527716", "Description": "Stellantis N.V. (NYSE:STLA) reported a significant drop in its U.S. sales during the second quarter of 2024, continuing a trend of declines in recent periods. The company, which owns Jeep, Ram, Chrysler, Dodge and Fiat, saw a more substantial decline compared with previous periods. STLA last reported a quarterly sales increase in the second quarter of 2023. In the second quarter of 2024, Stellantis reported U.S. sales of 344,993 vehicles, representing a 21% decrease from the 434,648 units sold in the year-ago period. Among STLA's U.S. brands, only the low-volume Fiat and Alfa Romeo showed a year-over-year sales rise in the second quarter. The sales of Jeep, Ram, Chrysler and Dodge decreased 19%, 26%, 19% and 17%, respectively, compared with the same period in 2023. Alfa Romeo sales rose 8% year over year. Fiat sold 316 vehicles compared with 144 sold in the year-ago quarter. The Jeep Wagoneer and Grand Wagoneer, more expensive and profitable models of Stellantis, saw substantial year-over-year sales growth, with an increase of 107% and 24%, respectively. Moreover, retail sales for the Jeep Wrangler, Grand Cherokee and Compass models rose 24%, 12% and 15%, respectively, from the previous quarter of 2024. Stellantis also highlighted its strong performance with plug-in hybrid models. The Jeep Wrangler 4xe, Jeep Grand Cherokee 4xe, Dodge Hornet R/T and Chrysler Pacifica Hybrid remained four of the top five best-selling plug-in hybrids in the United States. Per Matt Thompson, head of U.S. retail sales for Stellantis, the company's efforts in the first half of the year, which includes a multi-energy strategy and pricing adjustments across its brands, have resulted in significant momentum. The second quarter experienced a 4% increase in total U.S. sales and market share compared with the previous quarter. To boost sales, STLA recently launched a national Summer Select Inventory Bonus Cash incentive campaign, offering up to $2,000 cash back on many of its models. The sales team leadership at Stellantis has seen significant changes recently, with many executives leaving various roles in North America. For example, Matt Thompson replaced Jason Stoicevich as senior vice president of U.S. retail sales shortly after Stoicevich's brief tenure. Stellantis' news release did not mention the cyberattack on CDK Global, which impacted about half of U.S. dealers, including those selling Stellantis vehicles. This attack forced some dealers to use paper records. STLA currently carries a Zacks Rank #3 (Hold). Some better-ranked stocks in the auto space are Blue Bird Corporation (NASDAQ:BLBD), Geely Automobile Holdings Limited (OTC:GELYY) and American Axle & Manufacturing Holdings, Inc. (NYSE:AXL), each sporting a Zacks Rank #1 (Strong Buy) at present. The consensus estimate for BLBD's 2024 sales and earnings suggests year-over-year growth of 17.29% and 155.14%, respectively. The EPS estimates for 2024 and 2025 have improved 63 cents and 69 cents, respectively, in the past 60 days. The Zacks Consensus Estimate for GELYY's 2024 sales suggests year-over-year growth of 36.63%. The EPS estimates for 2024 and 2025 have improved 21 cents and 34 cents, respectively, in the past 60 days. The Zacks Consensus Estimate for AXL's 2024 sales and earnings suggests year-over-year growth of 3.05% and 544.44%, respectively. The EPS estimates for 2024 have moved up 5 cents in the past 60 days. The EPS estimates for 2025 have moved up 20 cents in the past 30 days. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "U.S. Stocks Move Mostly Higher In Abbreviated Trading Session", "title_link": "https://markets.businessinsider.com/news/stocks/u-s-stocks-move-mostly-higher-in-abbreviated-trading-session-1033527664", "Description": "(RTTNews) - After moving mostly higher to start the week, stocks saw further upside over the course of the trading session on Wednesday. With the continued upward move, the Nasdaq and the S&P 500 once again reached new record closing highs in an abbreviated trading session. The Nasdaq advanced 159.54 points or 0.9 percent to 18,188.30 and the S&P 500 climbed 28.01 points or 0.5 percent, although the narrower Dow bucked the uptrend and edged down 23.85 points or 0.1 percent to 39,308.00. The strength on Wall Street may partly have reflected optimism about the outlook for interest rates following the release of some weaker than expected economic data. A report released by the Institute for Supply Management showed an unexpected contraction by U.S. service sector activity in the month of June. The ISM said its services PMI slid to 48.8 in June from 53.8 in May, with a reading below 50 indicating contraction. Economists had expected the index to edge down to 52.5. On the inflation front, the prices index dipped to 56.3 in June from 58.1 in June, indicating a modest slowdown in the pace of price growth. The Fed will be glad to see that the ISM Services PMI reported cooler inflation, and a little concerned that the economy seems to be losing momentum, said Bill Adams, Chief Economist for Comerica Bank. But controlling inflation is still the Fed's number one priority. They are unlikely to feel comfortable enough with progress on that front to cut rates at the July decision, he added. Even so, odds of a rate cut at the following decision in September are higher in light of June's weak ISM PMIs and rising jobless claims. The Labor Department released a separate report showing a modest increase by first-time claims for U.S. unemployment benefits in the week ended June 29th. The report said initial jobless claims rose to 238,000, an increase of 4,000 from the previous week's revised level of 234,000. Economists had expected jobless claims to inch up to 235,000 from the 233,000 originally reported for the previous week. Payroll processor ADP also released a report showing private sector employment in the U.S. increased by slightly less than expected in the month of June. ADP said private sector employment climbed by 150,000 jobs in June after rising by an upwardly revised 157,000 jobs in May. Economists had expected private sector employment to increase by 160,000 jobs compared to the addition of 152,000 jobs originally reported for the previous month. However, overall trading activity remained somewhat subdued, as the markets closed earlier than usual and remain closed for the Independence Day holiday on Thursday. Sector News Gold stocks showed a substantial move to the upside, resulting in a 3.6 percent spike by the NYSE Arca Gold Bugs Index. The rally by gold stocks came amid a sharp increase by the price of the precious metal. Significant strength was also visible among semiconductor stocks, as reflected by the 1.9 percent jump by the Philadelphia Semiconductor Index. Steel stocks also turned in a strong performance on the day, driving the NYSE Arca Steel Index up by 1.8 percent. Airline, networking and oil service stocks also saw some strength, while pharmaceutical and healthcare stocks moved to the downside. Other Markets In overseas trading, stock markets across the Asia-Pacific region moved mostly higher during trading on Wednesday. Japan's Nikkei 225 Index surged by 1.3 percent, while Hong Kong's Hang Seng Index jumped by 1.2 percent. The major European markets also moved to the upside on the day. While the U.K.'s FTSE 100 Index climbed by 0.6 percent, the German DAX Index and the French CAC 40 Index both shot up by 1.2 percent. In the bond market, treasuries have shown a notable rebound after moving sharply lower over the two previous sessions. Subsequently, the yield on the benchmark ten-year note, which moves opposite of its price, is down by 8.3 basis points at 4.352 percent. Looking Ahead Following the Independence Day holiday on Thursday, trading on Friday is likely to be driven by reaction to the Labor Department's closely watched monthly jobs report. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Reasons to Retain Revvity Stock in Your Portfolio Now", "title_link": "https://markets.businessinsider.com/news/stocks/reasons-to-retain-revvity-stock-in-your-portfolio-now-1033527722", "Description": "Revvity, Inc. (NYSE:RVTY) is well-poised for growth in the coming quarters, courtesy of its strong product portfolio. The optimism, led by its first-quarter 2024 performance and focus on artificial intelligence, also looks promising. Headwinds resulting from foreign exchange volatility and integration risks are major downsides. This Zacks Rank #3 (Hold) company's shares have lost 6.7% year to date against 3.6% growth of the industry. The S&P 500 has increased 15% during the same time frame. The renowned provider of health science solutions has a market capitalization of $12.71 billion. It projects 8.3% growth for the next five years and expects to witness continued improvements in its business going further. Revvity's earnings surpassed the Zacks Consensus Estimate in three of the trailing four quarters and missed once, delivering an average surprise of 3.67%. Image Source: Zacks Investment Research Let's delve deeper. Focus on AI: We are upbeat about the use of AI by healthcare companies that has been the latest trend. Management at Revvity introduced PKeye Workflow Monitor, a cloud-based platform that allows laboratory personnel to manage and monitor their Revvity instruments and workflows in real time, remotely. Revvity also introduced its Signals Research Suite, a complete cloud-based solution, used by Amazon Web Services. Product Portfolio: We are optimistic about Revvity's portfolio, which delivers a comprehensive suite of scientific informatics and software solutions to aggregate data into actionable insights in an automated and scalable way. During the first quarter, the company's software and informatics division, Revvity Signals Software, demonstrated strong growth, a trend that is likely to continue in the rest of 2024 on the back of new offerings. RVTY introduced three new SaaS-based offerings during the quarter. These include Signals Clinical and Signals Synergy, which should help the company to expand into new markets. Revvity also announced the launch of its next-generation sequencing solution for Newborn Screening during the first quarter. This launch is likely to help the company maintain its market leadership position in Newborn Screening. Moreover, the expansion of GMP reagent capacity is aiding the company to launch several new GMP recombinant proteins, creating potential for additional revenues. Q1 Results: RVTY's diagnostic businesses have continued to remain strong during the quarter. The immunodiagnostics franchise, which is by far the largest category of the Diagnostics segment, grew in the low double-digits. Moreover, a rise in pharma and biotech spending is in the cards, which may boost sales in the second half of 2024. Meanwhile, ongoing cost containment efforts are likely to improve margins going forward. Foreign Exchange Volatility: Increasing exposure to international markets enhances the risk of foreign exchange volatility. The fluctuations in currency exchange rates can adversely impact the company's international sales. Due to the sluggish European economy, future revenues and earnings are likely to be affected if RVTY does not hedge from exposure to such fluctuations. I ntegration Risks: Revvity continues to acquire a large number of companies. While this improves revenue opportunities, it also adds to integration risks. The frequent acquisitions can also negatively impact its balance sheet in the form of a high level of goodwill and intangible assets. Frequent acquisitions are also a distraction for management and may impact organic growth. Revvity has been witnessing a positive estimate revision trend for 2024. Over the past seven days, the Zacks Consensus Estimate for earnings per share has remained stable at $4.65. The Zacks Consensus Estimate for first-quarter 2024 revenues is pegged at $695.7 million, indicating a 1.9% decline from the year-ago reported number. The Zacks Consensus Estimate for EPS is pinned at $1.13, implying a year-over-year decline of 6.6%. Some better-ranked stocks in the broader medical space that have announced quarterly results are DaVita , Ecolab and Universal Health Services . DaVita, carrying a Zacks Rank #2 (Buy) at present, has an estimated long-term growth rate of 13.6%. DVA's earnings surpassed estimates in each of the trailing four quarters, the average surprise being 29.4%. DaVita's shares have risen 32.1% compared with theindustry's 5% growth so far this year. Ecolab, carrying a Zacks Rank of 2 at present, has an estimated long-term growth rate of 13.3%. ECL's earnings surpassed estimates in each of the trailing four quarters, the average surprise being 1.7%. Ecolab's shares have rallied 18.8% against theindustry's 21.9% decline so far this year. Universal Health Services has an Earnings ESP of +2.91% and a Zacks Rank #2 at present. UHS has an earnings growth rate of 30.5% for 2024. UHS' earnings surpassed estimates in each of the trailing four quarters, delivering an average surprise of 8.12%. The company's shares have rallied 21.2% compared to theindustry's 18.5% increase so far this year. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Swiss Market Ends Marginally Higher", "title_link": "https://markets.businessinsider.com/news/stocks/swiss-market-ends-marginally-higher-1033527665", "Description": "(RTTNews) - After a positive start and a subsequent drop to lower levels, the Switzerland market stayed subdued till a little before noon on Wednesday, but climbed higher subsequently, and despite paring gains as the day progressed, ended the session slightly up. The mood was a bit cautious with investors awaiting data on Swiss inflation and unemployment, due on Thursday. The benchmark SMI ended with a small gain of 7.28 points or 0.06% at 12,018.30, after moving between 11,996.00 and 12,067.18. SIG Group climbed 3.55%, Lindt & Spruengli gained 3.04%, Julius Baer, Lonza Group and Kuehne + Nagel ended higher by 1.9 to 2.2%, and Holcim rallied 1.71%. SGS, Geberit, Partners Group, UBS Group, Sandoz Group and ABB gained 1 to 1.5%. Straumann Holding, Swatch Group, Swisscom and Schindler Ps ended moderately higher. Zehnder Group shares gained nearly 4% after announcing its acquisition of Spanish residential ventilation manufacturer Siber for 86 million euros. Swiss Life Holding, Roche Holding, Alcon, Zurich Insurance Group and Swiss Re lost 0.8 to 1.1%. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "S&P 500, Nasdaq 100 Climb To Record Highs As Data Fosters Rate Cut Optimism Ahead Of Fed Minutes; Gold, Bonds Rally: What's Driving Markets Wednesday?", "title_link": "https://markets.businessinsider.com/news/etf/s-p-500-nasdaq-100-climb-to-record-highs-as-data-fosters-rate-cut-optimism-ahead-of-fed-minutes-gold-bonds-rally-what-s-driving-markets-wednesday-1033527636", "Description": "The S&P 500 and Nasdaq 100 indices surged to new all-time highs on Thursday, as investors heightened their expectations for rate cuts following June’s sharply lower-than-expected services sector activity, which experienced its worst contraction since May 2020. Market-implied odds of a Fed rate cut in September rose from 65% to 72%, according to CME Group’s FedWatch tool, with traders pricing in more than 50 basis points of rate cuts by year end, implying two fully priced rate reductions by the Fed. Risk sentiment was particularly strong ahead of the Federal Open Market Committee (FOMC) Minutes, slated to be released at 2:00 p.m. ET. Nvidia Corp. (NASDAQ:NVDA) and the chip making industry, as tracked by the iShares Semiconductor ETF (NYSE:SOXX), rebounded, up 3.7% and 1.9%, respectively. Strong gains also stemmed from gold miners, with the VanEck Gold Miners ETF (NYSE:GDX) up 4.2%, eyeing one of the best-performing sessions year to date, driven by rising metal prices. Expectations of lower interest rates fueled gold prices up by 1.4%, silver up by 3.5%, and copper up by 2.6%. Treasury yields weakened sharply, with both the 10-year and 30-year yields down 7 basis points. The iShares 20+ Year Treasury Bond ETF (NASDAQ:TLT) rose 1.1%, rallying the most since June 13. However, the crypto market faltered, with Bitcoin (CRYPTO: BTC) down 2.7% to $60,450. According toBenzinga Prodata: Read Now: Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "GM To Pay $145.8 Mln Over Excess Emissions From Approx. 5.9 Mln Vehicles : Reuters", "title_link": "https://markets.businessinsider.com/news/stocks/gm-to-pay-145-8-mln-over-excess-emissions-from-approx-5-9-mln-vehicles-reuters-1033527678", "Description": "(RTTNews) - General Motors Company (GM) received a penalty of $145.8 million over excess emissions from around 5.9 million vehicles of the 2012-2018 model full-size pickups and SUVs, and midsize SUVs, according to a report by Reuters. The issue came to light after the Environmental Protection Agency or EPA's investigation found that the automaker's 2012-2018 model vehicles released over 10 percent higher carbon dioxide than the company's initial compliance records. The EPA said the company has agreed to give up around 50 million metric tons in carbon allowance. Meanwhile, the National Highway Traffic Safety Administration stated that the company will pay the penalty as well as cancel over 30.6 million fuel economy credits for the 2008-2010 model years to resolve the issue. The US-based company commented that it has at all times complied with and adhered to all applicable laws and regulations in the certification and in-use testing of the vehicles in question, adding that this is the best course of action to swiftly resolve outstanding issues with the federal government regarding this matter. Currently, General Motors is trading at $46.54, down 0.86 percent on the New York Stock Exchange. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Nancy Pelosi disclosed stock market trades made by her husband. He loaded up on AI plays like Nvidia and sold Tesla.", "title_link": "https://markets.businessinsider.com/news/stocks/nancy-pelosi-stock-market-trades-buys-nvidia-sells-tesla-disclosures-2024-7", "Description": "Representative Nancy Pelosi disclosed stock trades made by her husband last month. Paul Pelosi, who is an investment professional, increased his exposure to the AI boom by buying shares of Nvidia and call options on Broadcom , according to a disclosures filed by Nancy Pelosi on Tuesday. Here are the trades made by Paul Pelosi between June 24 and July 1, according to the disclosure: Trading activity by members of Congress and their spouses has come under fire in recent years, with calls to ban Congress from trading individual stocks due to the sensitive or non-public information they might be privy to. But Pelosi has long swatted down calls for such legislation. In December 2021, Pelosi responded to the idea of a possible stock trading ban with, We are a free-market economy. They should be able to participate in that. And in July 2022, Pelosi denied the idea that her husband had made stock trades based on information she shared with him. Absolutely not, Pelosi said. The tracking of Pelosi's trades, and the trades of other members of Congress, has led to the creation of several ETFs that buy and sell the shares traded by members of Congress. So far, their performance has been impressive. Read next Indices Commodities Currencies Stocks Jump to"},
{"source_name": "BusinessInsider", "title": "Analyst Scoreboard: 5 Ratings For Commerce Bancshares", "title_link": "https://markets.businessinsider.com/news/stocks/analyst-scoreboard-5-ratings-for-commerce-bancshares-1033527470", "Description": "Analysts' ratings for Commerce Bancshares (NASDAQ:CBSH) over the last quarter vary from bullish to bearish, as provided by 5 analysts. Summarizing their recent assessments, the table below illustrates the evolving sentiments in the past 30 days and compares them to the preceding months. Analysts provide deeper insights through their assessments of 12-month price targets, revealing an average target of $59.0, a high estimate of $62.00, and a low estimate of $54.00. This current average has increased by 3.96% from the previous average price target of $56.75. The perception of Commerce Bancshares by financial experts is analyzed through recent analyst actions. The following summary presents key analysts, their recent evaluations, and adjustments to ratings and price targets. To gain a panoramic view of Commerce Bancshares's market performance, explore these analyst evaluations alongside essential financial indicators. Stay informed and make judicious decisions using our Ratings Table. Stay up to date on Commerce Bancshares analyst ratings. Commerce Bancshares Inc. is a $22 billion regional bank that provides a diversified line of financial services, including business and personal banking, wealth management, financial planning, and investments through its affiliated companies. Commerce Bank operates in more than 200 locations in the central United States. Commerce Bancshares also has operating subsidiaries involved in mortgage banking, leasing, credit-related insurance, venture capital, and real estate activities. Market Capitalization Analysis: The company's market capitalization is below the industry average, suggesting that it is relatively smaller compared to peers. This could be due to various factors, including perceived growth potential or operational scale. Revenue Growth: Commerce Bancshares's remarkable performance in 3 months is evident. As of 31 March, 2024, the company achieved an impressive revenue growth rate of 2.23% . This signifies a substantial increase in the company's top-line earnings. In comparison to its industry peers, the company stands out with a growth rate higher than the average among peers in the Financials sector. Net Margin: Commerce Bancshares's financial strength is reflected in its exceptional net margin, which exceeds industry averages. With a remarkable net margin of 28.07%, the company showcases strong profitability and effective cost management. Return on Equity (ROE): Commerce Bancshares's ROE stands out, surpassing industry averages. With an impressive ROE of 3.79% , the company demonstrates effective use of equity capital and strong financial performance. Return on Assets (ROA): The company's ROA is a standout performer, exceeding industry averages. With an impressive ROA of 0.36%, the company showcases effective utilization of assets. Debt Management: Commerce Bancshares's debt-to-equity ratio is below the industry average. With a ratio of , the company relies less on debt financing, maintaining a healthier balance between debt and equity, which can be viewed positively by investors. Experts in banking and financial systems, analysts specialize in reporting for specific stocks or defined sectors. Their comprehensive research involves attending company conference calls and meetings, analyzing financial statements, and engaging with insiders to generate what are known as analyst ratings for stocks. Typically, analysts assess and rate each stock once per quarter. Analysts may supplement their ratings with predictions for metrics like growth estimates, earnings, and revenue, offering investors a more comprehensive outlook. However, investors should be mindful that analysts, like any human, can have subjective perspectives influencing their forecasts. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "The 3 Best Cathie Wood Stocks to Buy in July 2024", "title_link": "https://markets.businessinsider.com/news/stocks/the-3-best-cathie-wood-stocks-to-buy-in-july-2024-1033527753", "Description": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips Co-founder and CEO of Ark Invest , Cathie Wood, has been one of our most prolific growth stock investors. Perhaps the narrative around the best Cathie Wood stocks truly peaked during the pandemic. Her investment firm witnessed a dramatic surge in inflows during the pandemic years, but things have been choppy lately. Nevertheless, with interest rate cuts expected later this year, it’s an ideal time to leverage Wood’s insights into aggressive growth investing. Hence, keeping tabs on Cathie Wood’s top stock could be incredibly rewarding for investors looking to take on more risk. That said, here are three red-hot Cathie Wood stocks to buy, ready to benefit from a revitalized market sentiment. These stocks are poised for an impressive showing to close the year, resulting in substantial upside potential at current prices. Their underlying businesses are expected to continue growing on the back of secular tailwinds. It’s easy to see why Wood is invested in Amazon’s (NASDAQ: AMZN ) illustrious growth story. Last month, ARK Invest’s ARK Next Generation ETF acquired 53,368 shares of AMZN stock for $9.9 million. To be fair, Cathie Wood’s recent pivot towards AMZN stock was long overdue, especially considering how it hasn’t flown under the radar for the past couple of years. The tech giant has been a storied stock over the past decade, with its tentacles spread across multiple sectors, such as advertising, streaming, gaming, and groceries. Moreover, Amazon’s strategic investments in AI have added new layers to its growth trajectory. These include its AI investments, notably its collaboration with Anthropic , and the critical role of its cloud service in powering the AI revolution. Last quarter alone, Amazon Web Services (AWS) generated $25 billion in sales , a 17% increase on a year-over-year (YOY) basis. Overall, its sales jumped to $143.3 billion, marking a 13% increase from the prior-year period while exceeding estimates for the fifth consecutive quarter. JPMorgan analysts are pounding the table over AMZN stock’s prospect, expecting the firm to outpace Walmart (NYSE: WMT ) to become the largest U.S. retailer by the end of 2024. Cathie Wood has been a long supporter of Robinhood (NASDAQ: HOOD ), with her stake in HOOD stock valued at nearly $600 million, a sizeable 4.7% of her portfolio’s total. Over the past year, HOOD stock has been on fire, fueled by the vibrant AI and meme stock trading frenzy and robust crypto market rally. In Q1, the platform’s net sales surged to $618 million, blowing past analyst expectations of $555 million. Moreover, the trading platform’s user base has grown impressively. Monthly active users climbed to 13.7 million from 11.8 million in the prior-year period. Its blowout results have plenty to do with the 232% YOY increase in crypto sales in Q1 to $126 million, as the platform effectively leverages the crypto wave. To further bolster its position, Robinhood recently sealed a $200 million deal to acquire Bitstamp . The top-tier crypto exchange in Europe and Asia diversifies Robinhood’s offerings while positioning it among the leading crypto exchanges. Cathie Wood’s relentless investing approach was on full display last month as she placed bets on PagerDuty (NYSE: PD ) stock. Despite the company’s spotty track record, she accumulated PD stock on every trading day. Consequently, her stake in the firm is valued at a whopping $216 million, representing 1.72% of its portfolios. Perhaps her persistence aligns with Wall Street’s upbeat reaction to PD’s encouraging Q1 results. With the firm comfortably beating its top-and-bottom-line estimates, it announced a massive $100 million share buyback plan. Though sales have lately risen by just single-digit margins, experts forecast a rebound to double-digit revenue gains for the upcoming fiscal year and beyond. Analysts forecast a healthy bump in adjusted profits of 14% next year. That should be followed by a further 24% boost in fiscal 2027. This optimistic financial trajectory positions the enterprise software giant for monumental gains ahead. On the date of publication, Muslim Farooque did not have (either directly or indirectly) any positions in the securities mentioned in this article.The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines . On the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article. Muslim Farooque is a keen investor and an optimist at heart. A life-long gamer and tech enthusiast, he has a particular affinity for analyzing technology stocks. Muslim holds a bachelor’s of science degree in applied accounting from Oxford Brookes University. The post The 3 Best Cathie Wood Stocks to Buy in July 2024 appeared first on InvestorPlace . Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "7 Analysts Assess Texas Capital Bancshares: What You Need To Know", "title_link": "https://markets.businessinsider.com/news/stocks/7-analysts-assess-texas-capital-bancshares-what-you-need-to-know-1033527474", "Description": "Providing a diverse range of perspectives from bullish to bearish, 7 analysts have published ratings on Texas Capital Bancshares (NASDAQ:TCBI) in the last three months. The following table provides a quick overview of their recent ratings, highlighting the changing sentiments over the past 30 days and comparing them to the preceding months. The 12-month price targets assessed by analysts reveal further insights, featuring an average target of $65.29, a high estimate of $74.00, and a low estimate of $61.00. Highlighting a 5.96% decrease, the current average has fallen from the previous average price target of $69.43. A clear picture of Texas Capital Bancshares's perception among financial experts is painted with a thorough analysis of recent analyst actions. The summary below outlines key analysts, their recent evaluations, and adjustments to ratings and price targets. To gain a panoramic view of Texas Capital Bancshares's market performance, explore these analyst evaluations alongside essential financial indicators. Stay informed and make judicious decisions using our Ratings Table. Stay up to date on Texas Capital Bancshares analyst ratings. Texas Capital Bancshares Inc is a secured lender, with the majority of the loans held for investment, excluding mortgage finance loans and other national lines of business. The company's national lines of business provide specialized lending products to businesses throughout the United States.The bank operates in Texas' main metropolitan areas, like Austin, Dallas, Fort Worth, Houston, and San Antonio. Market Capitalization Analysis: The company's market capitalization is above the industry average, indicating that it is relatively larger in size compared to peers. This may suggest a higher level of investor confidence and market recognition. Decline in Revenue: Over the 3 months period, Texas Capital Bancshares faced challenges, resulting in a decline of approximately -6.02% in revenue growth as of 31 March, 2024. This signifies a reduction in the company's top-line earnings. In comparison to its industry peers, the company trails behind with a growth rate lower than the average among peers in the Financials sector. Net Margin: Texas Capital Bancshares's net margin lags behind industry averages, suggesting challenges in maintaining strong profitability. With a net margin of 8.52%, the company may face hurdles in effective cost management. Return on Equity (ROE): Texas Capital Bancshares's ROE falls below industry averages, indicating challenges in efficiently using equity capital. With an ROE of 0.76%, the company may face hurdles in generating optimal returns for shareholders. Return on Assets (ROA): Texas Capital Bancshares's ROA falls below industry averages, indicating challenges in efficiently utilizing assets. With an ROA of 0.08%, the company may face hurdles in generating optimal returns from its assets. Debt Management: Texas Capital Bancshares's debt-to-equity ratio is below the industry average at 0.56 , reflecting a lower dependency on debt financing and a more conservative financial approach. Analysts work in banking and financial systems and typically specialize in reporting for stocks or defined sectors. Analysts may attend company conference calls and meetings, research company financial statements, and communicate with insiders to publish analyst ratings for stocks. Analysts typically rate each stock once per quarter. Some analysts publish their predictions for metrics such as growth estimates, earnings, and revenue to provide additional guidance with their ratings. When using analyst ratings, it is important to keep in mind that stock and sector analysts are also human and are only offering their opinions to investors. If you want to keep track of which analysts are outperforming others, you can view updated analyst ratings along withanalyst success scores in Benzinga Pro. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "3 Blue-Chip Cash Cow Stocks to Buy and Hold Forever", "title_link": "https://markets.businessinsider.com/news/stocks/3-blue-chip-cash-cow-stocks-to-buy-and-hold-forever-1033527752", "Description": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips I believe investors should consider keeping a good chunk of their portfolios invested in blue-chip cash cow stocks. Companies that have robust margins and a long history of positive cash flow are unlikely to disappoint you in the long-run. Even in the worst-case scenario, these businesses have a huge liquidity buffer and a margin buffer to shield you from a correction. These companies have the ability to use their cash to buy back their stock when the market is in correction mode, or initiate dividends. Plus, high-margin businesses have a lot of flexibility. For instance, if a certain business segment underperforms, these companies have the cash needed to significantly boost marketing or offset these declining segments by expanding other parts of their business. All things considered, these are the stocks you buy and forget about and cash out in a few decades when they have compounded several times. Here are three such blue-chip cash cow stocks I think are worth looking into right now. Berkshire Hathaway (NYSE: BRK-A , NYSE: BRK-B ) is one of the best stocks you can buy in the market over the long-run. This company has one of the most flexible business models out there. And importantly, Berkshire generates a boatload of cash during market rallies. Even when the market is not rallying, Berkshire Hathaway can pull out of certain companies and sit on its cash pile until the market starts to recover. Warren Buffett’s portfolio consists of some of the highest-quality companies, and they have historically bounced back quickly from previous downturns. I believe such companies have retained their ability to bounce back even from a worst-case recession. As such, I think it is one of the best blue-chip cash cow stocks you can buy. Berkshire won’t pay you a dividend, but Buffett’s company usually buys back billions of dollars worth of BRK stock each year. It’s a no-brainer long-term holding, in my view. Visa (NYSE: V ) is one of the most stable and consistent companies out there. The company generally benefits from the movement of consumer spending worldwide. Its fortunes are undoubtedly tied to the health of the global economy, and its dominant market position and the secular shift towards cashless transactions provide a long runway for growth. Visa’s management team has highlighted that out of the $40 trillion in global personal consumption expenditure (excluding Russia and China), over $20 trillion is addressable by Visa. With cash and checks still comprising about half of this opportunity, Visa’s tap-to-pay solutions are well-positioned to continue converting these transactions to digital formats. Furthermore, Visa’s industry-leading net margins provide a substantial buffer against economic headwinds. As more commerce shifts online and digital payments adoption rises worldwide, I expect Visa’s profitability to remain robust. Visa is a true cash cow that deserves a permanent place in any blue-chip portfolio. Walmart (NYSE: WMT ) is the world’s largest company by revenue and the most dominant global retailer. The stock has been a shining star in 2024, surging 28% year-to-date while most retailers have stumbled amid weakening consumer demand. Walmart’s Q1 results were even stronger than anticipated, with an impressive 5.7% sales growth and a 12.9% jump in adjusted operating profit . The company is driving growth in both units sold and transaction counts while also gaining market share, including in general merchandise. This tells me Walmart’s momentum is not just inflation-driven, but a result of genuine business strength. Moreover, Walmart is collaborating with suppliers to successfully bring prices down for shoppers. Importantly, expanded rollback discounts are clearly resonating with value-seeking customers. The company’s e-commerce business is also thriving, with strong growth in marketplace sellers and online penetration rising across all markets. With Walmart executing on all fronts operationally while proving resilient in a tough environment, I’m positive WMT stock is one of the blue-chip cash cow stocks to buy and hold forever. On the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. On the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article. Omor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn . The post 3 Blue-Chip Cash Cow Stocks to Buy and Hold Forever appeared first on InvestorPlace . Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Best Performing ETFs by Sector in the Past 30 Days", "title_link": "https://markets.businessinsider.com/news/stocks/best-performing-etfs-by-sector-in-the-past-30-days-1033527718", "Description": "Wall Street was upbeat in June, with the S&P 500, the Dow Jones and the Nasdaq advancing 3.5%, 1.1% and 6%, respectively. The Russell 2000, however, saw a 1.1% dip. The S&P 500 topped the 5,500 level for the first time last week, after hitting the 5,400 mark earlier this month and 5,300 last month, indicating investors' confidence. Technology remained the best-performing sector in June. NVIDIA and Amazon reached $3 trillion and $2 trillion market cap, respectively, in June. NVIDIA (which became the world's most valuable company briefly in the month), Apple (which also attained the height for a while) and Microsoft remained in the race to become the world's most valuable company. In the last FOMC meeting early last month, U.S. policymakers penciled in just one rate cut for this year and indicated four cuts in 2025. Meanwhile, inflation data released throughout the month showed signs of easing. The European Central Bank (ECB), too, cut its key interest rate, marking the first reduction since September 2019. This move took the rate down from its previous record of 4% to 3.75%, which has been maintained since September 2023. Against this backdrop, below we highlight a few winning ETF areas of June. Valkyrie Bitcoin Miners ETF (NASDAQ:WGMI) – Up 22.7% Bitcoin lost about 10% in its price in June (probably due to higher greenback), which in turn, put pressure on crypto stocks. But crypto stocks recorded gains last week as sentiments improved. Notably, the fund WGMI started an uphill ride from Jun 3 and hit a monthly high on Jun 20, after which it started to drop. Shares of companies like Hut 8 Corp (NASDAQ:HUT) jumped 66.9% in June, driving the ETF WGMI despite bitcoin's monthly slump. Simplify Health Care ETF (NYSE:PINK) – Up 8.2% The fund has exposure to companies in biotech, med-tech, gene therapy and other fast-growing healthcare-related industries. Its top holdings section is dominated by some renowned med-tech names. The industry is estimated to record $210.00 billion in 2024, according to Statista. Going forward, a steady annual growth rate (CAGR 2024-2029) of 4.87% is expected for the industry, resulting in a market volume of $266.40 billion by 2029. Meanwhile, the big pharma companies are coming up with new drug data. iShares MSCI India Small-Cap ETF (BATS:SMIN) – Up 7.2% India's potential for growth makes it an attractive choice for investors. Strong private consumption is a plus for the fund. Additionally, an increasing workforce population and a surge in new business establishments are favorable. Prime minister Modi's win in the third term has finally boosted the stock market, though it initially slumped during the announcement of the election results. InfraCap MLP ETF (NYSE:AMZA) – Up 7% The WTI crude ETF United States Oil Fund LP has advanced 4% in June. This has probably boosted MLP ETFs. MLPs catch investors' eyes as these do not pay taxes at the entity level and are thus able to pay out most of their income (more than 90%) in the form of dividends like the REIT firms. The fund AMZA yields 7.30% annually. If this was not enough, the Fed is likely to cut interest rates later this year. Since MLPs depend on a huge debt burden, if interest rates dive, MLPs will not have to pay higher for the huge chunk of borrowed money, which may, in turn, help them to raise/maintain their dividend payout ratio. Roundhill Magnificent Seven ETF (NASDAQ:MAGS) – Up 6.9% The Magnificent Seven — which includes NVIDIA, Microsoft, Apple, Amazon, Alphabet, Meta and Tesla — has contributed to much of the stock market's rally. NVIDIA was up 7.6%, Apple gained 10.7%, Microsoft climbed 4.1%, Amazon added 6.2%, Alphabet inched up 3.4%, Meta jumped 6.3% and Tesla surged 12.3%. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Here's Why You Should Retain Ensign Group Stock Now", "title_link": "https://markets.businessinsider.com/news/stocks/here-s-why-you-should-retain-ensign-group-stock-now-1033527721", "Description": "The Ensign Group, Inc. (NASDAQ:ENSG) is benefiting from improved service revenues, a series of acquisitions and a strong financial position. An optimistic 2024 business outlook also reinforces investors' confidence in the stock. Ensign Group carries a Zacks Rank #3 (Hold) at present. The stock has gained 32.2% in the past year compared with the industry's 36.1% growth. The Medical sector and the S&P 500 composite index have increased 6% and 23.7%, respectively, in the same time frame. Image Source: Zacks Investment Research The Zacks Consensus Estimate for Ensign Group's 2024 earnings is pegged at $4.95 per share, indicating an improvement of 12.6% from the year-earlier reading, while the same for revenues stands at $4.1 billion, implying an 11% increase from the prior-year actual. The consensus mark for 2025 earnings is pegged at $5.46 per share, indicating 10.2% growth from the 2024 estimate. The same for revenues is $4.5 billion, which indicates a rise of 9.4% from the 2024 estimate. ENSG's earnings outpaced estimates in two of the trailing four quarters and matched the mark twice, the average surprise being 0.95%. Ensign Group's efficiency in utilizing shareholders' funds can be substantiated by its return on equity of 19.1% as of Mar 31, 2024, against the industry's negative return of 13.8%. ENSG anticipates revenues within the range of $4.13-$4.17 billion in 2024, the midpoint of which indicates 11.3% growth from the 2023 reported figure. Adjusted earnings per share are estimated to be between $5.29 and $5.47 this year. The midpoint of the outlook indicates 13% growth from the 2023 reported figure. Ensign Group's revenue growth is primarily driven by increasing service revenues from its enhanced healthcare services provided at skilled nursing, rehabilitation and senior living facilities. An aging U.S. population is expected to sustain the strong demand for ENSG's senior living services while the significant need for effective rehabilitation services, which help individuals return to daily activities, is anticipated to boost its Skilled Services segment's revenues. The strong performance of ENSG's Skilled Services and Standard Bearer segments also contributes to revenue growth. Through the Standard Bearer unit, the company earns rental revenues from leasing post-acute care properties, which it has purchased, to healthcare operators under triple-net lease arrangements. These agreements are advantageous for ENSG as the company not only receives rental income but also passes the property-related costs to the tenants. Ensign Group's inorganic growth strategy is impressive. The company is actively acquiring facilities in various U.S. regions, which allows it to collaborate with local caregiver teams. This approach provides ENSG with a deep understanding of regional needs and enables it to deliver high-quality healthcare services to underserved communities. In June 2024, Ensign Group purchased the real estate and operations of an Arizona-based 32-bed skilled nursing facility, Wellsprings of Gilbert. Concurrently, it also acquired the operations of a skilled nursing facility in Colorado, The Springs at St. Andrews Village. Such proactive growth initiatives expand Ensign Group's healthcare portfolio and national presence. The company currently operates 312 healthcare facilities across several U.S. states and owns 120 real estate assets. Acquisitions remain a top priority for management when deploying capital. To support such continuous business investments, maintaining a solid financial position is essential. Ensign Group boasts strong cash reserves and sufficient cash-generating capabilities. These financial strengths also enable ENSG to reward shareholders through share buybacks and dividend payments. The company has resorted to dividend hikes for straight 21 years. Some better-ranked stocks in the Medical space are Tenet Healthcare Corporation (NYSE:THC), HCA Healthcare, Inc. (NYSE:HCA) and Stryker Corporation (NYSE:SYK). While Tenet Healthcare sports a Zacks Rank #1 (Strong Buy), HCA Healthcare and Stryker carry a Zacks Rank #2 (Buy) each at present. Tenet Healthcare's earnings surpassed estimates in each of the last four quarters, the average surprise being 56.50%. The Zacks Consensus Estimate for THC's 2024 earnings indicates a 22.5% rise from the prior-year tally. The consensus mark for THC's earnings has moved 35.7% north in the past 60 days. The bottom line of HCA Healthcare outpaced estimates in three of the trailing four quarters and missed the mark once, the average surprise being 5.64%. The Zacks Consensus Estimate for HCA's 2024 earnings indicates a 10% rise while the same for revenues implies an improvement of 7.2% from the respective prior-year figures. The consensus mark for HCA's earnings has moved 0.5% north in the past 60 days. Stryker's earnings outpaced estimates in each of the trailing four quarters, the average surprise being 4.93%. The Zacks Consensus Estimate for SYK's 2024 earnings indicates a 12.7% rise, while the same for revenues implies an improvement of 8.9% from the respective prior-year tallies. The consensus mark for SYK's earnings has moved up 0.8% in the past 60 days. Shares of Tenet Healthcare, HCA Healthcare and Stryker have gained 64.8%, 6.8% and 12%, respectively, in the past year. To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Intuit Shares In Focus As Analyst Puts New Subscription Model, GenAI, Tax Laws Into Perspective", "title_link": "https://markets.businessinsider.com/news/stocks/intuit-shares-in-focus-as-analyst-puts-new-subscription-model-genai-tax-laws-into-perspective-1033527476", "Description": "Intuit Inc (NASDAQ:INTU) successfully transitioned to a subscription-based model while also showing additional upside from generative artificial intelligence (AI). The Intuit Analyst: RBC Capital Markets’ Rishi Jaluria initiated coverage of Intuit with an Outperform rating and price target of $760. The Intuit Thesis: Around 80% of Intuit’s revenue is generated by recurring subscriptions. The company has achieved greater platform expansion, Jaluria said in the initiation note. Check out other analyst stock ratings. Platform revenues now represent 77% of Intuit's total revenues, versus 53% five years ago and the mix-shift in favor of subscription and cloud would drive better unique economics, he added. Intuit enjoys a market leadership position in tax and accounting software, which should be a tailwind as tax codes and regulations become increasingly complex, the analyst wrote. Tax preparation and SMB accounting are very services-heavy industries,” Jaluria says. GenAI gives Intuit's customers the ability to automate and generate cost savings. He added that the company's non-GAAP and GAAP operating margins could reach around 40% and 30%, respectively, in fiscal 2026. INTU Price Action: Shares of Intuit had risen by 0.66% to $660.52 at the time of publication on Wednesday. Read Next: Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Analyst Expectations For Carlyle Group's Future", "title_link": "https://markets.businessinsider.com/news/stocks/analyst-expectations-for-carlyle-group-s-future-1033527475", "Description": "Providing a diverse range of perspectives from bullish to bearish, 8 analysts have published ratings on Carlyle Group (NASDAQ:CG) in the last three months. The table below provides a snapshot of their recent ratings, showcasing how sentiments have evolved over the past 30 days and comparing them to the preceding months. Providing deeper insights, analysts have established 12-month price targets, indicating an average target of $50.75, along with a high estimate of $68.00 and a low estimate of $44.00. A 6.23% drop is evident in the current average compared to the previous average price target of $54.12. The perception of Carlyle Group by financial experts is analyzed through recent analyst actions. The following summary presents key analysts, their recent evaluations, and adjustments to ratings and price targets. Analyzing these analyst evaluations alongside relevant financial metrics can provide a comprehensive view of Carlyle Group's market position. Stay informed and make data-driven decisions with the assistance of our Ratings Table. Stay up to date on Carlyle Group analyst ratings. The Carlyle Group is one of the world's largest alternative-asset managers, with $426.0 billion in total AUM, including $307.4 billion in fee-earning AUM, at the end of December 2023. The company has three core business segments: private equity, which includes private equity, real estate, infrastructure, and natural resources funds (accounting for 35% of fee-earning AUM and 63% of base management fees during 2023), global credit (50% and 25%) and investment solutions (15% and 12%). The firm primarily serves institutional investors and high-net-worth individuals. Carlyle operates through 29 offices across five continents, serving more than 2,900 active carry fund investors from 88 countries. Market Capitalization Analysis: Falling below industry benchmarks, the company's market capitalization reflects a reduced size compared to peers. This positioning may be influenced by factors such as growth expectations or operational capacity. Negative Revenue Trend: Examining Carlyle Group's financials over 3 months reveals challenges. As of 31 March, 2024, the company experienced a decline of approximately -5.48% in revenue growth, reflecting a decrease in top-line earnings. In comparison to its industry peers, the company trails behind with a growth rate lower than the average among peers in the Financials sector. Net Margin: Carlyle Group's net margin falls below industry averages, indicating challenges in achieving strong profitability. With a net margin of 10.96%, the company may face hurdles in effective cost management. Return on Equity (ROE): Carlyle Group's ROE is below industry averages, indicating potential challenges in efficiently utilizing equity capital. With an ROE of 1.28%, the company may face hurdles in achieving optimal financial returns. Return on Assets (ROA): The company's ROA is below industry benchmarks, signaling potential difficulties in efficiently utilizing assets. With an ROA of 0.31%, the company may need to address challenges in generating satisfactory returns from its assets. Debt Management: Carlyle Group's debt-to-equity ratio stands notably higher than the industry average, reaching 1.83 . This indicates a heavier reliance on borrowed funds, raising concerns about financial leverage. Analysts are specialists within banking and financial systems that typically report for specific stocks or within defined sectors. These people research company financial statements, sit in conference calls and meetings, and speak with relevant insiders to determine what are known as analyst ratings for stocks. Typically, analysts will rate each stock once a quarter. Some analysts also offer predictions for helpful metrics such as earnings, revenue, and growth estimates to provide further guidance as to what to do with certain tickers. It is important to keep in mind that while stock and sector analysts are specialists, they are also human and can only forecast their beliefs to traders. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Cathie Wood Is Loading Up on Archer Aviation (ACHR) Stock", "title_link": "https://markets.businessinsider.com/news/stocks/cathie-wood-is-loading-up-on-archer-aviation-achr-stock-1033527689", "Description": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips One of Wall Street’s most prominent fund managers isn’t too concerned with Tesla (NASDAQ: TSLA ) these days. In fact, Cathie Wood is turning her attention to a much smaller company in which she clearly sees significant potential. She recently trimmed her Tesla position and loaded up on Archer Aviation (NYSE: ACHR ) stock, a startup making big moves in the electric vertical take-off and landing (eVTOL) space. This comes after ACHR stock received a boost on news of an important new investment. But now Wood’s buy seems to be helping boost shares even more as the company’s winning streak continues into today. Does this mean that Archer Aviation is a stock that investors should be watching as it continues its ascent into the green? Let’s take a closer look at this news and assess what its growth prospects look like. It’s been a good week for Archer so far. Yesterday, brought the news that Big Three automaker Stellantis (NYSE: STLA ) is making another investment following the company’s successful test flight milestone last month. This $55 million cash influx helped boost ACHR stock, and so far, this winning streak hasn’t slowed down. As of this writing, shares are up 13% as the markets closed early, and the stock is quickly advancing out of penny stock territory. Now Archer has a powerful new backer. Wood’s Ark Invest purchased 406,912 shares of ACHR stock, adding up to an investment of roughly $1.51 million based upon the previous $3.72 closing price. Now, shares are trading at $4.28 and look primed to pass the $5 mark soon. But Archer isn’t the fund’s only investment in the aviation space. Wood also recently purchased 3,788 shares of Blade Air Mobility (NASDAQ: BLDE ), an air transportation company that has been making noticeable progress lately. The message is clear: she is betting big on the future of flying cars. Other experts are also bullish on the fast-growing sector. InvestorPlace senior investment analyst Luke Lango discussed it last year, highlighting the growth potential that he sees for companies in the space: “The way the industry is going to be set up is you’re going to create these vertiports in different areas,” he noted. “So in the residential neighborhoods and downtowns, near airports, near beaches, near popular tourist destinations, these vertiports that are essentially like landing pads for these eVTOL aircraft. And you’re going to hop in them, you’re going to drive to the vertiport with the parking lot, you’re going to park, you’re going to get out, you’re going to go into your eVTOL. It’s going to fly you to whatever vertiport you want to get to that’s going to be close to your final destination.” If Lango’s prediction proves correct, Archer will be in an excellent position to help usher in a new era of transportation. Through these recent investments, Wood has made it clear that she also sees high growth ahead for companies in this space, more so than she sees for Tesla. At its current price, ACHR stock still provides a tempting opportunity for investors looking to cash in on the flying car industry before it goes mainstream and everyone begins taking it seriously. Wood has a reputation for successfully identifying beaten-down stocks, often in the tech space, and buying up shares before they rise again. She’s been correct before, and if she is this time, Archer is on the verge of reaching new heights. On the date of publication, Samuel O’Brient did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to theInvestorPlace.com Publishing Guidelines . On the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article. Samuel O’Brient is a Reporter for InvestorPlace, where his work focuses primarily on financial markets, global economic trends, and public policy. O’Brient writes a weekly column on recent political news that investors should be following. The post Cathie Wood Is Loading Up on Archer Aviation (ACHR) Stock appeared first on InvestorPlace . Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Nasdaq, S&P 500 Reach Record Highs Following Slew Of Economic Data", "title_link": "https://markets.businessinsider.com/news/stocks/nasdaq-s-p-500-reach-record-highs-following-slew-of-economic-data-1033527322", "Description": "(RTTNews) - With traders reacting to a slew of U.S. economic data ahead of an early close on Wall Street, stocks have moved mostly higher during trading on Wednesday. The Nasdaq and the S&P 500 are adding to the gains posted in the two previous sessions, reaching new record intraday highs. Currently, the Nasdaq is up 90.34 points or 0.5 percent at 18,119.11 and the S&P 500 is up 13.90 points or 0.3 percent at 5,522.91. The narrower Dow, on the other hand, has bucked the uptrend and dipped by 61.56 points or 0.2 percent at 39,270.29. The strength on Wall Street may partly reflect optimism about the outlook for interest rates following the release of some weaker than expected economic data. A report released by the Institute for Supply Management showed an unexpected contraction by U.S. service sector activity in the month of June. The ISM said its services PMI slid to 48.8 in June from 53.8 in May, with a reading below 50 indicating contraction. Economists had expected the index to edge down to 52.5. On the inflation front, the prices index dipped to 56.3 in June from 58.1 in June, indicating a modest slowdown in the pace of price growth. The Fed will be glad to see that the ISM Services PMI reported cooler inflation, and a little concerned that the economy seems to be losing momentum, said Bill Adams, Chief Economist for Comerica Bank. But controlling inflation is still the Fed's number one priority. They are unlikely to feel comfortable enough with progress on that front to cut rates at the July decision, he added. Even so, odds of a rate cut at the following decision in September are higher in light of June's weak ISM PMIs and rising jobless claims. The Labor Department released a separate report showing a modest increase by first-time claims for U.S. unemployment benefits in the week ended June 29th. The report said initial jobless claims rose to 238,000, an increase of 4,000 from the previous week's revised level of 234,000. Economists had expected jobless claims to inch up to 235,000 from the 233,000 originally reported for the previous week. Payroll processor ADP also released a report showing private sector employment in the U.S. increased by slightly less than expected in the month of June. ADP said private sector employment climbed by 150,000 jobs in June after rising by an upwardly revised 157,000 jobs in May. Economists had expected private sector employment to increase by 160,000 jobs compared to the addition of 152,000 jobs originally reported for the previous month. However, overall trading activity remains somewhat subdued, as the markets are set to close earlier than usual today and remain closed for the Independence Day holiday on Thursday. Sector News Gold stocks have shown a substantial move to the upside on the day, resulting in a 4.1 percent spike by the NYSE Arca Gold Bugs Index. The rally by gold stocks comes amid a sharp increase by the price of the precious metal, with gold for August delivery surging $38.90 to $2,371.80 an ounce. Considerable strength is also visible among steel stocks, as reflected by the 1.7 percent gain being posted by the NYSE Arca Steel Index. Semiconductor and airline stocks are also seeing notable strength, while pharmaceutical stocks have moved to the downside. Other Markets In overseas trading, stock markets across the Asia-Pacific region moved mostly higher during trading on Wednesday. Japan's Nikkei 225 Index surged by 1.3 percent, while Hong Kong's Hang Seng Index jumped by 1.2 percent. The major European markets have also moved to the upside on the day. While the French CAC 40 Index is up by 1.2 percent, the German DAX Index is up by 1.1 percent and the U.K.'s FTSE 100 Index is up by 0.6 percent. In the bond market, treasuries have shown a notable rebound after moving sharply lower over the two previous sessions. Subsequently, the yield on the benchmark ten-year note, which moves opposite of its price, is down by 9.1 basis points at 4.344 percent. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Treasury Department Reveals Details Of Long-Term Securities Auctions", "title_link": "https://markets.businessinsider.com/news/interestrates/treasury-department-reveals-details-of-long-term-securities-auctions-1033527368", "Description": "(RTTNews) - The Treasury Department on Wednesday announced the details of this month's auctions of three-year and ten-year notes and thirty-year bonds. The Treasury revealed plans to sell $58 billion worth of three-year notes, $39 billion worth of ten-year notes and $22 billion worth of thirty-year bonds. The results of the three-year note auction will be announced next Tuesday, the results of the ten-year note auction will be announced next Wednesday and the results of the thirty-year bond auction will be announced next Thursday. Last month, the Treasury also sold $58 billion worth of three-year notes, $39 billion worth of ten-year notes and $22 billion worth of thirty-year bonds. The three-year note auction attracted below average demand, while the ten-year note auction and the thirty-year bond auction attracted above average demand. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "U.S. Crude Oil Inventories Plunge Much More Than Expected", "title_link": "https://markets.businessinsider.com/news/commodities/u-s-crude-oil-inventories-plunge-much-more-than-expected-1033527352", "Description": "(RTTNews) - The Energy Information Administration released a report on Wednesday showing a much steeper than expected drop in U.S. crude oil inventories in the week ended June 28th. The report said crude oil inventories plunged by 12.2 million barrels last week after climbing by 3.6 million barrels in the previous week. Economists had expected crude oil inventories to edge down by 0.2 million barrels. At 448.5 million barrels, U.S. crude oil inventories are about 4 percent below the five-year average for this time of year, the EIA said. The EIA said gasoline inventories also decreased by 2.2 million barrels last week and are 1 percent below the five-year average for this time of year. Distillate fuel inventories, which include heating oil and diesel, also fell by 1.5 million barrels last week and are about 10 percent below the five-year average for this time of year. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Ford Q2 Sales Up 1%", "title_link": "https://markets.businessinsider.com/news/stocks/ford-q2-sales-up-1-1033527351", "Description": "(RTTNews) - Ford (F) sales rose nearly 1% during the second quarter over the year-earlier period, led by about 5% increase in truck sales and 27% growth in cars. Ford truck sales, which include pickups and vans, totaled 308,920 vehicles during the three-month period, an increase of 4.5% from 295,602 vehicles last year. This represents Ford's best second-quarter truck sales performance since 2019. Sales of SUVs dropped 5.3% to 213,393 units from 225,299 units last year, while cars segment increased 27.7% to 13,737 from 10,761 units. Sales of Ford electric vehicles totaled 23,957 during the second quarter, up 61%. The automaker said that Mustang Mach-E and F-150 Lightning are drawing customers from other brands, with 62 percent of F-150 Lightning and 54 percent of Mustang Mach-E sales are new to Ford. Meanwhile, sales of hybrid vehicles totaled 53,822, an increase of 56% and a new quarterly sales record for Ford since it began offering hybrid models more than 20 years ago, it said. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Sertan Ayçiçek Named New Group CEO of IKAR Holdings", "title_link": "https://markets.businessinsider.com/news/currencies/sertan-ay%C3%A7i%C3%A7ek-named-new-group-ceo-of-ikar-holdings-1033527754", "Description": "London, UK, July 3rd, 2024, FinanceWire The globally renowned British company, IKAR Holdings, has appointed its group president, Sertan Ayçiçek , as the new CEO of the entire group. IKAR Holdings, a British conglomerate recently awarded as the “Best International Holding Company,” is active across various sectors including aviation, technology, energy, construction, education, health, sports, real estate, and hospitality. The group boasts a diverse portfolio of more than 40 companies, demonstrating its expansive reach and influence across industries. Sertan Ayçiçek, who has been serving as the group president, brings a wealth of experience and a proven track record of success to his new role as CEO. His visionary leadership is expected to drive IKAR Holdings to new heights, leveraging its existing strengths and exploring new opportunities for growth and innovation. Former Group CEO Mario Diel will remain at the top of the organization as Chairman and founder of the group. About IKAR Holdings IKAR Holdings is a multifaceted group company based in London, comprising over 40 entities operating across 14 diverse sectors, including energy, aviation, construction, tourism, technology, education, and healthcare. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "June Jobs Report Preview: Cooling Labor Market Trends May Further Bolster Rate Cut Hopes", "title_link": "https://markets.businessinsider.com/news/etf/june-jobs-report-preview-cooling-labor-market-trends-may-further-bolster-rate-cut-hopes-1033527477", "Description": "The U.S. labor market doesn’t appear as tight and hot as a couple of months ago, with the June’s Employment Situation report likely to show an overall cooling trend from a very strong performance in May. Slated for release Friday at 8:30 a.m. ET , the official jobs report from the Bureau of Labor Statistics is expected to reveal a decline in nonfarm payroll growth and a slowdown in earnings momentum. On Tuesday, Fed Chair Jerome Powell suggested the labor market is “cooling off appropriately,” and the Fed will monitor these developments, ready to act if conditions warrant. Recent economic data have been mixed, suggesting potential surprises in the June jobs report compared to economists’ expectations. The ADP’s National Employment Report, which uses payroll data from Automatic Data Processing Inc. (NYSE:ADP) and focuses on private employment, revealed 150,000 job additions in June, below May’s 157,000 and the forecasted 160,000. Pay growth slowed, with job stayers reporting a 4.9% year-on-year increase. Nela Richardson , chief economist at ADP, stated that job growth was solid but “not broad-based,” noting that June’s numbers would have been disappointing without a rebound in leisure and hospitality hiring. Read also: Private Employers Add 150,000 Jobs In June, Less Than Expected: Job Growth ‘Solid, But Not Broad-Based’ Bill Adams , chief economist for Comerica Bank , highlighted that private job growth was cool in June according to ADP and the government jobs report is also expected to show the least pay growth since 2021. Comerica forecasts nonfarm payroll employment to increase by 220,000 in June, with the unemployment rate edging up to 4.1% from 4.0%. Adams also noted the ADP data don’t capture the significant rise in self-employment due to gig work and entrepreneurship, which are growing faster than in the pre-pandemic period. Overall, the ADP and jobless claims reports reinforce the impression that the labor market has cooled and is likely to cool further in the second half of 2024. The most conflicting indications ahead of Friday’s jobs report came from services sector surveys by S&P Global and the Institute for Supply Management (ISM). S&P Global’s Services Purchasing Managers’ Index (PMI) for June showed the strongest expansion for U.S. services activity since April 2022, extending the growth streak to 17 consecutive months. In contrast, the ISM Services PMI reported the worst contraction in over four years last month. Employment conditions also sharply differed in the two surveys. S&P Global’s Services PMI indicated employment returned to growth after two months of contraction, while the ISM reported a faster pace of contraction in the services labor market. U.S. service sector companies reported an encouragingly solid end to the second quarter, with output rising at the fastest rate in over two years. Both new order inflows and hiring have accelerated, the latter buoyed by firms taking on more workers in response to rising backlogs of work,” Chris Williamson , chief business economist at S&P Global Market Intelligence , said. Steve Miller , chair of the ISM Services Business Survey Committee , commented, The decrease in the composite index in June is a result of notably lower business activity, a contraction in new orders for the second time since May 2020, and continued contraction in employment.” On Thursday, market reactions highlighted the significance investors placed on the ISM Services PMI. Treasury yields plummeted by 8 to 9 basis points on the long end as traders increased bets on Fed rate cuts. The probability of a rate cut in September climbed from 65% to 73% following the release, with 52 basis points of cuts already anticipated by the end of the year. Bonds rallied, with the iShares 20+ Year Treasury Bond ETF (NASDAQ:TLT) soaring 1.4%, while the U.S. dollar weakened substantially, down 0.5%. Lower yields and the weaker greenback aided gold prices, with the precious metal, as tracked by the SPDR Gold Trust (NYSE:GLD), up 1.4%, eyeing its best-performing session since mid-May. Now Read: Photo: Shutterstock Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "U.S. Factory Orders Unexpectedly Decrease 0.5% In May", "title_link": "https://markets.businessinsider.com/news/interestrates/u-s-factory-orders-unexpectedly-decrease-0-5-in-may-1033527254", "Description": "(RTTNews) - The Commerce Department released a report on Wednesday showing an unexpected decrease by new orders for U.S. manufacturing goods in the month of May. The report said factory orders fell by 0.5 percent in May after rising by a downwardly revised 0.4 percent in April. Economists had expected factory orders to inch up by 0.2 percent compared to the 0.7 percent increase originally reported for the previous month. The unexpected decrease by factory orders reflected a sharp pullback by orders for non-durable goods, which tumbled by 1.0 percent in May after climbing by 0.5 percent in April. Meanwhile, the Commerce Department said durable goods orders crept up by 0.1 percent in May after rising by 0.2 percent in April. The report also said shipments of manufactured goods declined by 0.7 percent in May following a 0.8 percent increase in April. On the other hand, the Commerce Department said inventories of manufactured goods rose by 0.2 percent in May after inching up by 0.1 percent in April. With inventories increasing and shipments falling, the inventories-to-shipments ratio ticked up to 1.47 in May from 1.46 in April. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "What 4 Analyst Ratings Have To Say About Anglogold Ashanti", "title_link": "https://markets.businessinsider.com/news/stocks/what-4-analyst-ratings-have-to-say-about-anglogold-ashanti-1033527202", "Description": "Across the recent three months, 4 analysts have shared their insights on Anglogold Ashanti (NYSE:AU), expressing a variety of opinions spanning from bullish to bearish. The table below provides a snapshot of their recent ratings, showcasing how sentiments have evolved over the past 30 days and comparing them to the preceding months. In the assessment of 12-month price targets, analysts unveil insights for Anglogold Ashanti, presenting an average target of $30.5, a high estimate of $33.00, and a low estimate of $26.00. This upward trend is apparent, with the current average reflecting a 11.93% increase from the previous average price target of $27.25. In examining recent analyst actions, we gain insights into how financial experts perceive Anglogold Ashanti. The following summary outlines key analysts, their recent evaluations, and adjustments to ratings and price targets. To gain a panoramic view of Anglogold Ashanti's market performance, explore these analyst evaluations alongside essential financial indicators. Stay informed and make judicious decisions using our Ratings Table. Stay up to date on Anglogold Ashanti analyst ratings. Anglogold Ashanti PLC is one of the gold miners. The company also produces silver and sulphuric acid as by-products. Its operating divisions are Africa, Australia, and the Americas. The firm generates a majority of its revenue from the Africa region which includes its operations of the Kibali, Iduapriem, Obuasi, Siguiri, and Geita mines. Market Capitalization Analysis: The company's market capitalization surpasses industry averages, showcasing a dominant size relative to peers and suggesting a strong market position. Positive Revenue Trend: Examining Anglogold Ashanti's financials over 3 months reveals a positive narrative. The company achieved a noteworthy revenue growth rate of 4.99% as of 30 June, 2023, showcasing a substantial increase in top-line earnings. As compared to competitors, the company encountered difficulties, with a growth rate lower than the average among peers in the Materials sector. Net Margin: Anglogold Ashanti's net margin is below industry averages, indicating potential challenges in maintaining strong profitability. With a net margin of -9.07%, the company may face hurdles in effective cost management. Return on Equity (ROE): The company's ROE is below industry benchmarks, signaling potential difficulties in efficiently using equity capital. With an ROE of -2.58%, the company may need to address challenges in generating satisfactory returns for shareholders. Return on Assets (ROA): Anglogold Ashanti's ROA lags behind industry averages, suggesting challenges in maximizing returns from its assets. With an ROA of -1.32%, the company may face hurdles in achieving optimal financial performance. Debt Management: The company faces challenges in debt management with a debt-to-equity ratio higher than the industry average. With a ratio of 0.52 , caution is advised due to increased financial risk. Ratings come from analysts, or specialists within banking and financial systems that report for specific stocks or defined sectors (typically once per quarter for each stock). Analysts usually derive their information from company conference calls and meetings, financial statements, and conversations with important insiders to reach their decisions. Some analysts also offer predictions for helpful metrics such as earnings, revenue, and growth estimates to provide further guidance as to what to do with certain tickers. It is important to keep in mind that while stock and sector analysts are specialists, they are also human and can only forecast their beliefs to traders. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Deep Dive Into Lovesac Stock: Analyst Perspectives (10 Ratings)", "title_link": "https://markets.businessinsider.com/news/stocks/deep-dive-into-lovesac-stock-analyst-perspectives-10-ratings-1033527201", "Description": "Lovesac (NASDAQ:LOVE) underwent analysis by 10 analysts in the last quarter, revealing a spectrum of viewpoints from bullish to bearish. The table below summarizes their recent ratings, showcasing the evolving sentiments within the past 30 days and comparing them to the preceding months. Analysts have recently evaluated Lovesac and provided 12-month price targets. The average target is $32.9, accompanied by a high estimate of $36.00 and a low estimate of $30.00. Observing a downward trend, the current average is 8.61% lower than the prior average price target of $36.00. A clear picture of Lovesac's perception among financial experts is painted with a thorough analysis of recent analyst actions. The summary below outlines key analysts, their recent evaluations, and adjustments to ratings and price targets. To gain a panoramic view of Lovesac's market performance, explore these analyst evaluations alongside essential financial indicators. Stay informed and make judicious decisions using our Ratings Table. Stay up to date on Lovesac analyst ratings. If you are interested in following small-cap stock news and performance you can start by tracking it here. The Lovesac Co designs, manufactures and sells alternative furniture which is comprised of modular couches called sactionals and premium foam beanbag chairs called sacs. It also offers other accessories such as sactional-specific drink holders, Footsac blankets, decorative pillows, fitted seat tables, and ottomans. Its products are sold across the United States through its website or company-owned retail stores which are used in homes and offices. The majority of the firm's revenue is derived from the sale of Sactionals. Market Capitalization: With restricted market capitalization, the company is positioned below industry averages. This reflects a smaller scale relative to peers. Negative Revenue Trend: Examining Lovesac's financials over 3 months reveals challenges. As of 30 April, 2024, the company experienced a decline of approximately -6.06% in revenue growth, reflecting a decrease in top-line earnings. In comparison to its industry peers, the company trails behind with a growth rate lower than the average among peers in the Consumer Discretionary sector. Net Margin: Lovesac's net margin lags behind industry averages, suggesting challenges in maintaining strong profitability. With a net margin of -9.77%, the company may face hurdles in effective cost management. Return on Equity (ROE): The company's ROE is below industry benchmarks, signaling potential difficulties in efficiently using equity capital. With an ROE of -6.13%, the company may need to address challenges in generating satisfactory returns for shareholders. Return on Assets (ROA): Lovesac's ROA falls below industry averages, indicating challenges in efficiently utilizing assets. With an ROA of -2.7%, the company may face hurdles in generating optimal returns from its assets. Debt Management: With a below-average debt-to-equity ratio of 0.9 , Lovesac adopts a prudent financial strategy, indicating a balanced approach to debt management. Ratings come from analysts, or specialists within banking and financial systems that report for specific stocks or defined sectors (typically once per quarter for each stock). Analysts usually derive their information from company conference calls and meetings, financial statements, and conversations with important insiders to reach their decisions. Some analysts will also offer forecasts for metrics like growth estimates, earnings, and revenue to provide further guidance on stocks. Investors who use analyst ratings should note that this specialized advice comes from humans and may be subject to error. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Tesla Stock Soars On Q2 Delivery Beat: Chart Signals Strong Bullish Momentum", "title_link": "https://markets.businessinsider.com/news/stocks/tesla-stock-soars-on-q2-delivery-beat-chart-signals-strong-bullish-momentum-1033527199", "Description": "Shares of Tesla Inc (NASDAQ:TSLA) rose 10.20% on Tuesday, marking the best intraday session since late April. The much-needed boost comes as the stock is down 17.35% over the past year and 6.93% year-to-date. Tesla’s impressive Q2 performance, reporting 443,956 deliveries, significantly exceeded the expected 439,000 vehicles. This surprise upside fueled a rally, propelling shares toward their 2024 high. The majority of sales came from the affordable Models 3 and Y, with only 21,551 units from the pricier Models X, S and the new Cybertruck. Wedbush Securities analyst Dan Ives hailed the quarter as a “huge comeback” for Tesla and CEO Elon Musk . Despite negative sentiment due to choppy EV demand and concerning registration data from Europe and China, Tesla defied expectations. Ives emphasized Tesla’s positioning as an AI and robotics innovator rather than just a car manufacturer. Read Also: Tesla Price Target Raised To $300 By Wedbush Analyst Dan Ives Amid $1 Trillion Tech Potential: ‘The Most Undervalued AI Name’ Tesla’s recent price action is generating strong bullish signals across multiple technical indicators: Chart created using Benzinga Pro Chart created using Benzinga Pro Tesla's Q2 delivery beat has rekindled investor confidence, driving the stock higher amid previous market skepticism. With technical indicators pointing to bullish momentum, Tesla’s stock appears well-positioned for further gains. However, investors should keep an eye on the high RSI, which could signal overbought conditions. TSLA Price Check: Shares of Tesla were up 5.02% to $243.40 at last check Wednesday. Read Next: Image created using artificial intelligence via Midjourney. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Forecasting The Future: 5 Analyst Projections For MSC Industrial Direct Co", "title_link": "https://markets.businessinsider.com/news/stocks/forecasting-the-future-5-analyst-projections-for-msc-industrial-direct-co-1033527200", "Description": "During the last three months, 5 analysts shared their evaluations of MSC Industrial Direct Co (NYSE:MSM), revealing diverse outlooks from bullish to bearish. The following table encapsulates their recent ratings, offering a glimpse into the evolving sentiments over the past 30 days and comparing them to the preceding months. Analysts' evaluations of 12-month price targets offer additional insights, showcasing an average target of $89.8, with a high estimate of $110.00 and a low estimate of $80.00. This current average has decreased by 9.75% from the previous average price target of $99.50. The perception of MSC Industrial Direct Co by financial experts is analyzed through recent analyst actions. The following summary presents key analysts, their recent evaluations, and adjustments to ratings and price targets. Analyzing these analyst evaluations alongside relevant financial metrics can provide a comprehensive view of MSC Industrial Direct Co's market position. Stay informed and make data-driven decisions with the assistance of our Ratings Table. Stay up to date on MSC Industrial Direct Co analyst ratings. MSC Industrial Direct is one of the largest industrial distributors with a focus on metalworking and maintenance, repair, and operations products and services. The company offers over 2 million products through its distribution network, which has 11 fulfillment centers. Although MSC has a presence in Canada, Mexico, and the United Kingdom, it primarily operates in the United States. In fiscal 2023, 95% of the firm's $4.0 billion of sales was generated in the US. Market Capitalization Analysis: The company's market capitalization is below the industry average, suggesting that it is relatively smaller compared to peers. This could be due to various factors, including perceived growth potential or operational scale. Revenue Challenges: MSC Industrial Direct Co's revenue growth over 3 months faced difficulties. As of 29 February, 2024, the company experienced a decline of approximately -2.73% . This indicates a decrease in top-line earnings. As compared to competitors, the company encountered difficulties, with a growth rate lower than the average among peers in the Industrials sector. Net Margin: MSC Industrial Direct Co's net margin is below industry standards, pointing towards difficulties in achieving strong profitability. With a net margin of 6.61%, the company may encounter challenges in effective cost control. Return on Equity (ROE): MSC Industrial Direct Co's financial strength is reflected in its exceptional ROE, which exceeds industry averages. With a remarkable ROE of 4.46%, the company showcases efficient use of equity capital and strong financial health. Return on Assets (ROA): MSC Industrial Direct Co's financial strength is reflected in its exceptional ROA, which exceeds industry averages. With a remarkable ROA of 2.48%, the company showcases efficient use of assets and strong financial health. Debt Management: MSC Industrial Direct Co's debt-to-equity ratio is below the industry average. With a ratio of , the company relies less on debt financing, maintaining a healthier balance between debt and equity, which can be viewed positively by investors. Analysts are specialists within banking and financial systems that typically report for specific stocks or within defined sectors. These people research company financial statements, sit in conference calls and meetings, and speak with relevant insiders to determine what are known as analyst ratings for stocks. Typically, analysts will rate each stock once a quarter. Some analysts also offer predictions for helpful metrics such as earnings, revenue, and growth estimates to provide further guidance as to what to do with certain tickers. It is important to keep in mind that while stock and sector analysts are specialists, they are also human and can only forecast their beliefs to traders. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "3 Blue-Chip Bargains Trading at Great Depression-Era Valuations", "title_link": "https://markets.businessinsider.com/news/stocks/3-blue-chip-bargains-trading-at-great-depression-era-valuations-1033527690", "Description": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips With the S&P 500 valued at 24.05x its trailing 12-month earnings and 22.27x the 12-month forward estimate, it’s not easy to find bargain blue-chip stocks . Especially, when you consider that its trailing 12-month P/E ratio a year ago was 19.61x, 18% cheaper than it is today. While most people consider the S&P 500 to be the ultimate blue-chip index, one could argue that an index like the CRSP US Mega Cap Index , the benchmark for the Vanguard Mega Cap ETF (NYSEARCA: MGC ), would be a more appropriate choice. That’s because the median market capitalization of MGC is over $462 billion . Compare this to $314 billion for the SPDR S&P 500 ETF Trust (NYSEARCA: SPY ). MGC has 206 stocks compared to 506 for the S&P 500. Tech stocks account for 40.87% for the former and 32.77% for the latter. However, the next largest sector for MGC is consumer discretionary (13.59%), while the next highest for SPY is financials (12.41%). It makes a slightly different portfolio composition. Based on MGC’s top three sectors — the third is health care (11.94%) — let’s examine three bargain blue chip stocks. Cisco Systems (NASDAQ: CSCO ) has a weight of 0.45% in MGC. It has P/E and forward P/E ratios of 16.05x and 13.5x and a $190 billion market cap. Both of these multiples are lower than the S&P 500 and the company’s five-year average. Absolutely, Cisco stock has been in a funk the last five years, down nearly 17% over this period. It just can’t seem to stay above $55 for more than a few weeks.And, analysts don’t like it. Of the 28 that cover it, just seven rate it a buy , with a $53 target price, 12% higher than where it’s currently trading. Part of the problem, as several media outlets concur, is that the company’s share price went too far, too fast after going public in 1990. It jumped 1000x in the ten years leading up to the 21st century. Since it hit an all-time high around $80 in March 2000, it has never retested this level. However, there’s enough good news at the networking solutions provider, to give investors hope. In June, it announced a $1 billion investment fund to develop secure artificial intelligence ( AI ) solutions. As part of the fund’s investments, it’s investing in Cohere, Mistral AI, Scale AI and others to help its customers integrate AI into their businesses. These go along with 20 AI-focused acquisitions it has made in recent years. With an attractive 3.4% dividend yield, get paid to wait for better days ahead for CSCO stock. I happened to watch the June Acquired podcast interviewing former Chief Executive Officer ( CEO ) Howard Schultz this past weekend. If you love Starbucks (NASDAQ: SBUX ), it’s a must-listen. SBUX has a weight of 0.24% in MGC. It has P/E and forward P/E ratios of 21.25x and 19.41x and an $87 billion market cap. Both of these multiples are lower than the S&P 500 and well below the company’s five-year average. It’s easily sporting the cheapest valuation it’s had over the past five years. The company is in the midst of altering its drinkmaking process to speed up service times while making the job of baristas easier. The “Siren Craft System” is expected to be in all 10,000 North American stores by the end of North America. In its first same-store sales decline in recent memory for Q2 of 2024, U.S. same-store sales were down 3% with a 7% decline in traffic. This forced the company to cut 2024 guidance. When Starbucks is handed a major challenge to overcome, it usually finds a way to do so. Down 37% since its all-time high around $121 in July 2021, now is an excellent time to buy this blue-chip bargain. UnitedHealth Group (NYSE: UNH ) has a 1.23% weight in MGC. It has P/E and forward P/E ratios of 30.20x and 18.32x and a $457 billion market cap. While it’s not super cheap at the moment, it is cheaper on a forward earnings basis than the S&P 500. At the end of the day, it’s an excellent bet on the American healthcare industry and worth owning for the long haul. Like the other two stocks, it’s down for the year, but up more than 101% over the past five years. The company’s Change Healthcare business, which it acquired for $13 billion , including the assumption of debt, in October 2022 , had a cyberattack in February . That temporarily brought the health tech subsidiary to its knees and will cost the company $1.25 a share at the midpoint of its guidance, nearly $2 billion. For a regular organization, this would be a deathknell. For the country’s largest health insurer, losses are about 7% of its 2024 adjusted net earnings estimate of $27.75.Not many companies have that kind of financial clout. It finished the second quarter with nearly $79 billion in cash, cash equivalents, and long-term investments. Of the 31 analysts covering its stock, 28 rate it a buy, with a $574 target price, 15% higher than it s current trading price. On the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines . On the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article. Will Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia. The post 3 Blue-Chip Bargains Trading at Great Depression-Era Valuations appeared first on InvestorPlace . Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Unveiling 5 Analyst Insights On Bank of Hawaii", "title_link": "https://markets.businessinsider.com/news/stocks/unveiling-5-analyst-insights-on-bank-of-hawaii-1033527473", "Description": "Providing a diverse range of perspectives from bullish to bearish, 5 analysts have published ratings on Bank of Hawaii (NYSE:BOH) in the last three months. The table below provides a snapshot of their recent ratings, showcasing how sentiments have evolved over the past 30 days and comparing them to the preceding months. Analysts' evaluations of 12-month price targets offer additional insights, showcasing an average target of $56.8, with a high estimate of $62.00 and a low estimate of $50.00. This current average has decreased by 2.41% from the previous average price target of $58.20. The analysis of recent analyst actions sheds light on the perception of Bank of Hawaii by financial experts. The following summary presents key analysts, their recent evaluations, and adjustments to ratings and price targets. Navigating through these analyst evaluations alongside other financial indicators can contribute to a holistic understanding of Bank of Hawaii's market standing. Stay informed and make data-driven decisions with our Ratings Table. Stay up to date on Bank of Hawaii analyst ratings. Bank of Hawaii Corp provides a broad range of financial products and services predominantlyto customers in Hawaii, Guam, and other Pacific Islands. The Bank's subsidiaries are engaged in equipment leasing, securities brokerage, investment advisory services, and providing credit insurance. It is organized into three business segments for management reporting purposes: Consumer Banking, Commercial Banking, and Treasury and Other. Majority of the revenue is generated from Consumer Banking segment which offers a broad range of financial products and services, including loan, deposit and insurance products; private banking and international client banking services; trust services; investment management; and institutional investment advisory services. Market Capitalization Analysis: Positioned below industry benchmarks, the company's market capitalization faces constraints in size. This could be influenced by factors such as growth expectations or operational capacity. Decline in Revenue: Over the 3 months period, Bank of Hawaii faced challenges, resulting in a decline of approximately -11.7% in revenue growth as of 31 March, 2024. This signifies a reduction in the company's top-line earnings. As compared to its peers, the revenue growth lags behind its industry peers. The company achieved a growth rate lower than the average among peers in Financials sector. Net Margin: The company's net margin is below industry benchmarks, signaling potential difficulties in achieving strong profitability. With a net margin of 22.27%, the company may need to address challenges in effective cost control. Return on Equity (ROE): The company's ROE is a standout performer, exceeding industry averages. With an impressive ROE of 2.76%, the company showcases effective utilization of equity capital. Return on Assets (ROA): Bank of Hawaii's ROA is below industry standards, pointing towards difficulties in efficiently utilizing assets. With an ROA of 0.15%, the company may encounter challenges in delivering satisfactory returns from its assets. Debt Management: Bank of Hawaii's debt-to-equity ratio stands notably higher than the industry average, reaching 0.52 . This indicates a heavier reliance on borrowed funds, raising concerns about financial leverage. Experts in banking and financial systems, analysts specialize in reporting for specific stocks or defined sectors. Their comprehensive research involves attending company conference calls and meetings, analyzing financial statements, and engaging with insiders to generate what are known as analyst ratings for stocks. Typically, analysts assess and rate each stock once per quarter. Analysts may enhance their evaluations by incorporating forecasts for metrics like growth estimates, earnings, and revenue, delivering additional guidance to investors. It is vital to acknowledge that, although experts in stocks and sectors, analysts are human and express their opinions when providing insights. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "The Latest Analyst Ratings For Fulton Financial", "title_link": "https://markets.businessinsider.com/news/stocks/the-latest-analyst-ratings-for-fulton-financial-1033527472", "Description": "Providing a diverse range of perspectives from bullish to bearish, 8 analysts have published ratings on Fulton Financial (NASDAQ:FULT) in the last three months. The table below offers a condensed view of their recent ratings, showcasing the changing sentiments over the past 30 days and comparing them to the preceding months. Analysts provide deeper insights through their assessments of 12-month price targets, revealing an average target of $17.44, a high estimate of $19.50, and a low estimate of $15.50. Marking an increase of 6.15%, the current average surpasses the previous average price target of $16.43. A clear picture of Fulton Financial's perception among financial experts is painted with a thorough analysis of recent analyst actions. The summary below outlines key analysts, their recent evaluations, and adjustments to ratings and price targets. Capture valuable insights into Fulton Financial's market standing by understanding these analyst evaluations alongside pertinent financial indicators. Stay informed and make strategic decisions with our Ratings Table. Stay up to date on Fulton Financial analyst ratings. Fulton Financial is a U.S.-based financial services holding company that operates in five states: Pennsylvania, Delaware, Maryland, New Jersey, and Virginia. It offers a range of consumer and commercial banking products and services, such as checking and savings deposit products and loan products. It offers consumer and commercial banking products and services, as well as wealth management products and services. The bank derives its revenue from non-interest income, led by its Wealth Management division. Market Capitalization Analysis: Below industry benchmarks, the company's market capitalization reflects a smaller scale relative to peers. This could be attributed to factors such as growth expectations or operational capacity. Negative Revenue Trend: Examining Fulton Financial's financials over 3 months reveals challenges. As of 31 March, 2024, the company experienced a decline of approximately -1.22% in revenue growth, reflecting a decrease in top-line earnings. As compared to its peers, the revenue growth lags behind its industry peers. The company achieved a growth rate lower than the average among peers in Financials sector. Net Margin: Fulton Financial's net margin lags behind industry averages, suggesting challenges in maintaining strong profitability. With a net margin of 22.49%, the company may face hurdles in effective cost management. Return on Equity (ROE): Fulton Financial's ROE excels beyond industry benchmarks, reaching 2.31% . This signifies robust financial management and efficient use of shareholder equity capital. Return on Assets (ROA): Fulton Financial's ROA is below industry averages, indicating potential challenges in efficiently utilizing assets. With an ROA of 0.22%, the company may face hurdles in achieving optimal financial returns. Debt Management: The company faces challenges in debt management with a debt-to-equity ratio higher than the industry average. With a ratio of 0.9 , caution is advised due to increased financial risk. Benzinga tracks 150 analyst firms and reports on their stock expectations. Analysts typically arrive at their conclusions by predicting how much money a company will make in the future, usually the upcoming five years, and how risky or predictable that company's revenue streams are. Analysts attend company conference calls and meetings, research company financial statements, and communicate with insiders to publish their ratings on stocks. Analysts typically rate each stock once per quarter or whenever the company has a major update. Some analysts will also offer forecasts for metrics like growth estimates, earnings, and revenue to provide further guidance on stocks. Investors who use analyst ratings should note that this specialized advice comes from humans and may be subject to error. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "First Horizon Stock: A Deep Dive Into Analyst Perspectives (11 Ratings)", "title_link": "https://markets.businessinsider.com/news/stocks/first-horizon-stock-a-deep-dive-into-analyst-perspectives-11-ratings-1033527471", "Description": "11 analysts have expressed a variety of opinions on First Horizon (NYSE:FHN) over the past quarter, offering a diverse set of opinions from bullish to bearish. In the table below, you'll find a summary of their recent ratings, revealing the shifting sentiments over the past 30 days and comparing them to the previous months. Analysts have recently evaluated First Horizon and provided 12-month price targets. The average target is $17.5, accompanied by a high estimate of $19.00 and a low estimate of $16.00. This current average has increased by 5.11% from the previous average price target of $16.65. An in-depth analysis of recent analyst actions unveils how financial experts perceive First Horizon. The following summary outlines key analysts, their recent evaluations, and adjustments to ratings and price targets. For valuable insights into First Horizon's market performance, consider these analyst evaluations alongside crucial financial indicators. Stay well-informed and make prudent decisions using our Ratings Table. Stay up to date on First Horizon analyst ratings. First Horizon Corp is the parent company of First Tennessee Bank, a prominent regional bank with about 200 branches around Tennessee. The regional bank is responsible for roughly 65% of its revenue, while capital markets make a 25% contribution. The remainder is split between the firm's non-strategic (wind-down) and corporate operations. First Horizon concentrates on offering a variety of banking products mainly in its home state, where it has the second- largest deposit franchise with a 13% deposit market share. Market Capitalization: Indicating a reduced size compared to industry averages, the company's market capitalization poses unique challenges. Revenue Challenges: First Horizon's revenue growth over 3 months faced difficulties. As of 31 March, 2024, the company experienced a decline of approximately -4.66% . This indicates a decrease in top-line earnings. When compared to others in the Financials sector, the company faces challenges, achieving a growth rate lower than the average among peers. Net Margin: First Horizon's net margin falls below industry averages, indicating challenges in achieving strong profitability. With a net margin of 23.06%, the company may face hurdles in effective cost management. Return on Equity (ROE): First Horizon's ROE lags behind industry averages, suggesting challenges in maximizing returns on equity capital. With an ROE of 2.19%, the company may face hurdles in achieving optimal financial performance. Return on Assets (ROA): First Horizon's ROA is below industry standards, pointing towards difficulties in efficiently utilizing assets. With an ROA of 0.23%, the company may encounter challenges in delivering satisfactory returns from its assets. Debt Management: First Horizon's debt-to-equity ratio is below the industry average. With a ratio of , the company relies less on debt financing, maintaining a healthier balance between debt and equity, which can be viewed positively by investors. Analysts work in banking and financial systems and typically specialize in reporting for stocks or defined sectors. Analysts may attend company conference calls and meetings, research company financial statements, and communicate with insiders to publish analyst ratings for stocks. Analysts typically rate each stock once per quarter. Analysts may supplement their ratings with predictions for metrics like growth estimates, earnings, and revenue, offering investors a more comprehensive outlook. However, investors should be mindful that analysts, like any human, can have subjective perspectives influencing their forecasts. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "3 Airline Stocks You Should Keep an Eye on in 2H24", "title_link": "https://markets.businessinsider.com/news/stocks/3-airline-stocks-you-should-keep-an-eye-on-in-2h24-1033527720", "Description": "Airline stocks have been flying high, primarily owing to strong passenger revenues. Air travel demand has roared back from the pandemic lows and is particularly strong on the leisure front. Demand for business travel is also bouncing back nicely. Driven by upbeat passenger volumes, stocks in the airline industry have performed well in the first half of 2024. With passenger traffic anticipated to remain high throughout the year, airline stocks are expected to perform strongly in the latter half of 2024 as well. Passenger volumes are likely to move further northward in the ongoing summer season. Per Airlines for America, U.S. airlines are anticipated to carry 271 million passengers from Jun 1 to Aug 31, 2024. The projection marks an all-time high. Air travel is expected to soar over the Labor Day holiday period later this year as well. It is also anticipated to be high during winter, thereby keeping airlines in good shape. Moreover, efforts to reward shareholders by the industry players indicate financial strength. This optimism regarding air travel is not limited to the United States only. In June, the International Air Transport Association, or IATA, increased its current-year global profitability (net) forecast for the industry to $30.5 billion from $25.7 billion estimated in December last year. Net profit in 2023 was $27.4 billion. The top line in 2024 is now anticipated to be $996 billion compared with the previous estimate of $964 billion. The revised revenue forecast, a record high, indicates a 9.7% increase from the 2023 actuals driven by upbeat passenger volumes. Given this encouraging backdrop, we have highlighted three airline stocks that investors should keep a tab on as they are anticipated to perform well going forward. Additionally, the companies have witnessed favorable earnings estimate revisions for the current year. SkyWest (NASDAQ:SKYW) carries a Zacks Rank #2 (Buy) at present. The upbeat air travel demand bodes well for this St. George, UT-based regional carrier. SkyWest's fleet modernization efforts are commendable. The Zacks Consensus Estimate for SKYW's 2024 earnings has improved 6.9% over the past 90 days. SKYW has an expected earnings growth rate of more than 100% for 2024. The company delivered a trailing four-quarter earnings surprise of 128.09%, on average. The Zacks Consensus Estimate for SKYW's 2025 earnings has improved 7.4% over the past 90 days. Image Source: Zacks Investment Research United Airlines is based in Chicago. The gradual increase in air travel demand (particularly for leisure) is aiding UAL. However, high operating costs are hurting the bottom line. Over the past 60 days, the stock has seen the Zacks Consensus Estimate for 2024 earnings being revised 0.2% upward. The Zacks Consensus Estimate for 2025 earnings has been revised 0.4% upward over the past 60 days. UAL currently carries a Zacks Rank #3 (Hold). Image Source: Zacks Investment Research Alaska Air (NYSE:ALK) : The company, based in Seattle, WA, is being aided by the uptick in air travel demand. The carrier's shareholder-friendly attitude also bodes well. Over the past 60 days, the Zacks Consensus Estimate for 2024 earnings has been revised 2% upward. The Zacks Consensus Estimate for 2025 earnings has been revised 5.1% upward over the past 60 days. ALK currently carries a Zacks Rank #3. Image Source: Zacks Investment Research To read this article on Zacks.com click here. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Nike Confronts Market And Product Transition Risks, Analyst Warns", "title_link": "https://markets.businessinsider.com/news/stocks/nike-confronts-market-and-product-transition-risks-analyst-warns-1033527719", "Description": "RBC Capital analyst Piral Dadhania maintained Nike Inc (NYSE:NKE) with a Sector Perform and lowered the price target from$100to$75. Dadhania noted some complacency in assessing Nike’s equity story in recent months. A combination of the Fragmentation Hypothesis, turning the fashion cycle away from Nike’s core competency, and tougher comparatives than peers has created a perfect storm. Dadhania had been cautious about Nike, noting that the product transition would be a multi-quarter process with guidance risk, confirmed by material earnings dilution post fiscal 2025 guidance. Nike should emerge as a stronger company pursuing a more radical overhaul, which is necessary, as per the analyst. Nike has some heavy lifting to right-size key product franchises that are in decline and replace them with new styles, including refreshing entry-level ranges. Nike requires better product visibility for the analyst to turn positive. The analyst also noted potential 2025 second-half earnings risk. Dadhania expects fiscal 2025 revenue and adjusted EPS of $48.86 billion (prior $52.51 billion) and $2.99 (prior $3.88). Deutsche Bank analyst Krisztina Katai maintained Nike with a Buy and lowered the price target from$115to$92. Equity research can be a valuable source of information for learning about a company's fundamentals. Analysts create financial models based on the fundamentals and expected future earnings of a company to arrive at a price target and recommendation for the stock. Shares of Nike have an average 1-year price target of $99.33, representing an expected upside of 32.02%. Because of differences in assumptions, analysts can arrive at very different price targets and recommendations. No analysts have bearish recommendations on Nike, while 20 analysts have bullish ratings. The street high price target from Oppenheimer is $120.0, while the street low from RBC Capital is $75.0. Price Action: NKE shares closed lower by 1.05% to $75.24 on Wednesday. Photo via Shutterstock Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "What Analysts Are Saying About TJX Companies Stock", "title_link": "https://markets.businessinsider.com/news/stocks/what-analysts-are-saying-about-tjx-companies-stock-1033527739", "Description": "TJX Companies (NYSE:TJX) underwent analysis by 12 analysts in the last quarter, revealing a spectrum of viewpoints from bullish to bearish. The following table encapsulates their recent ratings, offering a glimpse into the evolving sentiments over the past 30 days and comparing them to the preceding months. Analysts' evaluations of 12-month price targets offer additional insights, showcasing an average target of $118.58, with a high estimate of $134.00 and a low estimate of $110.00. This upward trend is evident, with the current average reflecting a 5.4% increase from the previous average price target of $112.50. The standing of TJX Companies among financial experts is revealed through an in-depth exploration of recent analyst actions. The summary below outlines key analysts, their recent evaluations, and adjustments to ratings and price targets. Navigating through these analyst evaluations alongside other financial indicators can contribute to a holistic understanding of TJX Companies's market standing. Stay informed and make data-driven decisions with our Ratings Table. Stay up to date on TJX Companies analyst ratings. TJX Companies is the leading off-price retailer of apparel, accessories, and home merchandise in the United States. The firm leverages its more than 21,000 global vendor relationships to procure and sell brand-name merchandise at prices 20%-60% cheaper than conventional retail channels. TJX opportunistically purchases excess inventory that stems from manufacturing overruns and retail closeout sales. The off-price retailer disperses its vast and disparate merchandise across its nearly 5,000 global stores, creating a treasure-hunt shopping experience for consumers. Over three quarters of TJX's sales are derived from the United States, primarily via the T.J. Maxx, Marshalls, and HomeGoods banners. About 10% of sales are from Canada and 12% from Europe and Australia. Market Capitalization Analysis: The company's market capitalization is above the industry average, indicating that it is relatively larger in size compared to peers. This may suggest a higher level of investor confidence and market recognition. Revenue Growth: TJX Companies's revenue growth over a period of 3 months has been noteworthy. As of 30 April, 2024, the company achieved a revenue growth rate of approximately 5.91% . This indicates a substantial increase in the company's top-line earnings. In comparison to its industry peers, the company stands out with a growth rate higher than the average among peers in the Consumer Discretionary sector. Net Margin: TJX Companies's financial strength is reflected in its exceptional net margin, which exceeds industry averages. With a remarkable net margin of 8.57%, the company showcases strong profitability and effective cost management. Return on Equity (ROE): TJX Companies's ROE surpasses industry standards, highlighting the company's exceptional financial performance. With an impressive 14.46% ROE, the company effectively utilizes shareholder equity capital. Return on Assets (ROA): The company's ROA is a standout performer, exceeding industry averages. With an impressive ROA of 3.6%, the company showcases effective utilization of assets. Debt Management: TJX Companies's debt-to-equity ratio is below industry norms, indicating a sound financial structure with a ratio of 1.69 . Ratings come from analysts, or specialists within banking and financial systems that report for specific stocks or defined sectors (typically once per quarter for each stock). Analysts usually derive their information from company conference calls and meetings, financial statements, and conversations with important insiders to reach their decisions. Analysts may enhance their evaluations by incorporating forecasts for metrics like growth estimates, earnings, and revenue, delivering additional guidance to investors. It is vital to acknowledge that, although experts in stocks and sectors, analysts are human and express their opinions when providing insights. This article was generated by Benzinga's automated content engine and reviewed by an editor. Indices Commodities Currencies Stocks"},
{"source_name": "BusinessInsider", "title": "Boeing Set For Improved Deliveries And Production Rates, Goldman Sachs Analyst Says", "title_link": "https://markets.businessinsider.com/news/stocks/boeing-set-for-improved-deliveries-and-production-rates-goldman-sachs-analyst-says-1033527740", "Description": "Goldman Sachs analyst Noah Poponak stated that their analysis suggests that The Boeing Company (NYSE:BA) (Buy rating, $243 price target) is expected to achieve 43 deliveries in June, comprising 34 737 MAX, three 787s, and six other aircraft. Of these, around 26 of the 737 MAX deliveries are newly produced, with the remainder sourced from inventory. The numbers show an improvement in both total deliveries and production rates compared to earlier in the year, writes the analyst. Boeing’s 2024 strategy starts with prioritizing product quality over immediate production ramp-up, intending to gradually boost output later in the year to meet demand, says the analyst. Poponak says that June’s numbers mark a preliminary indicator that could support Boeing’s approach. Feedback from suppliers suggests that the company maintains monthly MAX deliveries in the 30s and mid-single digits for the 787, aligning with its strategic goals. The analyst’s target price of $243 is based on achieving a 5.0% FCF yield on the projected 2025 free cash flow per share. Poponak estimates EPS of $1.76 in FY24, $8.29 in FY25 and $13.52 in FY26. However, the analyst cites risks related to air traffic growth pace, production ramp-up challenges in the supply chain, and operational performance in defense contracts. Also Read : Boeing Receives Order For Four 777 Freighters From Turkish Airlines This week, Boeing entered into a definitive agreement to purchase Spirit AeroSystems Holdings, Inc. (NYSE:SPR) at $37.25 a share, a 30% premium to Spirit’s closing stock price on February 29. Boeing stock has lost around 12% in the last 12 months.Investors can gain exposure to the stock via IShares U.S.Aerospace & Defense ETF (BATS:ITA)and Invesco Aerospace& Defense ETF (NYSE:PPA). Price Action : BA shares closed down 0.60% at $184.31 on Wednesday. Disclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors. Photo via Shutterstock Read Next: Indices Commodities Currencies Stocks"}
]