[
{"title": "Stock market today: Wall Street hits records as a slowing economy boosts hopes for lower rates", "title_link": "https://apnews.com/article/stock-markets-rates-inflation-fed-7ba831e66d5e09c95af343728ecd160e", "published_by": "By  STAN CHOE", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.The New York Stock Exchange is seen on Wednesday, July 3, 2024, in New York. Wall Street is leaning toward minuscule gains before the bell ahead of the Fourth of July holiday. (AP Photo/Peter Morgan)A currency trader walks by the screen showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rates at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)Currency traders work by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader watches computer monitors near the screens showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rate at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)The New York Stock Exchange is seen on Wednesday, July 3, 2024, in New York. Wall Street is leaning toward minuscule gains before the bell ahead of the Fourth of July holiday. (AP Photo/Peter Morgan)The New York Stock Exchange is seen on Wednesday, July 3, 2024, in New York. Wall Street is leaning toward minuscule gains before the bell ahead of the Fourth of July holiday. (AP Photo/Peter Morgan)A currency trader walks by the screen showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rates at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader walks by the screen showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rates at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)Currency traders work by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)Currency traders work by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader watches computer monitors near the screens showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rate at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader watches computer monitors near the screens showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rate at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)NEW YORK (AP) — Wall Street’s record-breaking rally kept going Wednesday after weak reports on the U.S. economy kept the door open for possible cuts to interest rates. The S&P 500 rose 0.5% to set an all-time high for a second straight day and for the 33rd time this year. The Dow Jones Industrial Average slipped 23 points, or 0.1%, while the Nasdaq composite added 0.9% to its record set the day before. Trading ended early for the day ahead of the Fourth of July holiday.Tesla again helped boost the market and rose 6.5% a day after reporting a milder drop in sales for the spring than analysts feared. It was one of the strongest forces pushing upward on the S&P 500, along with Nvidia. The darling of Wall Street’s rush into artificial-intelligence technology climbed 4.6% to bring the chip company’s gain for the year so far to 159%. The action was stronger in the bond market, where Treasury yields slid following a flurry of reports that came in weaker than expected on both the job market and U.S. services companies. The data could keep the Federal Reserve on course to deliver the cuts to interest rates later this year that Wall Street desires.One report said activity for businesses in the real estate, retail trade and other U.S. services industries contracted in June for just the third time in 49 months. The reading was weaker than economists’ forecasts, which called for just a slowing of growth. Perhaps more importantly for Wall Street, the report from the Institute Supply Management also said prices were increasing at a slower pace. That followed reports from earlier in the morning showing a slowing job market. One said slightly more U.S. workers applied for unemployment benefits last week than economists expected, though the number remains low compared with history. Another from ADP indicated employers outside the government slowed their hiring last month, when economists were forecasting an acceleration.\n        \n    The hope on Wall Street is that the economy will soften by just the right amount: enough to keep a lid on upward pressure on inflation, but not so much that it throws workers out of their jobs and triggers a recession. A much more anticipated report will arrive on Friday, when the U.S. government will give its comprehensive update about how many workers employers added to their payrolls during June.The yield on the 10-year Treasury dropped to 4.35% from 4.44% late Tuesday, a notable move for the bond market, and much of the slide came after the report on U.S. services businesses. It’s been generally sinking since April on hopes that inflation is slowing enough to get the Federal Reserve to lower its main interest rate from the highest level in more than two decades.Wednesday’s move erased some of a recent recovery for yields. Last week’s debate between President Joe Biden and former President Donald Trump pushed some traders to make moves in anticipation of a Republican sweep in November, which would raise the possibility of tax cuts and other policies that could cause the U.S. government’s debt to swell.The two-year Treasury yield, which more closely tracks expectations for Fed actions, fell to 4.70% from 4.75% late Tuesday. Traders are now betting on a nearly three-in-four chance that the Federal Reserve will cut its main interest rate as soon as September, according to data from CME Group. On Wall Street, Constellation Brands sank 3.3% after swinging between gains and losses during the day. The company behind Modelo beer and Robert Mondavi wines reported stronger profit for the latest quarter than expected, but its revenue came up just shy of financial analysts’ forecasts.All told, the S&P 500 rose 28.01 points to 5,537.02. The Dow dipped 23.85 to 39,308.00, and the Nasdaq composite gained 159.54 to 18,188.30.This is a traditionally strong time of year for Wall Street, according to Mark Hackett, Nationwide’s chief of investment research. He said the first half of July has been the best two-week stretch for stocks on the calendar since 1928, and the S&P 500 has risen in July for nine straight years. Even though discouraging reports have shown lower-income U.S. households are struggling to keep up with still-high inflation, “the glass-half-full mindset of investors continues to drive markets higher,” Hackett said. In stock markets abroad, indexes rose across much of Europe and Asia. France’s CAC 40 climbed 1.2% to recover more of its losses caused by worries that a swing away from centrist government policies could lead to higher debt for the French government.The FTSE 100 rose 0.6% in London ahead of an upcoming election in the United Kingdom, while Tokyo’s Nikkei 225 jumped 1.3%.AP Business Writers Yuri Kageyama and Matt Ott contributed.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Stocks edge lower on Wall Street, ending a 3-week winning streak for the S&P 500", "title_link": "https://apnews.com/article/stock-market-inflation-rates-fed-3a47a018ee15fd4b4a487cf7aab9f033", "published_by": "By  DAMIAN J. TROISE and ALEX VEIGA", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.File - People pass the New York Stock Exchange on May 28, 2024, in New York. Global shares have advanced on Friday, June 28, 2024, as traders look ahead to a key report on inflation that could influence the Federal Reserve’s next move on interest rates. (AP Photo/Peter Morgan, File)Stocks on Wall Street gave up early gains and finished lower Friday, ending a three-week winning streak for the S&P 500.A flurry of selling late in the day left the benchmark index 0.4% lower and in the red for the week. The Nasdaq composite fell 0.7%, while the Dow Jones Industrial Average ended 0.1% lower. Despite the downbeat finish, the S&P 500 and the Nasdaq remain near their all-time highs.A pullback in big technology stocks, which have been big winners in the market’s record-breaking runup, weighed on the market. Apple fell 1.6%, Microsoft lost 1.3% and Meta Platforms ended 3% lower. The late-afternoon burst of selling may reflect traders taking profits, with the market near all-time highs, or rebalancing their portfolios as the second quarter comes to a close, said Ross Mayfield, investment strategy analyst at Baird.“It wouldn’t surprise me at all if there was some profit-taking today, especially out of the names that have really run up,” Mayfield said. “That could be why we’re seeing a little bit of additional weakness from big tech versus the rest of the market.”The market headed higher in the early going following a closely watched report that showed inflation continues easing. Investors are hoping that cooling inflation will prompt the Federal Reserve to start cutting interest rates, which remain at their highest level in more than 20 years.Consumer prices rose 2.6% in May compared with a year ago, according to the latest personal consumption expenditures index, or PCE. That signaled continued easing from a 2.7% reading in April and is sharply lower than the peak reading of 7.1% two years ago.\n        \n    “It’s moving in the right direction and this is what the Fed needs to make a decision to cut rates,” said Quincy Krosby, chief global strategist for LPL Financial.The PCE is the Fed’s preferred measure of inflation and the latest reading is encouraging for economists and investors who are hoping for rate cuts to help ease pressure on the market and borrowers. Wall Street is betting that the Fed will start cutting interest rates at its meeting in September.Treasury yields rose in the bond market after initially losing ground following the latest signal of easing inflation. The yield on the 10-year Treasury, which influences interest rates on mortgages and other consumer loans, rose to 4.38% from 4.30% just prior to the release of the PCE data. The yield on the two-year Treasury, which more closely tracks expectations for Fed actions, rose to 4.74% from 4.72% just prior to the data’s release.The Fed raised interest rates to their highest level in more than two decades in an effort to tame inflation back to its 2% target. Other measures of inflation, including the well-known consumer price index, have also confirmed that pressure on prices has been easing.Consumers are still feeling pressure from inflation, despite the significant easing from its peak, and recent data has shown that spending is weakening and weighing down economic growth. The Fed’s goal was to slow economic growth enough to cool inflation, but not so much that the economy slips into a recession.“This combination of inflation coming down and consumers being much more careful with spending patterns allows the market to see the possibility of a rate cut in September,” Krosby said.The strong jobs market has been another big factor driving economic growth, but that has also shown signs of weakening. Wall Street will get updates on job openings, unemployment, and hiring next week.Nike tumbled 20% for the biggest decline among S&P 500 stocks after the shoe and athletic wear company missed Wall Street’s revenue targets and cut its full-year sales guidance. Company executives said they expect sales to decline by single digits in the current fiscal year, citing a “challenging” environment.Nike’s dour outlook dragged other athletic apparel companies down with it. Foot Locker fell 2.4%, Skechers lost 1% and Under Armour dropped 2.6%.More retailers, especially those focusing on discretionary items, have been warning about a slowdown in consumer spending. Consumers barely increased spending in May from April, according to the latest government retail sales report. Gains in financial sector stocks helped limit the pullback in the S&P 500. JPMorgan Chase rose 1.6% and Wells Fargo closed 3.4% higher.The S&P 500 closed out its final trading day of June with a 3.5% gain for the month. The index is up about 14.5% so far this year.The Nasdaq gained about 6% for the month and is up 18.1% this year.All told, the S&P 500 fell 22.39 points to 5,460.48. The Dow dropped 45.20 points to 39,118.86. The Nasdaq slid 126.08 points to close at 17,732.60.AP Business Writers Yuri Kageyama and Matt Ott contributed to this report.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "How major US stock indexes fared Tuesday, 7/2/2024", "title_link": "https://apnews.com/article/wall-street-stocks-dow-nasdaq-6f85cb1c287d4119ca796c5cb8941701", "published_by": "By  THE ASSOCIATED PRESS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.A big gain for Tesla helped drive Wall Street to more records. The S&P 500 rose 0.6% to top its all-time high set two weeks ago. The Dow Jones Industrial Average added 0.4%, and the Nasdaq composite climbed 0.8% from its own record set a day earlier. Tesla led the way after the electric-vehicle maker reported better sales for the spring than analysts expected. Treasury yields eased after the head of the Federal Reserve cited encouraging progress on inflation, which bolstered hopes for cuts to interest rates later this year. Crude oil’s price eased after touching its highest level since April. On Tuesday:The S&P 500 rose 33.92 points, or 0.6%, to 5,509.01.The Dow Jones Industrial Average rose 162.33 points, or 0.4%, to 39,331.85.The Nasdaq composite rose 149.46 points, or 0.8%, to 18,028.76.The Russell 2000 index of smaller companies rose 3.81 points, or 0.2%, to 2,033.87.For the week:The S&P 500 is up 48.53 points, or 0.9%.The Dow is up 212.99 points, or 0.5%.The Nasdaq is up 296.16 points, or 1.7%.The Russell 2000 is down 13.82 points, or 0.7%.For the year:The S&P 500 is up 739.18 points, or 15.5%.The Dow is up 1,642.31 points, or 4.4%.The Nasdaq is up 3,017.41 points, or 20.1%.The Russell 2000 is up 6.80 points, or 0.3%.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Asian shares are mixed after gains on Wall Street", "title_link": "https://apnews.com/article/stock-markets-pmi-tankan-euro-d770743b4d78149fb81a743cd684711a", "published_by": "By  ZIMO ZHONG", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Tuesday, July 2, 2024. (AP Photo/Ahn Young-joon)A currency trader passes by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Tuesday, July 2, 2024. (AP Photo/Ahn Young-joon)Currency traders work near the screen showing the Korea Composite Stock Price Index (KOSPI), top left, and the foreign exchange rate between U.S. dollar and South Korean won, top center, at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Tuesday, July 2, 2024. (AP Photo/Ahn Young-joon)FILE - A man walking on Wall Street approaches the New York Stock Exchange, right, on June 26, 2024, in New York. Shares advanced in Europe on July 1, 2024, with the benchmark in Paris up 2.8% briefly after the far-right National Rally gained a strong lead in first-round legislative elections. (AP Photo/Peter Morgan, File)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Tuesday, July 2, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Tuesday, July 2, 2024. (AP Photo/Ahn Young-joon)A currency trader passes by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Tuesday, July 2, 2024. (AP Photo/Ahn Young-joon)A currency trader passes by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Tuesday, July 2, 2024. (AP Photo/Ahn Young-joon)Currency traders work near the screen showing the Korea Composite Stock Price Index (KOSPI), top left, and the foreign exchange rate between U.S. dollar and South Korean won, top center, at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Tuesday, July 2, 2024. (AP Photo/Ahn Young-joon)Currency traders work near the screen showing the Korea Composite Stock Price Index (KOSPI), top left, and the foreign exchange rate between U.S. dollar and South Korean won, top center, at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Tuesday, July 2, 2024. (AP Photo/Ahn Young-joon)FILE - A man walking on Wall Street approaches the New York Stock Exchange, right, on June 26, 2024, in New York. Shares advanced in Europe on July 1, 2024, with the benchmark in Paris up 2.8% briefly after the far-right National Rally gained a strong lead in first-round legislative elections. (AP Photo/Peter Morgan, File)FILE - A man walking on Wall Street approaches the New York Stock Exchange, right, on June 26, 2024, in New York. Shares advanced in Europe on July 1, 2024, with the benchmark in Paris up 2.8% briefly after the far-right National Rally gained a strong lead in first-round legislative elections. (AP Photo/Peter Morgan, File)HONG KONG (AP) — Asian stocks were mixed Tuesday after stocks advanced on Wall Street and yields jumped in the U.S. bond market as election-related issues swayed markets worldwide.U.S. futures fell and oil prices rose. The Japanese yen fell to near a fresh 38-year low, reaching 161.66 yen to the dollar early Tuesday.Tokyo’s benchmark Nikkei 225 added 1.1% to 40,062.42, as the weaker yen spurred buying of export-oriented shares. Australia’s S&P/ASX 200 shed 0.4% to 7,719.30. South Korea’s Kospi dropped 0.9% to 2,778.32 despite data from Statistics Korea showing the country’s consumer inflation slowed to an 11-month low in June.Hong Kong’s market was higher after a holiday break on Monday. The Hang Seng climbed 0.6% to 17,819.50 and the Shanghai Composite index edged was nearly unchanged at 2,995.78.Elsewhere, Taiwan’s Taiex gained 0.6%, while the SET in Bangkok was 0.6% lower.On Friday, the S&P 500 rose 0.3% to 5,475.09. The Dow Jones Industrial Average edged up 0.1% to 39,169.52, and the Nasdaq composite gained 0.8% to 17,879.30.Some of the world’s strongest action was across the Atlantic, where the CAC 40 index in Paris jumped as much as 2.8% before settling to a gain of 1.1%. Results from France suggested a far-right political party may not win a decisive majority  in the country’s legislative elections. That bolstered hopes for potential gridlock in the French government, which would prevent a worst-case scenario where a far-right with a clear majority could push policies that would greatly increase the French government’s debt. This is a big year for elections worldwide, with voters heading to the polls in the United Kingdom later this week  and soon elsewhere. In the United States, pollsters are measuring the fallout from last week’s debate  between President Joe Biden and former President Donald Trump. \n        \n    Investors are also eyeing the potential impact from a Supreme Court ruling Monday that former presidents have broad immunity from prosecution, likely extending the delay in a criminal case against Donald Trump to after the November election. Trump Media & Technology Group, whose stock has been rising and falling with Trump’s White House chances, climbed 1% to $33.08. Shares of the company behind Trump’s Truth Social platform, though, are still well below their perch of roughly $70 reached earlier this year.Treasury yields jumped, as they did Friday immediately following the Biden-Trump debate. Increased prospects for a Republican sweep in November sent traders back to moves from 2016, according to strategists at Morgan Stanley. Besides pushing rates higher, traders also piled into stocks of energy and financial companies. The yield on the 10-year Treasury climbed to 4.46% from 4.39% late Friday and from 4.29% late Thursday. It’s a reversal of the general trend since the spring, when the 10-year Treasury yield had topped 4.70% in late April. Yields had been largely easing on hopes inflation will slow enough to convince the Federal Reserve to cut its main interest rate  later this year, down from the highest level in more than two decades. High rates have been grinding on the U.S. economy  by making it more expensive to borrow money for a house, car or anything else.Stocks are getting an early boost. More from AP’s Damian Troise. Hopes for rate cuts held after a report on Monday showed U.S. manufacturing weakened  last month by more than economists expected. Perhaps even more importantly for Wall Street, the report from the Institute for Supply Management also said price increases are decelerating. Taken together, the data could offer more of the evidence that the Federal Reserve wants to see of lessening pressure on inflation before it will cut rates.This week’s economic highlight will likely arrive Friday, when the U.S. government will say how many workers employers hired during June. Economists predict overall hiring slowed to 190,000 from May’s 272,000. That would get the number closer to what Bank of America calls the “Goldilocks” figure of roughly 150,000, give or take 25,000. At that level, the U.S. economy could continue to grow and avoid a recession without being so strong that it puts too much upward pressure on inflation.In other dealings, benchmark U.S. crude rose 12 cents to $83.50 a barrel in electronic trading on the New York Mercantile Exchange. Brent crude, the international standard, added 19 cents to $86.79 a barrel.The euro cost $1.0731, down from $1.0738. Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "How major US stock indexes fared Wednesday, 7/3/2024", "title_link": "https://apnews.com/article/wall-street-stocks-dow-nasdaq-0bd49dc1efa2d81bc144d905840be590", "published_by": "By  THE ASSOCIATED PRESS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.Wall Street’s record-breaking rally kept going after weak reports on the economy kept the door open for possible cuts to interest rates. The S&P 500 rose 0.5% Wednesday to set an all-time high for the 33rd time this year. The Dow Jones Industrial Average slipped 0.1%, and the Nasdaq composite rose 0.9% to push its own record higher. Treasury yields slid following weaker-than-expected reports on both the job market and U.S. services companies, which make up the bulk of businesses. The data bolstered bets for the Federal Reserve to cut its main interest rate as soon as September.On Wednesday:The S&P 500 rose 28.01 points, or 0.5%, to 5,537.02.The Dow Jones Industrial Average fell 23.85 points, or 0.1%, to 39,308.The Nasdaq composite rose 159.54 points, or 0.9%, to 18,188.30.The Russell 2000 index of smaller companies rose 2.75 points, or 0.1%, to 2,036.62.For the week:The S&P 500 is up 76.54 points, or 1.4%.The Dow is up 189.14 points, or 0.5%.The Nasdaq is up 455.70 points, or 2.6%.The Russell 2000 is down 11.07 points, or 0.5%.For the year:The S&P 500 is up 767.19 points, or 16.1%.The Dow is up 1,618.46 points, or 4.3%.The Nasdaq is up 3,176.95 points, or 21.2%.The Russell 2000 is up 9.55 points, or 0.5%.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "How major US stock indexes fared Wednesday, 6/26/2024", "title_link": "https://apnews.com/article/wall-street-stocks-dow-nasdaq-0dde3fa77e46aa98cab341159653f0a6", "published_by": "By  THE ASSOCIATED PRESS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.Stocks drifted to a mixed close near the all-time highs they set last week. The S&P 500 index edged up 0.2% Wednesday. The Nasdaq composite rose 0.5%, and the Dow Jones Industrial Average edged up less than 0.1%. The majority of stocks in the S&P 500 fell. FedEx helped offset the losses with a gain of 15.5%. The package carrier reported results for its latest quarter that easily beat forecasts. Rivian soared more than 23% after Volkswagen said it would invest up to $5 billion in the struggling maker of electric vehicles.On Wednesday:The S&P 500 rose 8.60 points, or 0.2%, to 5,477.90.The Dow Jones Industrial Average rose 15.64 points, or less than 0.1%, to 39,127.80.The Nasdaq composite rose 87.50 points, or 0.5%, to 17,805.16.The Russell 2000 index of smaller companies fell 4.23 points, or 0.2%, to 2,018.12.For the week:The S&P 500 is up 13.28 points, or 0.2%.The Dow is down 22.53 points, or 0.1%.The Nasdaq is up 115.79 points, or 0.7%.The Russell 2000 is down 3.92 points, or 0.2%.For the year:The S&P 500 is up 708.07 points, or 14.8%.The Dow is up 1,438.26 points, or 3.8%.The Nasdaq is up 2,793.80 points, or 18.6%.The Russell 2000 is down 8.95 points, or 0.4%.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Asian shares mostly rise, boosted by Wall Street records as Tesla zooms", "title_link": "https://apnews.com/article/stock-markets-rates-inflation-83cfe7779826fd9a4beddbaae84b6022", "published_by": "By  YURI KAGEYAMA", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.A currency trader walks by the screen showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rates at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)Currency traders work by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader watches computer monitors near the screens showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rate at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader stands by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader walks by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)The Fearless Girl statues faces the New York Stock Exchange on July 2, 2024, in New York. Global stocks are mostly lower after benchmarks ended higher on Wall Street. (AP Photo/Peter Morgan)A currency trader walks by the screen showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rates at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader walks by the screen showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rates at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)Currency traders work by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)Currency traders work by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader watches computer monitors near the screens showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rate at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader watches computer monitors near the screens showing the Korea Composite Stock Price Index (KOSPI), right, and the foreign exchange rate at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader stands by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader stands by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader walks by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)A currency trader walks by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, Wednesday, July 3, 2024. Asian shares were mostly higher on Wednesday after Tesla gained more than 10%, helping to drive U.S. benchmarks to more records. (AP Photo/Lee Jin-man)The Fearless Girl statues faces the New York Stock Exchange on July 2, 2024, in New York. Global stocks are mostly lower after benchmarks ended higher on Wall Street. (AP Photo/Peter Morgan)The Fearless Girl statues faces the New York Stock Exchange on July 2, 2024, in New York. Global stocks are mostly lower after benchmarks ended higher on Wall Street. (AP Photo/Peter Morgan)TOKYO (AP) — Asian shares were mostly higher on Wednesday after Tesla shares zoomed up more than 10%, helping to drive U.S. benchmarks to new records. Japan’s benchmark Nikkei 225 rose 0.9% in morning trading to 40,425.27. Australia’s S&P/ASX 200 gained nearly 0.3% to 7,740.00. South Korea’s Kospi edged up nearly 0.1% to 2,782.42. Hong Kong’s Hang Seng added 0.9% to 17,924.43, while the Shanghai Composite lost 0.3% to 2,989.51. Asian investors were cheered by hopes for an interest rate cut in the U.S. But some traders were keeping to the sidelines ahead of Thursday’s Independence Day holiday in the U.S.“On the radar is the Japan’s Nikkei, which may extend its run above the 40,000 level, with overnight strength in tech while the Japanese yen continues to trade at a 38-year low,” said Yeap Jun Rong, market analyst at IG.In currency trading, the U.S. dollar rose to 161.63 Japanese yen from 161.43 yen. The euro cost $1.0747, little changed from $1.0749. Among Tokyo technology-related shares, Kyocera Corp. jumped 2.2% in morning trading, while Murata Manufacturing Co. surged 5.2%. On Wall Street, the S&P 500 added 0.6% to 5,509.01, topping its all-time high set two weeks ago. The Dow Jones Industrial Average rose 0.4% to 39,331.85, and the Nasdaq composite added 0.8% to 18,028.76, besting its own record set a day earlier.Tesla led the way with a 10.2% jump after the electric-vehicle maker reported a milder drop in sales  for the spring than analysts expected. Modest gains for other big, influential stocks also helped lift the market, including a 1.6% climb for Apple.Investors on Wall Street are in a waiting mode. \n        \n    Stocks got a lift from easing Treasury yields after the head of the Federal Reserve  made comments that investors took as a signal for possible cuts to interest rates later this year. Fed Chair Jerome Powell gave a nod to improvements in inflation data after some disappointingly high readings early in the year. “We just want to understand that the levels that we’re seeing are a true reading of underlying inflation,” he said during a panel discussion at the European Central Bank’s monetary policy conference in Sintra, Portugal.Investors hope inflation will slow enough to convince the Fed to lower its main interest rate, which has been sitting at its highest level in more than two decades and pressing the brakes on the economy.Keeping Wall Street’s gains in check was Nvidia, which has been one of this year’s brightest stars. It fell 1.3%, though it’s still up nearly 147.7% for the year so far.Eli Lilly fell 0.8%, and U.S.-listed shares of Novo Nordisk dropped 1.7% after President Biden criticized in an opinion piece for USA Today how much the companies are charging for their drugs for weight loss and diabetes.The week’s most anticipated economic data will arrive on Friday, when the U.S. government reports the total jobs employers added in June. Before then, the U.S. stock market will have a shortened trading day on Wednesday and Thursday’s Fourth of July holiday. Treasury yields have been feeling some upward pressure recently because of politics. Last week’s debate  between President Joe Biden and former President Donald Trump pushed traders to make moves in anticipation of a possible Republican sweep in November. That included sending Treasury yields higher, in part because of the possibility for policies that would further raise the U.S. government’s debt.The 10-year yield is still well above its 4.29% level from late Thursday, before the debate.In commodities markets, the price of benchmark U.S. oil ended up slipping modestly after touching its highest price since April. Crude prices have largely been rising on expectations for strong demand during the summer, as well as the possibility of hurricanes damaging oil production in the Gulf of Mexico. Hurricane Beryl  is roaring through the Caribbean. U.S. benchmark crude added 35 cents to $83.16 a barrel in electronic trading on the New York Mercantile Exchange. Brent crude, the international standard, gained 40 cents to $86.64 a barrel. AP Writer Stan Choe contributed.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Tokyo’s old fish market makes way for skyscrapers, glitzy stadium to woo global spenders", "title_link": "https://apnews.com/article/japan-tokyo-tsukiji-mitsui-market-7d0923da38cbf2d211adca108e20c5aa", "published_by": "By  YURI KAGEYAMA", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.This photo shows the site of the former Tsukiji fish market in Tokyo on June 15, 2020. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Yuri Kageyama)FILE - Wholesalers perform a ritual hand-clapping for the first auction of fresh tuna fish of the year at the Tsukiji fish market in Tokyo, Jan. 5, 2018. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko, File)FILE - Visitors stroll at Tsukiji Outer Market on June 7, 2024, in Tokyo. The former Tsukiji Fish Market is one of the popular tourist spots in Tokyo. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko, File)This image provided by ONE PARK×ONE TOWN shows an artist rendering of a waterfront stadium and skyscrapers planned to be built at the site of the former Tsukiji fish market in Tokyo. (ONE PARK×ONE TOWN via AP)FILE - People visit a festival at the Tsukiji fish market in Tokyo, May 3, 2016. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko, File)The site of the former Tsukiji Market is seen June 7, 2024, in Tokyo. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko)This photo shows the site of the former Tsukiji fish market in Tokyo on June 15, 2020. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Yuri Kageyama)Jiro Ueda, executive in charge of development planning at Mitsui Fudosan property developer, speaks during an interview with The Associated Press in Tokyo on June 4, 2024. “We are entering a new chapter. Over the years of modernization for Japan, waterfronts were used for warehouses and factories,” said Ueda. (AP Photyo/Yuri Kageyama)Tokyo city hall official Takuo Takano speaks during an interview with The Associated Press at city hall on June 17, 2024. “Tsukiji is a special place for Tokyo. It’s so close to downtown, yet it’s surrounded by waterways and greenery,” Takano said. (AP Photo/Yuri Kageyama)This image provided by ONE PARK×ONE TOWN shows an artist rendering of a waterfront stadium and skyscrapers planned to be built at the site of the former Tsukiji fish market in Tokyo. (ONE PARK×ONE TOWN via AP)This photo shows the site of the former Tsukiji fish market in Tokyo on June 15, 2020. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Yuri Kageyama)This photo shows the site of the former Tsukiji fish market in Tokyo on June 15, 2020. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Yuri Kageyama)FILE - Wholesalers perform a ritual hand-clapping for the first auction of fresh tuna fish of the year at the Tsukiji fish market in Tokyo, Jan. 5, 2018. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko, File)FILE - Wholesalers perform a ritual hand-clapping for the first auction of fresh tuna fish of the year at the Tsukiji fish market in Tokyo, Jan. 5, 2018. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko, File)FILE - Visitors stroll at Tsukiji Outer Market on June 7, 2024, in Tokyo. The former Tsukiji Fish Market is one of the popular tourist spots in Tokyo. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko, File)FILE - Visitors stroll at Tsukiji Outer Market on June 7, 2024, in Tokyo. The former Tsukiji Fish Market is one of the popular tourist spots in Tokyo. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko, File)This image provided by ONE PARK×ONE TOWN shows an artist rendering of a waterfront stadium and skyscrapers planned to be built at the site of the former Tsukiji fish market in Tokyo. (ONE PARK×ONE TOWN via AP)This image provided by ONE PARK×ONE TOWN shows an artist rendering of a waterfront stadium and skyscrapers planned to be built at the site of the former Tsukiji fish market in Tokyo. (ONE PARK×ONE TOWN via AP)FILE - People visit a festival at the Tsukiji fish market in Tokyo, May 3, 2016. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko, File)FILE - People visit a festival at the Tsukiji fish market in Tokyo, May 3, 2016. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko, File)The site of the former Tsukiji Market is seen June 7, 2024, in Tokyo. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko)The site of the former Tsukiji Market is seen June 7, 2024, in Tokyo. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Eugene Hoshiko)This photo shows the site of the former Tsukiji fish market in Tokyo on June 15, 2020. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Yuri Kageyama)This photo shows the site of the former Tsukiji fish market in Tokyo on June 15, 2020. The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. (AP Photo/Yuri Kageyama)Jiro Ueda, executive in charge of development planning at Mitsui Fudosan property developer, speaks during an interview with The Associated Press in Tokyo on June 4, 2024. “We are entering a new chapter. Over the years of modernization for Japan, waterfronts were used for warehouses and factories,” said Ueda. (AP Photyo/Yuri Kageyama)Jiro Ueda, executive in charge of development planning at Mitsui Fudosan property developer, speaks during an interview with The Associated Press in Tokyo on June 4, 2024. “We are entering a new chapter. Over the years of modernization for Japan, waterfronts were used for warehouses and factories,” said Ueda. (AP Photyo/Yuri Kageyama)Tokyo city hall official Takuo Takano speaks during an interview with The Associated Press at city hall on June 17, 2024. “Tsukiji is a special place for Tokyo. It’s so close to downtown, yet it’s surrounded by waterways and greenery,” Takano said. (AP Photo/Yuri Kageyama)Tokyo city hall official Takuo Takano speaks during an interview with The Associated Press at city hall on June 17, 2024. “Tsukiji is a special place for Tokyo. It’s so close to downtown, yet it’s surrounded by waterways and greenery,” Takano said. (AP Photo/Yuri Kageyama)This image provided by ONE PARK×ONE TOWN shows an artist rendering of a waterfront stadium and skyscrapers planned to be built at the site of the former Tsukiji fish market in Tokyo. (ONE PARK×ONE TOWN via AP)This image provided by ONE PARK×ONE TOWN shows an artist rendering of a waterfront stadium and skyscrapers planned to be built at the site of the former Tsukiji fish market in Tokyo. (ONE PARK×ONE TOWN via AP)TOKYO (AP) — The site of Tokyo’s famed Tsukiji fish market, left empty after it was razed six years ago, will be replaced by a scenic waterfront stadium and glistening skyscrapers according to plans for its redevelopment that are facing some staunch opposition. A computer graphic video of plans for the 900 billion yen ($5.7 billion) project made by property developer Mitsui Fudosan shows air taxis zipping above the Sumida river, famed for its scenic bridges.It’s the latest vision for what is to replace the old market famous for its tuna auctions and pre-dawn fresher-than-fresh sushi meals in shops nearby.Mitsui Fudosan says the new development will rival top waterfront spots in places like Sydney and Singapore. The idea is to draw in plenty of people from both Japan and abroad. But some in Tokyo are opposed and would prefer to see the prime site turned into a garden.The plans include office buildings, event spaces, greenery and residential areas, hotels and a biotechnology research center. Also, plenty of places to shop and eat out.“We are entering a new chapter. Over the years of Japan’s modernization, waterfronts were used for warehouses and factories,” said Jiro Ueda, an executive overseeing development planning at major real estate company Mitsui Fudosan, which heads the consortium that won the bid to redevelop the area. “We want to build facilities for sports and entertainment to move people emotionally. We want to make Japan more economically competitive.” \n        \n    The consortium includes a powerful lineup including Toyota Motor, Toyota Fudosan, the Kajima, Taisei, Shimizu and Takenaka construction groups, engineering companies Nikken Sekkei and Pacific Consultants and media groups Asahi Shimbun and the Yomiuri Shimbun Group, whose baseball team, the Yomiuri Giants, may use the new arena as its home stadium.For now, the area that used to be the sprawling main fish market is just a vacant 190,000 square-meter (47-acre) area of cement about the size of 35 football fields, with a few construction machines and a small area that has been dug up. The city-owned land beside the Sumida River is within walking distance of the glitzy downtown Ginza and across a small bridge from Hamarikyu, a traditional Japanese garden with sculpted pine trees, a small forest and a tea house.What’s left of the old Tsukiji market, a quaint “retro” area packed with sushi and ice cream stalls called the “jogai” or “outer area” of the market, will be kept like it is, right next to the modern development.The fish market functions of Tsukiji were moved in 2018 to a more modern, bigger warehouse-like facility in another area of Tokyo Bay called Toyosu.After the market’s buildings were demolished, the empty lot was used for parking during the Tokyo Olympics, which were delayed by a year to 2021 because of the pandemic. The city called for bids in 2022 and in April chose the consortium headed by Mitsui, a participant in the Hudson Yards megadevelopment in Manhattan, New York. Initial construction is due to begin next year.“Tsukiji is a special place for Tokyo. It’s so close to downtown, yet it’s surrounded by waterways and greenery,” said city hall official Takuo Takano. “It will become the face of Tokyo,” Takano told The Associated Press. The project building will connect ferries on the city’s rivers and Tokyo Bay with city subway lines and provide a showcase venue for international conventions, trade shows and summits as well as tourism.The Tsukiji project “will be like a giant city in itself,” said Sachiko Okada, an analyst at Goldman Sachs. “That location pick is right on the dot,” she said.Some groups in the city earlier opposed moving the century-old fish market, a city landmark, to Toyosu, and some still oppose the project, saying building skyscrapers will add to pollution in the area.A garden would be a better alternative, says Shizuko Nagaya, who consults on ecological issues. She also worries about the safety of the densely populated complexes on the land, reclaimed from Tokyo Bay in the 17th century, if a major earthquake hits as expected. “This is a piece of land that belongs to the people,” said Nagaya, who researches history and waterways. “We need a place with a blue sky, the sea breeze and lots of green, where our future children can play.” Christian Dimmer, a professor of urban studies at Waseda University in Tokyo, believes the fish market should have stayed where it was, and developers should leverage the historical and cultural legacy of cities. “Removing the fish market, relocating it far away to Toyosu, and replacing it with yet another luxury housing, hotel, shopping and entertainment complex makes central Tokyo less exciting and more mono-functional,” he said.“The question must be asked whether the current redevelopment model is sustainable. Yet, despite this and other insights, the scrap-and-build development model of Tokyo is still largely unchallenged.” City officials say final details of the development are still undecided. Plenty of time will be allowed for public feedback, they say.Mitsui Fudosan is facing criticism over other projects, including redevelopment of the leafy Jingu Gaien area between Tokyo’s Meiji Shrine and the Imperial Palace. Opponents of the project, which involves renovating two sports arenas, especially object to the loss of famous rows of gingko trees in the area’s streets. The company says the trees and overall natural landscape will be preserved.Yuri Kageyama is on X: https://x.com/yurikageyamaCopyright 2024 The Associated Press. All Rights Reserved."},
{"title": "How major US stock indexes fared Friday, 6/28/2024", "title_link": "https://apnews.com/article/wall-street-stocks-dow-nasdaq-b52722d6b01696c8f9a20ea34d7f32a4", "published_by": "By  THE ASSOCIATED PRESS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.Stocks drifted lower on Wall Street, erasing the S&P 500’s gains for the week. The S&P 500 slipped 0.4% Friday, but remains close to the record high it set last week. The Nasdaq composite fell 0.7% and the Dow slipped 0.1%. Nike dropped 20% after the shoe and athletic wear company missed Wall Street’s revenue targets and cut its full-year sales guidance. Company executives said they expect sales to decline by single digits in the current fiscal year, citing a “challenging” environment. On Friday:The S&P 500 fell 22.39 points, or 0.4%, to 5,460.48.The Dow Jones Industrial Average fell 45.20 points, or 0.1%, to 39,118.86.The Nasdaq composite fell 126.08 points, or 0.7%, to 17,732.60.The Russell 2000 index of smaller companies rose 9.35 points, or 0.5%, to 2,047.69.For the week:The S&P 500 is down 4.14 points, or 0.1%.The Dow is down 31.47 points, or 0.1%.The Nasdaq is up 43.24 points, or 0.2%.The Russell 2000 is up 25.66 points, or 1.3%.For the year:The S&P 500 is up 690.65 points, or 14.5%.The Dow is up 1,429.32 points, or 3.8%.The Nasdaq is up 2,721.25 points, or 18.1%.The Russell 2000 is up 20.62 points, or 1%.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Asian shares mostly rise ahead of U.S. inflation report", "title_link": "https://apnews.com/article/stock-market-inflation-rates-yen-81ab65cc85f5cca94a9aeaa9d87fd6c1", "published_by": "By  YURI KAGEYAMA", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.A currency trader passes by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Friday, June 28, 2024. (AP Photo/Ahn Young-joon)A currency trader watches monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Friday, June 28, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI) at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Friday, June 28, 2024. (AP Photo/Ahn Young-joon)A currency trader passes by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Friday, June 28, 2024. (AP Photo/Ahn Young-joon)A currency trader passes by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Friday, June 28, 2024. (AP Photo/Ahn Young-joon)A currency trader watches monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Friday, June 28, 2024. (AP Photo/Ahn Young-joon)A currency trader watches monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Friday, June 28, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI) at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Friday, June 28, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI) at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Friday, June 28, 2024. (AP Photo/Ahn Young-joon)TOKYO (AP) — Asian shares gained Friday as traders looked ahead to a key report on inflation that could influence the Federal Reserve’s next move on interest rates.Japan’s benchmark Nikkei 225 jumped 0.9% in early trading to 39,711.93. Australia’s S&P/ASX 200 rose 0.6% to 7,803.50. South Korea’s Kospi edged up nearly 0.3% to 2,790.97. Hong Kong’s Hang Seng added 0.8% to 17,860.79, while the Shanghai Composite surged 1.0% to 2,976.26. In Japan, the government reported unemployment rate was unchanged from the previous month at 2.6% in May. On Wall Street, the S&P 500 eked out a 0.1% gain. The benchmark index has been hovering near the all-time high it set last week.The Nasdaq composite rose 0.3% and remains just below its all-time high. The Dow Jones Industrial Average closed 0.1% higher.Gains in retailers and communications services companies helped outweigh losses in consumer goods makers, financial stocks and elsewhere in the market. Amazon.com rose 2.2% and Meta Platforms added 1.3%. Walgreens Boosts Alliance plunged 22.2% for the biggest drop in the S&P 500. Its reported results that fell shy of forecasts and cut its outlook. The company said it could close hundreds more stores in the next three years.Jeans maker Levi Strauss sank 15.4% after its latest quarterly revenue results fell short of analysts’ expectations, along with its current earnings forecast for the year.\n        \n    Spice maker McCormick rose 4.3% for one of the biggest gains in the market after beating analysts’ earnings forecasts.Chipmaker Micron Technology fell 7.1% after its latest forecast left investors disappointed. Treasury yields fell in the bond market. The yield on the 10-year Treasury, which influences interest rates on mortgages and other consumer loans, fell to 4.28% from 4.33% late Wednesday. The yield on the two-year Treasury fell to 4.71% from 4.75%.The stock market has been listless this week in the lead up to Friday’s release of the next influential inflation report from the government. The personal consumption expenditures index, or PCE, is the Fed’s preferred measure of inflation.Economists expect the report to show a modest easing of inflation to 2.6% in May, following a 2.7% reading in April. That’s down from the PCE’s peak of 7.1% in the middle of 2022. Other measures of inflation, including the consumer price index, have also eased significantly over the last two years.The latest updates on inflation could influence the central bank’s decision on when to begin cutting interest rates, which remain at their highest level in more than 20 years and which are having an impact worldwide. Wall Street is betting that the central bank will start cutting interest rates at its September meeting.An update from the government said the American economy expanded at a 1.4% annual pace from January through March. The figure is a slight revision from a prior estimate of 1.3%. It marks the slowest quarterly growth since spring 2022.The report also backed data from previous economic reports that show consumers are getting squeezed by persistent inflation and high interest rates. Consumer spending, which has been fueling economic growth, grew at just a 1.5% rate, down from an initial estimate of 2%, according to the report.The main upshot from the report was that “the economy remained resilient in the first quarter but that private sector demand growth was cooling, led by more consumer prudence,” said Gregory Daco, EY chief economist, in a note.The slowdown in consumer spending could help further ease inflation, but too much of a slowdown could result in a more painful hit to the economy. The Federal Reserve is trying to time its efforts tame inflation back to its 2% target without slowing the economy so much that it slips into a recession.The S&P 500 is on pace to notch its fourth straight winning week. With one more trading day left this month, the index is up just under 4% for June and up about 15% so far this year.All told, the S&P 500 rose 4.97 points to 5,482.87. The Dow added 36.26 points to 39,164.06. The Nasdaq gained 53.53 points to close at 17,858.68.In energy trading, benchmark U.S. crude rose 44 cents to $82.17 a barrel. Brent crude, the international standard, added 39 cents to $86.78 a barrel. In currency trading, the U.S. dollar rose to 160.96 Japanese yen from 160.72 yen. The euro cost $1.0695, down from $1.0709. AP Business Writers Damian J. Troise and Alex Veiga contributed. Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "How major US stock indexes fared Friday, 6/14/2024", "title_link": "https://apnews.com/article/wall-street-stocks-dow-nasdaq-73948f91604e17a48d522d1d09572636", "published_by": "By  THE ASSOCIATED PRESS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.U.S. stocks drifted to a mixed close as caution crept into financial markets heading into the weekend. The S&P 500 slipped less than 0.1% Friday after setting an all-time high every other day this week. The Dow Jones Industrial Average fell 0.1%, while the Nasdaq composite edged up 0.1%, marking another all-time high.Losses were sharper across the Atlantic, where European stocks have been rocked by the results of recent elections on the continent. France’s CAC 40 stumbled to its worst week in more than two years. Treasury yields eased following a report on U.S. consumer sentiment.On Friday:The S&P 500 fell 2.14 points, or less than 0.1%, to 5,431.60.The Dow Jones Industrial Average fell 57.94 points, or 0.1%, to 38,589.16.The Nasdaq composite rose 21.32 points, or 0.1%, to 17,688.88.The Russell 2000 index of smaller companies fell 32.75 points, or 1.6%, to 2,006.16.For the week:The S&P 500 is up 84.61 points, or 1.6%.The Dow is down 209.83 points, or 0.5%.The Nasdaq is up 555.76 points, or 3.2%.The Russell 2000 is down 20.39 points, or 1%.For the year:The S&P 500 is up 661.77 points, or 13.9%.The Dow is up 899.62 points, or 2.4%.The Nasdaq is up 2,677.53 points, or 17.8%.The Russell 2000 is down 20.92 points, or 1%.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Wall Street hangs around its records after European stocks slump", "title_link": "https://apnews.com/article/stock-markets-rates-japan-fed-4bd24b5444572136dac6c3db3d88f982", "published_by": "By  STAN CHOE", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.FILE - Specialist James Denaro works at his post on the floor of the New York Stock Exchange on June 12, 2024. Global shares were mixed on Friday, June 14, 2024, after Wall Street touched fresh records, with benchmarks pushed higher by the frenzy over artificial intelligence technology. (AP Photo/Richard Drew, File)NEW YORK (AP) — U.S. stocks hung around their record levels on Friday as Wall Street remained relatively quiet following another slide in Europe.The S&P 500 edged down by less than 0.1%, marking the first time this week where it did not set an all-time high. The Dow Jones Industrial Average dipped 57 points, or 0.1%, while the Nasdaq composite added 0.1% to its record set a day before on the back of gains for technology stocks.Losses were sharper across the Atlantic, where markets have been rocked by the results of recent elections in Europe. Wins by far-right parties have raised the pressure on France’s president in particular, and investors worry it could weaken the European Union, stall fiscal plans and ultimately hurt France’s ability to pay its debt. Recent elections have also shaken markets in Mexico, India and elsewhere.France’s CAC 40 fell 2.7% to bring its loss for the week to 6.2%, its worst in more than two years. Germany’s DAX lost 1.4%.On Wall Street, RH fell 17.1% after reporting a worse loss for the latest quarter than financial analysts expected. The seller of home furnishings called this “the most challenging housing market in three decades.”High mortgage rates  have hurt the housing market, as the Federal Reserve  has kept its main interest rate at the highest level in more than two decades. The central bank is intentionally slowing the economy through high rates in hopes of starving high inflation of its fuel.\n        \n    Cruise-ship operators were among the market’s biggest losers after analysts at Bank of America flagged softening price trends for trips. Norwegian Cruise Line dropped 7.5% for the worst loss in the S&P 500, and Carnival fell 7.1%.Stocks have nevertheless set records as hopes rise that inflation is slowing enough to convince the Federal Reserve to cut interest rates later this year. Big technology stocks, meanwhile, continue to race ahead almost regardless of what the economy and interest rates are doing.Adobe jumped 14.5% after reporting stronger profit for the latest quarter than analysts expected. Broadcom rose 3.3% for a second straight day of gains after reporting better profit than expected and a 10-for-one stock split to make its price more affordable. Nvidia  gained 1.8% as the poster child of the rush into artificial-intelligence technology sees its total market value climb even higher above $3 trillion. Nvidia was the strongest single force pushing upward on the S&P 500, as has become almost routine recently. Adobe and Broadcom were close behind. All told, the S&P 500 dipped 2.14 points to 5,431.60. The Dow lost 57.94 to 38,589.16, and the Nasdaq composite added 21.32 to 17,688.88.In the bond market, U.S. Treasury yields ticked lower after a preliminary report from the University of Michigan suggested sentiment among U.S. consumers failed to improve this month, against economists’ expectations. Solid spending by U.S. households has been one of the main engines keeping the economy out of a recession, but “assessments of personal finances dipped, due to modestly rising concerns over high prices as well as weakening incomes,” according to Joanne Hsu, director of the Surveys of Consumers.Perhaps more importantly for financial markets, expectations for upcoming inflation among U.S. consumers don’t seem to be moving much, even if they are relatively high. That’s an encouraging signal that the economy could avoid a self-fulfilling cycle where expectations for higher inflation drive behavior that creates more of it.The yield on the 10-year Treasury fell to 4.21% from 4.25% late Thursday. It had been as high as 4.60% late last month, before a couple of encouraging reports on inflation. In stock markets abroad, indexes were mixed in Asia. Japan’s Nikkei 225 rose 0.2% after the country’s central bank  held steady on interest rates.AP Business Writer Yuri Kageyama contributed. Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Asian stocks are mixed after Wall Street edges to more records", "title_link": "https://apnews.com/article/stock-markets-rates-inflation-9f49f89dc375db55bfc8f95a6226782b", "published_by": "By  ZIMO ZHONG", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.Currency traders pass by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)The New York Stock Exchange is shown on Tuesday, June 18, 2024 in New York. Shares are mostly higher in Europe and Asia after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Peter Morgan)Currency traders pass by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)Currency traders pass by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)The New York Stock Exchange is shown on Tuesday, June 18, 2024 in New York. Shares are mostly higher in Europe and Asia after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Peter Morgan)The New York Stock Exchange is shown on Tuesday, June 18, 2024 in New York. Shares are mostly higher in Europe and Asia after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Peter Morgan)HONG KONG (AP) — Asian stocks were mixed on Wednesday after U.S. benchmarks ticked to more records following the latest signs that the U.S. economy may be slowing without falling into recession.U.S. futures were mixed and oil prices were little changed. Tokyo’s Nikkei 225 index climbed 0.2% to 38,575.54 as Japan’s trade data for May showed exports rose 13.5% while imports were up 9.5% from a year earlier, pushed higher by rising prices and the weaker value of the yen against the U.S. dollar. Minutes from the Bank of Japan’s latest policy meeting disclosed a debate among its decision makers over whether the yen’s weakness may push inflation still higher. Governor Kazuo Ueda has hinted at raising the benchmark interest rate in coming months, depending on economic data at the time.“Moves in the Nikkei have reflected much indecision in place, with the index trading in a broad consolidation phase thus far,” IG Asia said in a commentary.The Hang Seng in Hong Kong added 2% to 18,264.51 while the Shanghai Composite index lost 0.3% to 3,020.03 after the head of China’s securities watchdog said at a financial forum in Shanghai that the agency would be enhancing oversight of all financial activities to prevent potential risks.In Sydney, the S&P/ASX 200 edged 0.2% lower to 7,764.30. South Korea’s Kospi surged 1% to 2,792.14. Elsewhere, Taiwan’s Taiex gained 1.8%, while Bangkok’s SET fell 0.1%.\n        \n    On Tuesday, the S&P 500 added 0.3% to 5,487.03, setting an all-time high for the 31st time this year. The Nasdaq composite edged up by less than 0.1% to 17,862.23. The Dow Jones Industrial Average gained 0.2% to 38,834.86. Nvidia once again was the star, gaining 3.5% and acting as the strongest force pushing the S&P 500 upward. It lifted its total market value further above $3 trillion, again. Nvidia’s chips are helping to develop AI, which proponents expect to change the world as much or more than the internet, and demand for its chips has proven to be shockingly voracious. Nvidia’s revenue routinely triples every quarter, and its profit is rocketing at even more breathtaking rates. Its stock is up nearly 174% this year, and Nvidia alone was responsible for nearly a third of the S&P 500’s entire gain for the year through May.Of course, a potential danger of having a handful of superstars responsible for most of the U.S. stock market’s run to records is a more fragile market. If more stocks were participating, it could be a signal of a healthier market.The Commerce Department reported that retail sales rose 0.1% in May, below the pace that economists projected, while April sales were revised downward — a 0.2% decline, from unchanged. Sales rose 0.6% in March and 0.9% in February. That comes after sales fell 1.1% in January, dragged down in part by inclement weather.The weaker-than-expected data could be a warning signal that the main engine of the U.S. economy, spending by households, is cracking. Inflation is still high, even if it’s slowed since its peak, and lower-income households  in particular are struggling to keep up with the more expensive prices. Still, a survey of global fund managers by Bank of America showed they’re the most optimistic about stocks since the autumn of 2021, with relatively little hiding out in cash and allocations heavy to stocks. Fewer managers are also calling for a “hard landing” where the economy tumbles into a bad recession.In other dealings early Wednesday, U.S. benchmark crude oil was unchanged at $80.71 per barrel in electronic trading on the New York Mercantile Exchange.Brent crude rose 2 cents to $85.35 per barrel.The dollar rose to 157.87 Japanese yen from 156.87 yen. The euro slipped to $1.0737 from $1.0740. AP Business Writer Stan Choe contributed.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "How major US stock indexes fared Tuesday, 6/18/2024", "title_link": "https://apnews.com/article/wall-street-stocks-dow-nasdaq-789efec80fe35b79e31005a23749fe1b", "published_by": "By  THE ASSOCIATED PRESS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.U.S. stocks edged up to more records following the latest signal that the economy’s growth may be slowing without cratering, while Nvidia continued its rocket ride upward to become Wall Street’s most valuable company. The S&P 500 rose 0.3% Tuesday, hitting another all-time high. The Dow Jones Industrial Average edged up 0.1%, and the Nasdaq composite edged higher to another record. Nvidia climbed to top Microsoft and become the largest U.S. stock by market value at over $3 trillion. Treasury yields fell in the bond market after a report showed sales at retailers returned to growth last month but remained below economists’ expectations. On Tuesday:The S&P 500 rose 13.80 points, or 0.3%, to 5,487.03.The Dow Jones Industrial Average rose 56.76 points, or 0.1%, to 38,834.86.The Nasdaq composite rose 5.21 points, or less than 0.1%, to 17,862.23.The Russell 2000 index of smaller companies rose 3.22 points, or 0.2%, to 2,025.23.For the week:The S&P 500 is up 55.43 points, or 1%.The Dow is up 245.70 points, or 0.6%.The Nasdaq is up 173.35 points, or 1%.The Russell 2000 is up 19.07 points, or 1%.For the year:The S&P 500 is up 717.20 points, or 15%.The Dow is up 1,145.32 points, or 3%.The Nasdaq is up 2,850.88 points, or 19%.The Russell 2000 is down 1.84 points, or 0.1%.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Asian shares mostly gain after Wall St rallies to new records", "title_link": "https://apnews.com/article/stock-market-rates-china-4015f748b375b522f4d45da24e6344db", "published_by": "By  ELAINE KURTENBACH", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.A person stands in the rain in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Tuesday, June 18, 2024, in Tokyo. Shares were mostly higher in Asia on Tuesday after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Eugene Hoshiko)People walk in the rain in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Tuesday, June 18, 2024, in Tokyo. Shares were mostly higher in Asia on Tuesday after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Eugene Hoshiko)A person walks in the rain in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Tuesday, June 18, 2024, in Tokyo. Shares were mostly higher in Asia on Tuesday after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Eugene Hoshiko)FILE - Trader William Lovesick, right works on the floor of the New York Stock Exchange, June 12, 2024. Shares have opened mixed in Europe on Monday, June 17, 2024, as markets recovered from shocks of recent elections across the region. (AP Photo/Richard Drew, File)A person stands in the rain in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Tuesday, June 18, 2024, in Tokyo. Shares were mostly higher in Asia on Tuesday after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Eugene Hoshiko)A person stands in the rain in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Tuesday, June 18, 2024, in Tokyo. Shares were mostly higher in Asia on Tuesday after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Eugene Hoshiko)People walk in the rain in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Tuesday, June 18, 2024, in Tokyo. Shares were mostly higher in Asia on Tuesday after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Eugene Hoshiko)People walk in the rain in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Tuesday, June 18, 2024, in Tokyo. Shares were mostly higher in Asia on Tuesday after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Eugene Hoshiko)A person walks in the rain in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Tuesday, June 18, 2024, in Tokyo. Shares were mostly higher in Asia on Tuesday after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Eugene Hoshiko)A person walks in the rain in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Tuesday, June 18, 2024, in Tokyo. Shares were mostly higher in Asia on Tuesday after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Eugene Hoshiko)FILE - Trader William Lovesick, right works on the floor of the New York Stock Exchange, June 12, 2024. Shares have opened mixed in Europe on Monday, June 17, 2024, as markets recovered from shocks of recent elections across the region. (AP Photo/Richard Drew, File)FILE - Trader William Lovesick, right works on the floor of the New York Stock Exchange, June 12, 2024. Shares have opened mixed in Europe on Monday, June 17, 2024, as markets recovered from shocks of recent elections across the region. (AP Photo/Richard Drew, File)BANGKOK (AP) — Shares were mostly higher in Asia on Tuesday after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. U.S. futures were flat and oil prices declined. This week has few top-tier economic reports apart from an update Tuesday on how much American shoppers are spending at U.S. retailers and a preliminary look Friday at the state of U.S. business activity. U.S. markets will be closed Wednesday for the Juneteenth holiday.Tokyo’s Nikkei 225 index gained 0.9% to 38,441.90. Toyota Motor Corp., a market heavyweight, gained 0.6% after its shareholders rejected a proposal to force Akio Toyoda, grandson of the automaker’s founder, to leave his post as chairman of the board. Hong Kong’s Hang Seng shed 0.2% to 17,903.06 and the Shanghai Composite index gained 0.4% to 3,026.61. In South Korea, the Kospi advanced 0.8% to 2,766.22.In Sydney, the S&P/ASX 200 jumped 1% to 7,776.20 after the Reserve Bank of Australia kept its key interest rate unchanged. “While the Bank at its May meeting noted that inflation had fallen more gradually than expected, it today described it as ‘persistent,’ emphasizing that headline inflation as well as inflation excluding volatile items and travel had not fallen any further between April and December,” Capital Economics said in a commentary.Admittedly, the Bank noted that ‘momentum in economic activity is weak,’ with the statement citing slow GDP growth, a rise in the unemployment rate and slower-than-expected wages growth,’' it said.\n        \n    India’s Sensex rose 0.4% to 77,291.77. On Monday, U.S. stocks rose to records as gains for technology companies keep pushing the market higher.the S&P 500 rose 0.8%, beating an all-time high it set on Thursday. It closed at 5,473.23. The Dow gained 0.5% to 38,778.10, and the Nasdaq composite jumped 1% to 17,857.02.Autodesk jumped 6.5% for one of the market’s biggest gains after an investment firm said it will try to delay the software company’s annual meeting so it can nominate new directors for the board. Close behind Autodesk was chip company Broadcom, which rose 5.4% to add to gains from last week after it reported better profit than expected and said it would undergo a 10-for-one stock split to make its price more affordable. Broadcom followed Nvidia, the company that’s become the poster child of Wall Street’s frenzy around artificial-intelligence technology and just executed a similar split.Wall Street rose to more records. Here’s more from AP business correspondent Seth Sutel. Apple gained 2% and Microsoft climbed 1.2%.Super Micro Computer, which sells server and storage systems used in artificial intelligence and other computing, leaped 5.1% to bring its gain for the year so far to a staggering 212.2%. The gains for tech helped offset pressure on the stock market caused by rising Treasury yields in the bond market. The climb in yields erased some of the slack created last week when better-than-expected reports on inflation raised hopes that the Federal Reserve will cut interest rates later this year.The yield on the 10-year Treasury climbed to 4.28% from 4.22% late Friday. The two-year Treasury yield, which more closely tracks expectations for the Fed, rose to 4.76% from 4.71%.The Fed is trying to hold rates high for long enough to slow the economy and snuff out high inflation, but it wants to cut rates and reverse the momentum before the slowdown evolves into a painful recession.High interest rates hurt all kinds of investments, and they tend to hit some areas particularly hard. Utilities in the S&P 500 fell 1.1% for Monday’s largest loss among the 11 sectors that make up the index. They often get hurt when bonds are paying more in interest and drawing away income-seeking investors who would otherwise gravitate to dividend-paying utility stocks. GameStop was another laggard and fell 12.1% following its annual shareholder meeting. The stock has been soaring and sinking as it rides waves of enthusiasm  by smaller-pocketed investors. At the meeting, CEO Ryan Cohen said the struggling video game retailer will focus on cutting costs, which would involve a “smaller network of stores.”In other dealings, U.S. benchmark crude oil lost 17 cents to $80.19 per barrel in electronic trading on the New York Mercantile Exchange. Brent crude gave up 30 cents top $84.19 per barrel.The dollar rose to 157.59 Japanese yen from 156.38 yen. The euro was trading at $1.0724 from $1.0702.AP Business Writer Stan Choe contributed.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "How major US stock indexes fared Tuesday, 6/11/2024", "title_link": "https://apnews.com/article/wall-street-stocks-dow-nasdaq-a4024f0c2d15fba60643a4d1e33e5228", "published_by": "By  THE ASSOCIATED PRESS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.Stocks drifted to a mixed close overall on Wall Street, but the S&P 500 and Nasdaq composite still managed to notch more record highs. A big gain in Apple helped push both indexes higher Tuesday. The S&P 500 added 0.3%, driven largely by gains in tech stocks, even though more stocks fell than rose within the index. The Nasdaq climbed 0.9%. The Dow Jones Industrial Average slipped 0.3%. The Federal Reserve announces its latest decision on interest rates on Wednesday and is widely expected to leave rates where they are. Apple jumped 7.3% after highlighting its push into artificial intelligence.On Tuesday:The S&P 500 rose 14.53 points, or 0.3%, to 5,375.32.The Dow Jones Industrial Average fell 120.62 points, or 0.3%, to 38,747.42.The Nasdaq composite rose 151.02 points, or 0.9%, to 17,343.55.The Russell 2000 index of smaller companies fell 7.27 points, or 0.4%, to 2,024.35.For the week:The S&P 500 is up 28.33 points, or 0.5%.The Dow is down 51.57 points, or 0.1%.The Nasdaq is up 210.42 points, or 1.2%.The Russell 2000 is down 2.21 points, or 0.1%.For the year:The S&P 500 is up 605.49 points, or 12.7%.The Dow is up 1,057.88 points, or 2.8%.The Nasdaq is up 2,332.19 points, or 15.5%.The Russell 2000 is down 2.73 points, or 0.1%.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Asia shares rise amid Bank of Japan focus after the Fed stands pat", "title_link": "https://apnews.com/article/stock-markets-fed-rates-inflation-67e0a324c1f203de37dcf4d4390d53c3", "published_by": "By  YURI KAGEYAMA", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.A woman walks her dog strolling past monitors showing Japan’s foreign exchange rate against the U.S. dollar and other foreign currencies at a securities firm in Tokyo, Thursday, June 13, 2024. (AP Photo/Hiro Komae)People walk past monitors showing Japan’s Nikkei 225 index at a securities firm at the corner of an intersection in Tokyo, Thursday, June 13, 2024. (AP Photo/Hiro Komae)A man waits for the traffic light to turn standing by monitors showing Japan’s Nikkei 225 index at a securities firm in Tokyo, Thursday, June 13, 2024. (AP Photo/Hiro Komae)Specialist John McNierney works on the floor of the New York Stock Exchange, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)Specialist James Denaro works at his post on the floor of the New York Stock Exchange, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)VIVA GLAM 30 Ambassadors for M·A·C Cosmetics, part of The Estée Lauder Companies, Danna Paola, left, and Kim Petras, walk the floor of the New York Stock Exchange before ringing the opening bell, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)Trader Michael Capolino, left, and specialist Dilip Patel work on the floor of the New York Stock Exchange, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)A woman walks her dog strolling past monitors showing Japan’s foreign exchange rate against the U.S. dollar and other foreign currencies at a securities firm in Tokyo, Thursday, June 13, 2024. (AP Photo/Hiro Komae)A woman walks her dog strolling past monitors showing Japan’s foreign exchange rate against the U.S. dollar and other foreign currencies at a securities firm in Tokyo, Thursday, June 13, 2024. (AP Photo/Hiro Komae)People walk past monitors showing Japan’s Nikkei 225 index at a securities firm at the corner of an intersection in Tokyo, Thursday, June 13, 2024. (AP Photo/Hiro Komae)People walk past monitors showing Japan’s Nikkei 225 index at a securities firm at the corner of an intersection in Tokyo, Thursday, June 13, 2024. (AP Photo/Hiro Komae)A man waits for the traffic light to turn standing by monitors showing Japan’s Nikkei 225 index at a securities firm in Tokyo, Thursday, June 13, 2024. (AP Photo/Hiro Komae)A man waits for the traffic light to turn standing by monitors showing Japan’s Nikkei 225 index at a securities firm in Tokyo, Thursday, June 13, 2024. (AP Photo/Hiro Komae)Specialist John McNierney works on the floor of the New York Stock Exchange, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)Specialist John McNierney works on the floor of the New York Stock Exchange, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)Specialist James Denaro works at his post on the floor of the New York Stock Exchange, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)Specialist James Denaro works at his post on the floor of the New York Stock Exchange, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)VIVA GLAM 30 Ambassadors for M·A·C Cosmetics, part of The Estée Lauder Companies, Danna Paola, left, and Kim Petras, walk the floor of the New York Stock Exchange before ringing the opening bell, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)VIVA GLAM 30 Ambassadors for M·A·C Cosmetics, part of The Estée Lauder Companies, Danna Paola, left, and Kim Petras, walk the floor of the New York Stock Exchange before ringing the opening bell, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)Trader Michael Capolino, left, and specialist Dilip Patel work on the floor of the New York Stock Exchange, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)Trader Michael Capolino, left, and specialist Dilip Patel work on the floor of the New York Stock Exchange, Wednesday, June 12, 2024. U.S. stocks are rallying Wednesday following a surprisingly encouraging update on inflation. (AP Photo/Richard Drew)TOKYO (AP) — Asian shares mostly rose Thursday, as investors turned their attention to what the Bank of Japan might decide on monetary policy later this week. The Bank of Japan is not expected to raise its benchmark rate when it wraps up its meeting on Friday, but the economy is under pressure from the dollar’s prolonged surge against the Japanese yen. “Given the recent ‘hawkish hold’ outcome from the Fed, if the BOJ were to stick to its usual accommodative tone in terms of policy settings, that may pave the way for the upward trend in the U.S. dollar to the Japanese yen to continue,” Yeap Jun Rong, a market analyst at IG, said in a commentary.In currency trading, the U.S. dollar edged up to 157.01 Japanese yen from 156.71 yen. The euro cost $1.0807, down from $1.0812. As expected, the Federal Reserve kept its main interest rate steady on Wednesday following its latest policy meeting. And Treasury yields dropped after a report on inflation showed U.S. consumers paid prices that were 3.3% higher for food, insurance and everything else last month from a year earlier. Economists had been expecting to see the inflation rate stuck at 3.4%.Japan’s benchmark Nikkei 225 dipped 0.1% in morning trading to 38,831.36. Australia’s S&P/ASX 200 surged 0.5% to 7,751.00. South Korea’s Kospi jumped 1.4% to 2,766.99. Hong Kong’s Hang Seng gained nearly 0.4% to 18,001.18, while the Shanghai Composite declined 0.4% to 3,026.27. Wednesday on Wall Street, the S&P 500 added 0.9% to its all-time high set a day earlier, closing at 5,421.03. The Nasdaq composite also built on its own record and jumped 1.5% to 17,608.44. The Dow Jones Industrial Average lagged the market with a dip of 0.1% to 38,712.21.\n        \n    Smaller companies that need to borrow to grow and can therefore feel the pinch of higher interest rates more than larger rivals led the market. The smaller stocks in the Russell 2000 index jumped 1.6%.For Wall Street, a slowdown in inflation not only helps U.S. households struggling to keep up  with fast-rising prices, it also opens the door for the Federal Reserve to cut its main interest rate. Such a move would ease pressure on the economy and give a boost to investment prices.Everything from bitcoin to gold to copper rallied after the inflation data raised expectations for coming cuts to interest rates. A measure of nervousness among investors in U.S. stocks also eased.Policymakers welcomed the latest update on inflation, but “we’ll need to see more good data to bolster our confidence,” Fed Chair Jerome Powell said. He repeated the Fed’s mantra that it needs an accumulation of data showing inflation is sustainably heading toward its 2% target before it lowers the federal funds rate, which is at the highest level in more than two decades.“We’ll have to see where the data lights the way,” he said, reiterating the Fed’s commitment to moving based on where incoming reports steer it. Lower interest rates could mean easier mortgage rates, helping to inject energy into the housing market. Homebuilder D.R. Horton climbed 3%. Builders FirstSource, which sells vinyl windows, custom millwork and other building materials, jumped 5.3%.Oracle helped lead Wall Street higher with a leap of 13.3% even though it reported weaker profit for the latest quarter than analysts expected. Financial analysts pointed to strong bookings, including contracts related to artificial-intelligence training.A furor around AI has helped send stocks to records despite worries about high interest rates and the slowdown in the economy that they induce. Nvidia  again was the strongest force pushing the S&P 500 higher, with a gain of 3.5%. The chip company has become the poster child of the AI rush, and its total market value has topped $3 trillion.Apple was nearly as strong a force pushing up on the S&P 500 as Nvidia after rising 2.9%. Its stock has been jumping the last two days after getting a cool initial reception to the announcement of several AI-related offerings coming to its operating systems. In energy trading, benchmark U.S. crude lost 27 cents to $78.23 a barrel. Brent crude, the international standard, fell 29 cents to $82.31 a barrel. AP Business Writer Stan Choe contributed.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Asian shares are mostly lower ahead of Fed decision on interest rates", "title_link": "https://apnews.com/article/stock-markets-rates-fed-japan-ab72fb9ea91e2f1464fb49731e2bbe7c", "published_by": "By  ELAINE KURTENBACH", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.People walk in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Wednesday, June 12, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)A person stands in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm on June 12, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)People stand in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Wednesday, June 12, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)The New York Stock Exchange is shown on Tuesday, June 11, 2024. Wall Street stumbled in premarket trading ahead of a busy week of inflation reports and the Federal Reserve’s latest interest rate policy decision. (AP Photo/Peter Morgan)People walk in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Wednesday, June 12, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)People walk in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Wednesday, June 12, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)A person stands in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm on June 12, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)A person stands in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm on June 12, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)People stand in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Wednesday, June 12, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)People stand in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Wednesday, June 12, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)The New York Stock Exchange is shown on Tuesday, June 11, 2024. Wall Street stumbled in premarket trading ahead of a busy week of inflation reports and the Federal Reserve’s latest interest rate policy decision. (AP Photo/Peter Morgan)The New York Stock Exchange is shown on Tuesday, June 11, 2024. Wall Street stumbled in premarket trading ahead of a busy week of inflation reports and the Federal Reserve’s latest interest rate policy decision. (AP Photo/Peter Morgan)BANGKOK (AP) — Shares were mostly lower Wednesday in Asia ahead of a decision by the Federal Reserve on interest rates. In Japan, higher inflation and falling wages raised questions about how the central bank can navigate away from near-zero interest rates. The Bank of Japan will issue a policy decision on Friday. In March, it raised its benchmark rate from minus 0.1% to a range of zero to 0.1%, the first such increase in 17 years. The government reported that producer prices rose 2.4% in May, as the yen’s weakness against the U.S. dollar raises costs for imports of fuel and manufacturing components. At the same time, the latest data show real wages fell in April for the 25th straight month. The worry is that the Bank of Japan will be constrained from raising interest rates out of concern that higher prices will depress consumer spending, hurting the overall economy. Tokyo’s Nikkei 225 index lost 0.6% to 38,899.44. Chinese shares also fell, as the latest inflation data suggested persisting weakness in demand. The Hang Seng index in Hong Kong sank 1.5% to 17,913.10 while the Shanghai Composite index was down less than 1 point to 3,027.41.Australia’s S&P/ASX 200 shed 0.6% to 7,710.90. In Bangkok the SET edged 0.1% lower. Gains in technology shares pushed prices higher in South Korea, where the Kospi rose 0.5% to 2,718.86, and in Taiwan, whose Taiex jumped 1.2%. \n        \n    Trading was subdued on Tuesday on Wall Street ahead of a key inflation report and the Federal Reserve’s policy decision.The S&P 500 rose 0.3% to 5,375.32, driven largely by gains in tech stocks. The tech-heavy Nasdaq composite rose 0.9% to 17,343.55. Both indexes set record highs for the second straight day.Apple surged 7.3% after highlighting its push into artificial intelligence technology. The Dow Jones Industrial Average lagged the market. It slipped 120.62 points, or 0.3%, to 38,747.42.The key events for the market this week come on Wednesday, when the U.S. releases its latest update on inflation at the consumer level and the Federal Reserve announces its latest update on interest rates. The U.S. will also release its latest update on prices at the wholesale level on Thursday.Stocks are stumbling to start the day. More from AP business correspondent Seth Sutel.Wall Street expects the government’s consumer price index to remain unchanged at 3.4% in May. Inflation as measured by CPI is down sharply from its peak at 9.1% in 2022, but it has seemingly stalled around 3%. That has complicated the Fed’s goal of taming inflation back to its target rate of 2%.The Fed has held its main interest rate at its highest level in more than two decades and Wall Street is currently hoping for one or two cuts to that rate this year. Virtually no one expects the Fed to move its main interest rate at its current meeting, which started Tuesday. Policymakers will be publishing their latest forecasts on Wednesday for where they see interest rates and the economy heading.When Fed officials released their last projections in March, they indicated the typical member foresaw roughly three cuts to interest rates in 2024. That projection will almost certainly fall this time around.Data on the economy have come in mixed recently, and traders are hoping for a slowdown that stops short of a recession and is just right in magnitude. The economy has remained resilient with support from a strong jobs market and consumer spending. Consumers are becoming increasingly stressed, especially those with lower incomes, and retailers have been warning investors about the potential impact to earnings and revenue. The U.S. jobs market has been showing some signs of cooling, which could ease inflation but put more stress on consumers.Affirm Holdings climbed 11% on news that the buy now, pay later company will be integrated into Apple Pay.Paramount Global, the media company that owns the Paramount movie studio, CBS as well as several cable networks, dropped 7.8% following reports that talks to merge the company with Skydance Media had fallen apart. In other trading early Wednesday, benchmark U.S. crude oil climbed 44 cents to $78.34 per barrel in electronic trading on the New York Mercantile Exchange. Brent crude, the international standard, was up 36 cents at $82.28 per barrel.The U.S. dollar rose to 157.23 Japanese yen from 157.14 yen. The euro slipped to $1.0738 from $1.0740.AP Business Writer Damian J. Troise contributed.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "As Art Basel opens, buyers confront a ‘cooling’ but still very active market", "title_link": "https://apnews.com/article/art-switzerland-business-trade-nft-7d87ecf3c0dcc4f9ed5c862fad3c9abe", "published_by": "By  JAMES BROOKS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.This year’s Art Basel fair saw curators creating an exhibit that meanders through the streets of Basel, empty stores, operational shops, a hotel, a restaurant, even a brewery, exploring the topics of urban transformation and circulation.The artwork Interieur a La Fougere Noire (1948) by French artist Henri Matisse is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Interieur a La Fougere Noire (1948) by French artist Henri Matisse is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Gouvernails Rouges (1967) by US-American artist Alexander Calder is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Gouvernails Rouges (1967) by US-American artist Alexander Calder is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Paysage (1965) by Spanish artist Pablo Picasso is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Paysage (1965) by Spanish artist Pablo Picasso is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Dresdner Frauen – die Elbe (1990/2023) by German-Austrian artist Georg Baselitz is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Dresdner Frauen – die Elbe (1990/2023) by German-Austrian artist Georg Baselitz is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)A Vessel in a Vessel in a Vessel and So On (2007) by US-American artist William Pope. L is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)A Vessel in a Vessel in a Vessel and So On (2007) by US-American artist William Pope. L is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Hortensia (2024), left, and Donaji (2024), right, by Mexican artist Berenice Olmedo is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Hortensia (2024), left, and Donaji (2024), right, by Mexican artist Berenice Olmedo is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Pumpkin (2018) by Japanese artist Yayoi Kusama is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Pumpkin (2018) by Japanese artist Yayoi Kusama is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Smoker (1975) by US-American artist Tom Wesselmann is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Smoker (1975) by US-American artist Tom Wesselmann is on display at the international art show Art Basel, in Basel, Switzerland, Tuesday, June 11, 2024. (Georgios Kefalas/Keystone via AP)The artwork Zepelin de Acero (2021) by Argentinian artist Julio Le Parc on display at the Art Unlimited exhibition, part of the international art fair Art Basel, in Basel, Switzerland, Monday, June 10, 2024. (Georgios Kefalas/Keystone via AP)The artwork Zepelin de Acero (2021) by Argentinian artist Julio Le Parc on display at the Art Unlimited exhibition, part of the international art fair Art Basel, in Basel, Switzerland, Monday, June 10, 2024. (Georgios Kefalas/Keystone via AP)The artwork The Extended Line (2023-2024) by Japanese artist Chiharu Shiota at the Art Unlimited exhibition, part of the international art fair Art Basel, in Basel, Switzerland, Monday, June 10, 2024. (Georgios Kefalas/Keystone via AP)The artwork The Extended Line (2023-2024) by Japanese artist Chiharu Shiota at the Art Unlimited exhibition, part of the international art fair Art Basel, in Basel, Switzerland, Monday, June 10, 2024. (Georgios Kefalas/Keystone via AP)BASEL, Switzerland (AP) — Multimillion-dollar works by Jean-Michel Basquiat, Yayoi Kusama and Alberto Giacometti went on the market this week as the Art Basel fair opened in Switzerland.Thousands flooded the exhibition center for VIP previews before doors open to public Thursday. Arriving guests strolled through a large plaza filled with stems of wheat resembling a field, a work by conceptual artist Agnes Denes that was first staged in 1982.More than 280 galleries exhibited everything from paintings and sculpture to video installations and performance art.“Art Basel is like the Super Bowl of the art world,” art market expert Magnus Resch said.The Art Market Report 2024, published by Art Basel and Swiss investment bank UBS, found that sales fell by 4% year-on-year in 2023, to an estimated $65 billion, against a backdrop of high interest rates, inflation and political instability.Sales were particularly thinner at the top end of the market.“We’ve seen a bit of a slowdown,” said UBS Global Wealth Management’s chief economist Paul Donovan.Once the buzz of the art world, sales in art-related NFTs — or non-fungible tokens — on NFT platforms outside the art market declined sharply, according to the report, from a peak of $2.9 billion in 2021 to $1.2 billion last year.But there is still enthusiasm. The report found transaction volume grew in 2023 by 4%, driven by sales at lower price levels.\n        \n    “We’re not seeing art sales plunge off the edge of a cliff or anything like that,” Donovan said. “So ‘cooling’ is probably the right way to think about what is happening.”Austrian gallerist Thaddaeus Ropac said that “I think people are now reflecting a bit more, taking a bit of time, but they are still very, very active.”Some dismissed any dour analysis. In an opening day sales report, the president of international gallery Hauser & Wirth, Iwan Wirth, described it as “doom porn” while New York-based Sean Kelly said the market had already turned a corner since last year.“There’s always something to be concerned about. But the market has proven to be extremely resilient,” Kelly said.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "How major US stock indexes fared Thursday, 6/27/2024", "title_link": "https://apnews.com/article/stocks-wall-street-dow-nasdaq-e4c951d8b6b5d579d72be8ab0c096bff", "published_by": "By  THE ASSOCIATED PRESS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.Stocks inched higher on Wall Street as markets wait for a key report on inflation. The S&P 500 edged up 0.1% Thursday. The Nasdaq composite added 0.3%, and the Dow Jones Industrial Average rose 0.1%. Walgreens Boots Alliance sank more than 22% after reporting results that fell shy of forecasts and cutting its outlook. The company said it could close hundreds more stores in the next three years. Treasury yields fell in the bond market. The government releases a closely watched report on inflation on Friday that could influence the Federal Reserve’s next move on interest rates.On Thursday:The S&P 500 rose 4.97 points, or 0.1%, to 5,482.87.The Dow Jones Industrial Average rose 36.26 points, or 0.1%, to 39,164.06.The Nasdaq composite rose 53.53 points, or 0.3%, to 17,858.68.The Russell 2000 index of smaller companies rose 20.22 points, or 1%, to 2,038.34.For the week:The S&P 500 is up 18.25 points, or 0.3%.The Dow is up 13.73 points, or less than 0.1%.The Nasdaq is up 169.32 points, or 1%.The Russell 2000 is up 16.31 points, or 0.8%.For the year:The S&P 500 is up 713.04 points, or 14.9%.The Dow is up 1,474.52 points, or 3.9%.The Nasdaq is up 2,847.33 points, or 19%.The Russell 2000 is up 11.27 points, or 0.6%.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "How major US stock indexes fared Thursday, 6/13/2024", "title_link": "https://apnews.com/article/wall-street-stocks-dow-nasdaq-9d7ffce92ed7aa16d66caa0a8a3386bd", "published_by": "By  THE ASSOCIATED PRESS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.Most U.S. stocks fell, but hopes for coming cuts to interest rates and Wall Street’s continued frenzy around artificial-intelligence technology sent indexes to more record highs.The S&P 500 rose 0.2% Thursday after a day of drifting between shallow gains and losses, beating the all-time high it set the day before. The Nasdaq composite climbed 0.3%, also setting another record. The Dow Jones Industrial Average fell 0.2%. Technology company Broadcom soared 12.3%. Treasury yields eased again in the bond market as conviction built that inflation is slowing enough to get the Federal Reserve to cut interest rates later this year.On Thursday:The S&P 500 rose 12.71 points, or 0.2%, to 5,433.74.The Dow Jones Industrial Average fell 65.11 points, or 0.2%, to 38,647.10.The Nasdaq composite rose 59.12 points, or 0.3%, to 17,667.56.The Russell 2000 index of smaller companies fell 18.19 points, or 0.9%, to 2,038.91.For the week:The S&P 500 is up 86.75 points, or 1.6%.The Dow is down 151.89 points, or 0.4%.The Nasdaq is up 534.43 points, or 3.1%.The Russell 2000 is up 12.36 points, or 0.6%.For the year:The S&P 500 is up 663.91 points, or 13.9%.The Dow is up 957.56 points, or 2.5%.The Nasdaq is up 2,656.21 points, or 17.7%.The Russell 2000 is up 11.84 points, or 0.6%.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Asian shares mixed after AI hopes nudge Wall St to records. BOJ stands pat", "title_link": "https://apnews.com/article/stock-markets-fed-rates-inflation-7522fb1fa0455d5a0614d7acf4cb6761", "published_by": "By  YURI KAGEYAMA", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.FILE - People move past an electronic stock board showing Japan’s stock prices outside a securities firm in Tokyo, June 7, 2024. Asian shares were mixed in muted trading Friday, June 14, after Wall Street’s continued frenzy around artificial-intelligence technology nudged indexes on Wall Street to more records.(AP Photo/Shuji Kajiyama, File)FILE - Currency traders watch computer monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, the Korean Securities Dealers Automated Quotations (KOSDAQ) and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, on May 31, 2024. Asian shares were mixed in muted trading Friday, June 14, 2024, after Wall Street’s continued frenzy around artificial-intelligence technology nudged indexes on Wall Street to more records.(AP Photo/Lee Jin-man, File)FILE - The New York Stock Exchange is shown on June 12, 2024 in New York. European shares are lower and Asian shares ended mixed on Thursday, June 13, 2024, after the Federal Reserve opted to keep its benchmark interest rate unchanged. (AP Photo/Peter Morgan)FILE - People move past an electronic stock board showing Japan’s stock prices outside a securities firm in Tokyo, June 7, 2024. Asian shares were mixed in muted trading Friday, June 14, after Wall Street’s continued frenzy around artificial-intelligence technology nudged indexes on Wall Street to more records.(AP Photo/Shuji Kajiyama, File)FILE - People move past an electronic stock board showing Japan’s stock prices outside a securities firm in Tokyo, June 7, 2024. Asian shares were mixed in muted trading Friday, June 14, after Wall Street’s continued frenzy around artificial-intelligence technology nudged indexes on Wall Street to more records.(AP Photo/Shuji Kajiyama, File)FILE - Currency traders watch computer monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, the Korean Securities Dealers Automated Quotations (KOSDAQ) and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, on May 31, 2024. Asian shares were mixed in muted trading Friday, June 14, 2024, after Wall Street’s continued frenzy around artificial-intelligence technology nudged indexes on Wall Street to more records.(AP Photo/Lee Jin-man, File)FILE - Currency traders watch computer monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, the Korean Securities Dealers Automated Quotations (KOSDAQ) and the foreign exchange rate between U.S. dollar and South Korean won at a foreign exchange dealing room in Seoul, South Korea, on May 31, 2024. Asian shares were mixed in muted trading Friday, June 14, 2024, after Wall Street’s continued frenzy around artificial-intelligence technology nudged indexes on Wall Street to more records.(AP Photo/Lee Jin-man, File)FILE - The New York Stock Exchange is shown on June 12, 2024 in New York. European shares are lower and Asian shares ended mixed on Thursday, June 13, 2024, after the Federal Reserve opted to keep its benchmark interest rate unchanged. (AP Photo/Peter Morgan)FILE - The New York Stock Exchange is shown on June 12, 2024 in New York. European shares are lower and Asian shares ended mixed on Thursday, June 13, 2024, after the Federal Reserve opted to keep its benchmark interest rate unchanged. (AP Photo/Peter Morgan)TOKYO (AP) — Asian shares were mixed in muted trading Friday after Wall Street’s continued frenzy around artificial-intelligence technology nudged indexes on Wall Street to more records.Japan’s benchmark Nikkei 225 jumped 0.7% to 38,998.04 after the Bank of Japan kept its monetary policy intact, though it did say it intends to begin reducing its government bond purchases as it eases itself out of its ultra-lax stance. “Even if the BOJ wants to convey that the direction of travel is for tightening, the key guiding principle is gradualism,” Tan Jing Yi at Mizuho Bank said in a commentary. Australia’s S&P/ASX 200 fell 0.3% to 7,723.30. South Korea’s Kospi edged up 0.1% to 2,758.21. Hong Kong’s Hang Seng slipped 0.7% to 17,988.24, while the Shanghai Composite fell 0.2% to3,021.88. On Thursday, the S&P 500 added 0.2% to its all-time high set the day before, closing at 5,433.74, even though the majority of its stocks weakened. The Nasdaq composite climbed 0.3% from its own record, ending at 17,667.56, thanks to gains for technology stocks.The Dow Jones Industrial Average fell 0.2% to 38,647.10.Treasury yields eased again in the bond market as traders grew convinced that inflation is slowing enough to get the Federal Reserve to cut interest rates later this year.The latest update on inflation showed prices paid at the wholesale level weren’t as bad as economists expected. They actually dropped from April into May, when economists were forecasting a rise.Wall Street is hovering in record territory. The AP’s Seth Sutel has more. \n        \n    That followed a surprising update from Wednesday that showed inflation at the consumer level was lower than expected. Federal Reserve Chair Jerome Powell called that report encouraging and said policymakers need more such data before lowering their main interest rate from the most punishing level in two decades.“It’s a question of when they cut, not if,” said Niladri “Neel” Mukherjee, chief investment officer of TIAA Wealth Management. High interest rates have been dragging on some parts of the economy, particularly manufacturing. A separate report on Thursday showed more U.S. workers filed for unemployment benefits last week than economists expected, though the number is still low relative to history.The hope on Wall Street is that growth for the job market and economy continues to slow in order to take pressure off inflation, but not so much that it creates a deep recession.Companies whose profits are most closely tied to the strength of the economy lagged the market Thursday following the reports, such as oil-and-gas producers and industrial companies.Dave & Buster’s Entertainment sank 10.9% after reporting worse drops in profit and revenue for the latest quarter than analysts expected, citing a “complex macroeconomic environment” among other reasons. Other companies have recently been detailing a split among their customers, where lower-income households are struggling  to keep up with still-high inflation.Some companies have been able to skyrocket regardless of the pressures on the economy because of an ongoing frenzy around artificial-intelligence technology.Broadcom jumped 12.3% after the semiconductor company reported stronger profit for the latest quarter than analysts expected, aided once again by AI demand. It also raised its forecast for revenue this year.Tesla rose 2.9% after CEO Elon Musk said early voting results indicated shareholders were leaning toward approving his pay package. Without it, Musk had threatened to take AI research to one of his other companies.In the bond market, the yield on the 10-year Treasury fell to 4.24% from 4.32% late Wednesday and from 4.60% late last month. The two-year yield, which moves more on expectations for the Fed, fell to 4.69% from 4.76%.Most Fed officials are penciling in either one or two cuts to interest rates this year, and traders are hopeful they can begin as soon as September. In other dealings, benchmark U.S. crude shed 44 cents to $78.18 a barrel in electronic trading on the New York Mercantile Exchange. Brent crude, the international standard, lost 36 cents to $82.39 a barrel. The U.S. dollar rose to 157.82 Japanese yen from 157.02 yen. The euro cost $1.0742, little changed from $1.0739. AP Business Writer Stan Choe contributed.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Global stocks are mixed after Wall Street edges to more records", "title_link": "https://apnews.com/article/stock-markets-rates-inflation-258ffe886a3369fb5eaf3ca7659bc032", "published_by": "By  ZIMO ZHONG", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.Currency traders pass by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)The New York Stock Exchange is shown on Tuesday, June 18, 2024 in New York. Shares are mostly higher in Europe and Asia after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Peter Morgan)Currency traders pass by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)Currency traders pass by the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI), left, and the foreign exchange rate between U.S. dollar and South Korean won at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 19, 2024. (AP Photo/Ahn Young-joon)The New York Stock Exchange is shown on Tuesday, June 18, 2024 in New York. Shares are mostly higher in Europe and Asia after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Peter Morgan)The New York Stock Exchange is shown on Tuesday, June 18, 2024 in New York. Shares are mostly higher in Europe and Asia after U.S. stocks rallied to more records, with gains for technology companies pushing the benchmarks higher. (AP Photo/Peter Morgan)HONG KONG (AP) — World stocks were mixed on Wednesday after U.S. benchmarks ticked to more records following the latest signs that the U.S. economy may be slowing without falling into recession.The future for the Dow Jones Industrial Average was down 0.1% while that for the S&P 500 rose 0.1%. U.S. markets are closed on Wednesday in observance of Juneteenth.European equity markets opened lower. In London, the FTSE 100 lost 0.2% to 8,177.86 after data showed that British inflation fell to the central bank’s 2% target for the first time in nearly three years. The data also backed the market’s expectation that the Bank of England would hold the rate at 5.25% in the coming meeting on Thursday.Germany’s DAX slipped 0.1% to 18,109.65, while the CAC 40 in Paris shed 0.2% to 7,615.76. Tokyo’s Nikkei 225 index climbed 0.2% to 38,570.76 as Japan’s trade data for May showed exports rose 13.5% while imports were up 9.5% from a year earlier, pushed higher by rising prices and the weaker value of the yen against the U.S. dollar. Minutes from the Bank of Japan’s latest policy meeting showed a debate among its decision makers over whether the yen’s weakness may push inflation still higher. Governor Kazuo Ueda has hinted at raising the benchmark interest rate in coming months, depending on economic data at the time.“Moves in the Nikkei have reflected much indecision in place, with the index trading in a broad consolidation phase thus far,” IG Asia said in a commentary.\n        \n    The Hang Seng in Hong Kong added 2.9% to 18,430.39, while the Shanghai Composite index lost 0.4% to 3,018.05 after the head of China’s securities watchdog said at a financial forum in Shanghai that the agency would be enhancing oversight of all financial activities to prevent potential risks.In Sydney, the S&P/ASX 200 edged 0.1% lower to 7,769.70. South Korea’s Kospi surged 1.2% to 2,797.33. Elsewhere, Taiwan’s Taiex gained 2%, while Bangkok’s SET fell 1%.On Tuesday, the S&P 500 added 0.3% to 5,487.03, setting an all-time high for the 31st time this year. The Nasdaq composite edged up by less than 0.1% to 17,862.23. The Dow Jones Industrial Average gained 0.2% to 38,834.86. Nvidia once again was the star, gaining 3.5% and acting as the strongest force pushing the S&P 500 upward. It lifted its total market value further above $3 trillion, again. The Commerce Department reported that retail sales rose 0.1% in May, below the pace that economists projected, while April sales were revised downward — a 0.2% decline, from unchanged. That might signal that the main engine of the U.S. economy, spending by households, is cracking. Inflation is still high, even if it’s slowed since its peak, and lower-income households  in particular are struggling to keep up with higher prices. In other dealings Wednesday, U.S. benchmark crude oil gave up 15 cents to $80.56 per barrel in electronic trading on the New York Mercantile Exchange.Brent crude lost 17 cents to $85.16 per barrel.The dollar fell to 157.76 Japanese yen from 157.87 yen. The euro slipped to $1.0736 from $1.0738. Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Asian shares mostly decline as Nvidia weighs on Wall Street", "title_link": "https://apnews.com/article/stock-markets-rates-inflation-e07666093f7862aadcdecbf5c6ad97a6", "published_by": "By  YURI KAGEYAMA", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.People walk in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Friday, June 21, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)People stand in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Friday, June 21, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)A person walks in front of an electronic stock board showing Japan’s Nikkei and New York Dow indexes at a securities firm Friday, June 21, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)FILE - The New York Stock Exchange is shown on June 18, 2024 in New York. European markets have opened higher on Thursday, June 20, 2024, after a mixed day of trading in Asia. Trading was thin after U.S. markets were closed in observance of Juneteenth. (AP Photo/Peter Morgan, File)People walk in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Friday, June 21, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)People walk in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Friday, June 21, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)People stand in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Friday, June 21, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)People stand in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Friday, June 21, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)A person walks in front of an electronic stock board showing Japan’s Nikkei and New York Dow indexes at a securities firm Friday, June 21, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)A person walks in front of an electronic stock board showing Japan’s Nikkei and New York Dow indexes at a securities firm Friday, June 21, 2024, in Tokyo. (AP Photo/Eugene Hoshiko)FILE - The New York Stock Exchange is shown on June 18, 2024 in New York. European markets have opened higher on Thursday, June 20, 2024, after a mixed day of trading in Asia. Trading was thin after U.S. markets were closed in observance of Juneteenth. (AP Photo/Peter Morgan, File)FILE - The New York Stock Exchange is shown on June 18, 2024 in New York. European markets have opened higher on Thursday, June 20, 2024, after a mixed day of trading in Asia. Trading was thin after U.S. markets were closed in observance of Juneteenth. (AP Photo/Peter Morgan, File)TOKYO (AP) — Asian shares were mostly lower Friday after a retreat on Wall Street, where a drop in Nvidia stock pulled stocks lower. Japan’s benchmark Nikkei 225 edged up less than 0.1% to 38,645.63 after the government reported that the inflation rate ticked higher for the first time in three months, to 2.5% in May, up from 2.2% in April.“We will have one more month of data before the next Bank of Japan meeting, which will be on close watch to determine if markets are getting ahead of themselves by leaning towards a potential rate hike in September this year,” said Yeap Jun Rong, market analyst at IG. Australia’s S&P/ASX 200 rose 0.1% to 7,780.40. South Korea’s Kospi lost 0.9% to 2,782.43. Hong Kong’s Hang Seng dropped 1.7% to 18,022.42, while the Shanghai Composite slipped nearly 0.4% to 2,993.57. Thursday on Wall Street, the S&P 500 dropped 0.3% from an all-time high set before trading paused for Wednesday’s Juneteenth holiday. It closed at 5,473.17.The Nasdaq composite pulled back from its record, slipping 0.8% to 17,721.59. The Dow Jones Industrial Average beat the market with a gain of 0.8% to 39,134.76.Nvidia gave up an early gain and swung to a loss of 3.5% to put at risk an eight-week winning streak. The chip company has been the main beneficiary of Wall Street’s frenzy around artificial-intelligence technology. On Tuesday, it supplanted Microsoft to become the most valuable company in the market. Nvidia’s stumble ceded the top spot back to Microsoft. \n        \n    Nvidia’s chips are helping to power the move into AI, which proponents see producing explosive growth in productivity and profits, and it’s already up 164% this year after more than tripling last year.AP correspondent Seth Sutel reports stocks opening on a high note.In a show of how powerful AI can be, Accenture rose 7.3% even though the consulting and professional-services company reported weaker profit and revenue for the latest quarter than expected. In its earnings report, it highlighted how it won over $900 million in new bookings for generative AI to bring the total for its last three quarters to $2 billion.Besides raising worries about a potential bubble where investors’ excitement is getting excessive, the eye-popping gains for Nvidia and other AI winners have helped prop up the stock market despite some weakness in the U.S. economy. High interest rates meant to grind down inflation have hurt the housing market and manufacturing, while lower-income households  are showing signs of struggling to keep up with still-rising prices.In the bond market, Treasury yields ticked higher following a spate of mixed reports on the economy. The number of U.S. workers filing for unemployment benefits eased last week, but not by as much as economists expected. A separate report said manufacturing in the mid-Atlantic is growing, but not as quickly as economists thought. Home builders, meanwhile, broke ground on fewer new homes last month than expected.A slowdown in the U.S. economy could help tamp down inflationary pressures and convince the Federal Reserve to cut  its main interest rate later this year. That would would release pressure on the economy and boost investment prices.Fed officials have indicated they could cut their main interest rate once or twice this year, down from its highest level in more than 20 years. Many traders on Wall Street, meanwhile, are expecting two or more cuts, according to data from CME Group. The yield on the 10-year Treasury climbed to 4.25% from 4.22% late Tuesday. The two-year yield, which more closely tracks expectations for the Fed, rose to 4.73% from 4.71%.In energy trading, benchmark U.S. crude dropped 11 cents to $81.18 per barrel in electronic trading on the New York Mercantile Exchange. Brent crude, the international standard, fell 13 cents to $85.58 a barrel. In currency trading, the U.S. dollar cost 158.90 Japanese yen, little changed from 158.92 yen. The euro cost $1.0715, up from $1.0702. AP Business Writer Stan Choe contributed.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Wall Street coasts to the close of another winning week as Nvidia cools again", "title_link": "https://apnews.com/article/stock-markets-rates-inflation-nvidia-aaecb08ba11af68113d24e030aa212f8", "published_by": "By  STAN CHOE", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.FILE - A sign at the New York Stock Exchange is shown on June 18, 2024 in New York. Global shares are mostly lower on Friday, June 21, 2024, after a retreat on Wall Street, where a drop in Nvidia stock pulled stocks lower. (AP Photo/Peter Morgan, File)NEW YORK (AP) — U.S. stocks coasted to the close of their latest winning week on Friday, as Nvidia ’s stock continued to cool from its startling, supernova run.The S&P 500 slipped 0.2%, but it remained close to its all-time high set on Tuesday and capped its eighth winning week in the last nine. The Dow Jones Industrial Average edged up by 15 points, or less than 0.1%, while the Nasdaq composite dropped 0.2%.Nvidia again dragged on the market after falling 3.2%. The company’s stock has soared more than 1,000% since October 2022 on frenzied demand for its chips, which are powering much of the world’s move into artificial-intelligence technology, and it briefly supplanted Microsoft this week as the most valuable company on Wall Street.But nothing goes up forever, and Nvidia’s drops the last two days sent its stock to its first losing week in the last nine.AP correspondent Seth Sutel has the AP Markets in a Minute report for the final day of the trading week.Much of the rest of Wall Street was relatively quiet, outside a few outliers. Sarepta Therapeutics jumped 30.1% after U.S. regulators approved the use of its medicine for children with Duchenne muscular dystrophy who are at least 4.Gun maker Smith & Wesson Brands tumbled 12.9% despite reporting stronger profit for the latest quarter than analysts expected. The summer is traditionally a slower season for firearms, according to CEO Mark Smith.Shares of Trump Media & Technology Group rallied back from an early loss and rose 3.4% to trim its loss for the week to 25.3%. The company behind Donald Trump’s Truth Social platform had seen its stock nearly halve since the conviction of the former president  in late May on charges in a scheme to illegally influence the 2016 election through a hush money payment to a porn actor who said the two had sex.\n        \n    All told, the S&P 500 dipped 8.55 points to 5,464.62. The Dow Jones Industrial Average rose 15.57 to 39,150.33, and the Nasdaq composite dropped 32.23 to 17,689.36.In the bond market, U.S. Treasury yields initially fell after a report suggested business activity among countries that use the euro currency is weaker than economists expected. Concerns are already high for the continent ahead of a French election that could further rattle financial markets. The weak business-activity report dragged down yields in Europe, which at first pressured Treasury yields. But U.S. yields recovered much of those losses after another report said later in the morning that U.S. business activity may be stronger than thought.Overall output growth hit a 26-month high, according to S&P Global’s preliminary reading of activity among U.S. manufacturing and services businesses. Perhaps more importantly for Wall Street, that strength may be happening without a concurrent rise in pressure on inflation. “Historical comparisons indicate that the latest decline brings the survey’s price gauge into line with the Fed’s 2% inflation target,” according to Chris Williamson, chief business economist at S&P Global Market Intelligence.The Federal Reserve is in a precarious spot, where it’s trying to slow the economy through high interest rates by just enough to get high inflation back down to 2%. The trick is that it wants to cut interest rates  at the exact right time. If it waits too long, the economy’s slowdown could careen into a recession. If it’s too early, inflation could reaccelerate. Hope still reigns among traders that the Fed can pull it off, and many are forecasting at least two cuts to interest rates later this year, according to data from CME Group. Of course, their predictions have regularly proven to be overly optimistic through history. Fed officials themselves have penciled in one or two cuts in 2024 to their main interest rate, which has been sitting at its highest level in more than two decades. The economy is still growing, though it has slowed recently under the weight of high rates. Housing  and manufacturing have been hurt in particular, while lower-income households are struggling  to keep up with still-rising prices. The yield on the 10-year Treasury edged down to 4.25% from 4.26% late Thursday. The yield on the two-year Treasury, which more closely tracks expectations for Fed action, dipped to 4.73% from 4.74%.In stock markets abroad, European stocks fell after the weak continental economic reports, and many Asian indexes were also lower. Hong Kong’s Hang Seng dropped 1.7%, and South Korea’s Kospi fell 0.8%.AP Business Writers Yuri Kageyama and Alex Veiga contributed.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Nvidia is losing momentum in the stock market", "title_link": "https://apnews.com/article/stock-markets-rates-inflation-nvidia-d1929dc0374008964d26d6a380d9c267", "published_by": "By  ZIMO ZHONG", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.FILE - The New York Stock Exchange is shown on June 11, 2024 in New York. European markets have opened with gains on Monday, June 24, 2024, and Asian benchmarks retreated after U.S. stocks coasted to the close of their latest winning week. (AP Photo/Peter Morgan, File)HONG KONG (AP) — Asian stocks rose Tuesday after another slide for Wall Street heavyweight Nvidia kept U.S. indexes mixed Monday, even as the majority of stocks rallied.U.S. futures were higher while oil prices were little changed.Japan’s benchmark Nikkei 225 added 0.5% to 39,001.39 after data from the Bank of Japan Tuesday showed the services producer price index in May was up 2.5% compared to the same period last year, a slowdown from the 2.7% increase seen in April.The Japanese yen remains a focus of attention, with the US dollar to Japanese yen exchange rate still trading near its weakest level in approximately 34 years. The yen rose to 159.37 to the dollar in Tuesday morning trading. The dollar closed at 159.59 yen on Monday. The Hang Seng in Hong Kong was 0.5% higher to 18,121.78 and the Shanghai Composite index dipped 0.3% to 2,954.51.Australia’s S&P/ASX 200 gained 0.9% to 7,799.20. In South Korea, the Kospi climbed 0.5% to 2,777.69.Elsewhere, Taiwan’s Taiex lost 0.3%, while the SET in Bangkok edged 0.1% higher.The S&P 500 slipped 0.3% to 5,447.87. The drops for Nvidia and other winners of Wall Street’s artificial intelligence boom pulled the Nasdaq composite down 1.1% to 17,496.82, while the Dow Jones Industrial Average rose 0.7% to 39,411.21.Stocks of oil and gas companies were among the market’s strongest, as seven out of every 10 stocks in the S&P 500 rose. Exxon Mobil climbed 3%, and oilfield services provider SLB gained 4% as oil prices hung near their highest levels since April.\n        \n    Financial companies were also strong. JPMorgan Chase added 1.3%, and Wells Fargo climbed 1.6% ahead of results coming later in the week for tests by the Federal Reserve of how big banks would fare in a recession.But declines for a handful of high-profile stocks offset all of those gains, and the spotlight shone brightest on Nvidia’s 6.7% tumble. It was a third straight drop for the chip company, which had rocketed 1,000% higher since the autumn of 2022. The nearly insatiable demand for Nvidia’s chips to power artificial intelligence applications has been a big reason for the U.S. stock market’s record runs recently, even as the economy’s growth slows under the weight of high interest rates. But the AI boom has been so frenzied that it’s raised worries about a possible bubble in the stock market and too-high expectations among investors. Markets are moving again toward records. Here’s more from AP business correspondent Seth Sutel. Nvidia’s stock has been receding since it briefly overtook Microsoft as Wall Street’s most valuable last week, and it’s down nearly 13% in just three days. Because Nvidia has become so massive in size, the movements for its stock carry extra weight  on the S&P 500 and other indexes. It was the heaviest weight by far on the S&P 500 Monday.Other AI beneficiaries also gave up some of their fantastic gains. Super Micro Computer dropped 8.6% to shave its gain for the year so far back below 200%, down to 190.9%. Such a rotation among stocks could be a healthy sign for the market, as long as it can stay close to its records. Market watchers have been worried to see just Nvidia and a handful of other companies responsible for much of the S&P 500’s returns recently. They would prefer a market where many stocks are participating in the gains. In the bond market, Treasury yields eased a bit. The yield on the 10-year Treasury fell to 4.23% from 4.26% late Friday.It’s been mostly falling since topping 4.70% in late April, which has relaxed the pressure on the stock market. Yields have sunk on hopes that inflation is slowing enough to convince the Federal Reserve to cut its main interest rate  later this year.The Fed has been keeping the federal funds rate at the highest level in more than 20 years, hoping to grind down on the economy just enough to get inflation  under control.In other dealings Tuesday, U.S. benchmark crude oil gave up 1 cent to $81.62 per barrel in electronic trading on the New York Mercantile Exchange.Brent crude lost 2 cents to $85.13 per barrel.The euro rose to $1.0736 from $1.0732. Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "How major US stock indexes fared Monday, 6/24/2024", "title_link": "https://apnews.com/article/wall-street-stocks-dow-nasdaq-1cf853366f3cf8df1e41c648b49ec9ce", "published_by": "By  THE ASSOCIATED PRESS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.Another slide for Wall Street heavyweight Nvidia kept U.S. indexes mixed, even as the majority of stocks rallied. The S&P 500 slipped 0.3% Monday. The Dow Jones Industrial Average rose 0.7%, and the Nasdaq composite fell 1.1%. Stocks of oil-and-gas and financial companies had some of the market’s biggest gains, as seven out of every 10 stocks in the S&P 500 rose. But declines for a handful of winners from Wall Street’s frenzy around AI offset all of those gains, and the spotlight shone brightest on Nvidia’s third straight drop. Treasury yields fell slightly. The yield on the 10-year Treasury note slipped to 4.23%.On Monday:The S&P 500 fell 16.75 points, or 0.3%, to 5,447.87.The Dow Jones Industrial Average rose 260.88 points, or 0.7%, to 39,411.21.The Nasdaq composite fell 192.54 points, or 1.1%, to 17,496.82.The Russell 2000 index of smaller companies rose 8.78 points, or 0.4%, to 2,030.81.For the year:The S&P 500 is up 678.04 points, or 14.2%.The Dow is up 1,721.67 points, or 4.6%.The Nasdaq is up 2,485.47 points, or 16.6%.The Russell 2000 is up 3.74 points, or 0.2%.Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Asian shares falter after Nvidia rebound supports Wall St", "title_link": "https://apnews.com/article/asia-finance-markets-stocks-commodities-business-022fe08480fcbb6991bcd40152b594c5", "published_by": "By  ELAINE KURTENBACH", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.A currency trader passes under the screen showing the Korea Composite Stock Price Index (KOSPI), top left, and the foreign exchange rate between U.S. dollar and South Korean won, top center, at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 26, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI) at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 26, 2024. (AP Photo/Ahn Young-joon)Currency traders work near the screen showing the Korea Composite Stock Price Index (KOSPI), top left, and the foreign exchange rate between U.S. dollar and South Korean won, top right, at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 26, 2024. (AP Photo/Ahn Young-joon)The New York Stock Exchange is shown on Tuesday, June 25, 2024 in New York. World stocks are mixed after another slide for Wall Street heavyweight Nvidia kept U.S. indexes mixed Monday, even as the majority of stocks rallied. (AP Photo/Peter Morgan)A currency trader passes under the screen showing the Korea Composite Stock Price Index (KOSPI), top left, and the foreign exchange rate between U.S. dollar and South Korean won, top center, at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 26, 2024. (AP Photo/Ahn Young-joon)A currency trader passes under the screen showing the Korea Composite Stock Price Index (KOSPI), top left, and the foreign exchange rate between U.S. dollar and South Korean won, top center, at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 26, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI) at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 26, 2024. (AP Photo/Ahn Young-joon)Currency traders watch monitors near the screen showing the Korea Composite Stock Price Index (KOSPI) at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 26, 2024. (AP Photo/Ahn Young-joon)Currency traders work near the screen showing the Korea Composite Stock Price Index (KOSPI), top left, and the foreign exchange rate between U.S. dollar and South Korean won, top right, at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 26, 2024. (AP Photo/Ahn Young-joon)Currency traders work near the screen showing the Korea Composite Stock Price Index (KOSPI), top left, and the foreign exchange rate between U.S. dollar and South Korean won, top right, at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Wednesday, June 26, 2024. (AP Photo/Ahn Young-joon)The New York Stock Exchange is shown on Tuesday, June 25, 2024 in New York. World stocks are mixed after another slide for Wall Street heavyweight Nvidia kept U.S. indexes mixed Monday, even as the majority of stocks rallied. (AP Photo/Peter Morgan)The New York Stock Exchange is shown on Tuesday, June 25, 2024 in New York. World stocks are mixed after another slide for Wall Street heavyweight Nvidia kept U.S. indexes mixed Monday, even as the majority of stocks rallied. (AP Photo/Peter Morgan)BANGKOK (AP) — Asian shares are mixed after a rebound for Nvidia propped up a weakened Wall Street. Japan’s Nikkei jumped 1.4% to 39,726.39, buoyed by strong demand for technology shares driven by the enthusiasm over Nvidia and artificial intelligence. Tokyo Electron gained 3.2% and Advantest Corp. soared 6.6%. Shin-Etsu Chemical Co. added 1.3%. The Kospi in Seoul was up 0.2% at 2,781.15. Chinese shares retreated. Hong Kong’s Hang Seng edged 0.1% lower to 18,052.55 and the Shanghai Composite index slipped 0.5% to 2,936.71. Australia’s S&P/ASX 200 declined 0.9% to 7,765.40. Shares rose in Taiwan and India and edged higher in Thailand. On Tuesday, the S&P 500 rose 0.4% and neared its all-time high set a week earlier, closing at 5,469.30. The Dow Jones Industrial Average, which does not include Nvidia, dropped 0.8% to 39,112.16, and the Nasdaq composite jumped 1.3% to 17,717.65.Most stocks outside Wall Street’s frenzy around artificial-intelligence technology fell. Nvidia climbed 6.8%, and without that gain, the S&P 500 would have dropped to a loss for the day. The chip company’s shares snapped a three-day losing streak where they had shed nearly 13% for their worst such stretch since 2022. Nvidia has the power to swing the S&P 500 around because it’s grown to become one of Wall Street’s largest and most influential companies.Voracious demand for its chips to power artificial-intelligence applications has been a big reason for the U.S. stock market’s run to records recently, even as the economy’s growth slows under the weight of high interest rates. But the AI boom has been so frenzied that it’s raised worries about a possible bubble in the stock market and too-high expectations among investors. AI is giving Wall Street an early boost. More from AP’s Seth Sutel. \n        \n    SolarEdge Technologies dropped 20.6% after it said a customer that owes it $11.4 million filed for Chapter 7 bankruptcy, which raises questions about how much the solar-power company can collect and when. The smaller companies in the Russell 2000 index also fell 0.4%. Broadly, sales at retailers across the country have been up and down recently as companies highlight how lower-income customers are struggling  to keep up with still-rising prices. The job market, though, still looks mostly solid. A report on Tuesday also showed confidence among U.S. consumers fell this month, but not by quite as much as economists expected.Upper-income households seem to be doing better, and they’re booking trips on cruise ships. Carnival steamed 8.7% higher after it raised its profit forecast for 2024. The cruise company said bookings for the rest of the year are the best on record in terms of both price and occupancy. And bookings for next year may end up even better. All told, the S&P 500 rose 21.43 points to 5,469.30. The Dow dropped 299.05 to 39,112.16, and the Nasdaq composite jumped 220.84 to 17,717.65.It’s been mostly falling since topping 4.70% in late April, which has relaxed the pressure on the stock market. Yields have sunk on hopes that inflation is slowing enough to convince the Federal Reserve to cut its main interest rate  later this year.The Fed has been keeping the federal funds rate at the highest level in more than 20 years, hoping to grind down on the economy just enough to get inflation  under control. The hope on Wall Street is that the Fed will cut interest rates at the exact right time. If it waits too long, the economy’s slowdown could careen into a recession. If it’s too early, inflation could reaccelerate. In other dealings early Wednesday, U.S. benchmark crude oil picked up 29 cents to $81.12 per barrel in electronic trading on the New York Mercantile Exchange. Brent crude, the international standard, was up 31 cents at $85.32 per barrel.The dollar rose to 159.79 Japanese yen from 159.63 yen. The euro was nearly unchanged at $1.0715. AP Business Writer Stan Choe contributed. Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "Stock market today: Asian shares are mostly lower ahead of key US inflation report", "title_link": "https://apnews.com/article/stock-markets-rates-yen-nvidia-b6efb00d88619583757d0ef17b2a68d3", "published_by": "By  ELAINE KURTENBACH", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.The Fearless Girl statue stands in front of the New York Stock Exchange on Wednesday, June 26, 2024 in New York. Shares have advanced in Europe and Asia after a rebound for Nvidia offset weakness on Wall Street. (AP Photo/Peter Morgan)Workers wait to cross a street in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A person walks past at an electronic stock board showing financial indexes including Japan’s Nikkei 225 index, green, at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A person walks past at an electronic stock board showing Japan’s stock prices at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A person walks past an electronic stock board showing the exchange rate of U.S. dollar and Japanese yen at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A passerby looks at an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)The Fearless Girl statue stands in front of the New York Stock Exchange on Wednesday, June 26, 2024 in New York. Shares have advanced in Europe and Asia after a rebound for Nvidia offset weakness on Wall Street. (AP Photo/Peter Morgan)The Fearless Girl statue stands in front of the New York Stock Exchange on Wednesday, June 26, 2024 in New York. Shares have advanced in Europe and Asia after a rebound for Nvidia offset weakness on Wall Street. (AP Photo/Peter Morgan)Workers wait to cross a street in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)Workers wait to cross a street in front of an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A person walks past at an electronic stock board showing financial indexes including Japan’s Nikkei 225 index, green, at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A person walks past at an electronic stock board showing financial indexes including Japan’s Nikkei 225 index, green, at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A person walks past at an electronic stock board showing Japan’s stock prices at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A person walks past at an electronic stock board showing Japan’s stock prices at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A person walks past an electronic stock board showing the exchange rate of U.S. dollar and Japanese yen at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A person walks past an electronic stock board showing the exchange rate of U.S. dollar and Japanese yen at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A passerby looks at an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)A passerby looks at an electronic stock board showing Japan’s Nikkei 225 index at a securities firm Thursday, June 27, 2024 in Tokyo. (AP Photo/Shuji Kajiyama)BANGKOK (AP) — Shares fell Thursday in most Asian markets ahead of a key U.S. inflation report due Friday that might point the way ahead for interest rates. Benchmarks fell more than 1% in Tokyo, Hong Kong and Sydney. Oil prices and U.S. futures also declined. The markets’ big focus this week is on a U.S. government inflation report due Friday. The personal consumption expenditures index, or PCE, is the Federal Reserve’s preferred measure of inflation, and analysts said investors were in a wait-and-see posture after recent mixed data. The latest updates on inflation could influence the central bank’s decision on when to begin cutting interest rates, which remain at their highest level in more than 20 years and which are having an impact worldwide. In Asian trading, another set of measures to boost the Chinese property market failed to lift market sentiment. Hong Kong’s Hang Seng fell 1.9% to 17,746.53, while the Shanghai composite index was down 0.5%. The latest move was by Beijing, one of China’s biggest cities, when China’s capital cut minimum down-payment ratios and mortgage interest rates, beginning Thursday.Markets are moving away from recent records, as reported by the AP’s Seth Sutel. Other Chinese cities have taken similar measures in line with national policies aimed at enticing buyers back into a market that has languished since the government cracked down on excessive borrowing by property developers, causing dozens of such companies to default on their debts. The downturn has dragged on the entire economy, the world’s second largest. \n        \n    In Tokyo, the Nikkei 225 index was down 1% at 39,286.97 amid concern over further weakness in the Japanese yen.The U.S. dollar was trading at 160.43 yen early Thursday, having punched through the 160 level a day earlier. Japanese officials have warned they may intervene in the market to counter the trend, which has both positive and negative effects on the economy. Elsewhere in Asia, Australia’s S&P/ASX 200 fell 1% to 7,708.10, while shares also fell in Taiwan and India. Bangkok’s SET fell, while shares rose in Jakarta and Singapore. On Wednesday, a mostly subdued day of trading left benchmarks on Wall Street close to all-time highs they set last week.The S&P 500 index rose 0.2% to 5,477.90 after drifting between small gains and losses most of the day. About 65% of the stocks in the benchmark index fell.The Dow Jones Industrial Average finished less than 0.1% higher, at 39,127.80, while the Nasdaq composite rose 0.5% to 17,805.16.Several big stocks helped offset the broader decline in the S&P 500. Amazon.com rose 3.9%, surpassing $2 trillion in market value for the first time. Its rise comes just days after Nvidia hit $3 trillion, briefly becoming the most valuable company on Wall Street. Chipotle eked out a 0.3% gain on the first day of trading after its 50-for-1 stock split. It was previously among the most expensive stocks in the S&P 500.FedEx helped offset the losses with a gain of 15.5%. The package carrier reported results for its latest quarter that easily beat forecasts. Rivian soared 23.2% after Volkswagen said it would invest up to $5 billion in the struggling maker of electric vehicles.Several big technology companies gained ground. Apple rose 2% and Microsoft gained 0.3%. Their large values tend to heavily influence the direction of the market.Investors are hoping that the Federal Reserve will soon begin cutting interest rates but its effort to tame inflation back to its 2% target has been arduous. Wall Street is betting on a rate cut at the central bank’s September meeting. The economy has remained relatively strong, despite inflation and high borrowing costs for consumers and businesses. Economic growth has been slowing, though, and consumers are seemingly more stressed and shifting spending to necessities. Wall Street is hoping that Fed can time its rate cuts so that it relieves pressure on the economy before it slows too much, but doesn’t also fall short of its goal of cooling inflation.In other dealings, benchmark U.S. crude oil lost 21 cents to $80.69 per barrel in electronic trading on the New York Mercantile Exchange. Brent crude, the international standard, shed 19 cents to $84.28 per barrel. The euro rose to $1.0693 from $1.0681.AP Business Writers Damian J. Troise and Stan Choe contributed. Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "All eyes are on Nvidia’s stock, so what’s been going on?", "title_link": "https://apnews.com/article/nvidia-chip-ai-apple-microsoft-51cc2b56e5871111907de6ad9cab59ae", "published_by": "By  MICHELLE CHAPMAN", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.FILE - A sign for a Nvidia building is shown in Santa Clara, Calif., May 31, 2023. A rebound for Nvidia on Tuesday, June 25, 2024, is helping keep U.S. indexes close to their records Tuesday. (AP Photo/Jeff Chiu, File)FILE - President and CEO of Nvidia Corporation Jensen Huang delivers a speech during the Computex 2024 exhibition in Taipei, Taiwan, June 2, 2024. A rebound for Nvidia on Tuesday, June 25, 2024, is helping keep U.S. indexes close to their records Tuesday. (AP Photo/Chiang Ying-ying)FILE - A sign for a Nvidia building is shown in Santa Clara, Calif., May 31, 2023. A rebound for Nvidia on Tuesday, June 25, 2024, is helping keep U.S. indexes close to their records Tuesday. (AP Photo/Jeff Chiu, File)FILE - A sign for a Nvidia building is shown in Santa Clara, Calif., May 31, 2023. A rebound for Nvidia on Tuesday, June 25, 2024, is helping keep U.S. indexes close to their records Tuesday. (AP Photo/Jeff Chiu, File)FILE - President and CEO of Nvidia Corporation Jensen Huang delivers a speech during the Computex 2024 exhibition in Taipei, Taiwan, June 2, 2024. A rebound for Nvidia on Tuesday, June 25, 2024, is helping keep U.S. indexes close to their records Tuesday. (AP Photo/Chiang Ying-ying)FILE - President and CEO of Nvidia Corporation Jensen Huang delivers a speech during the Computex 2024 exhibition in Taipei, Taiwan, June 2, 2024. A rebound for Nvidia on Tuesday, June 25, 2024, is helping keep U.S. indexes close to their records Tuesday. (AP Photo/Chiang Ying-ying)Nvidia shares rebounded Tuesday, halting a three-day skid that had surprised many investors and wiped away more than $400 billion in market value. Early last week, Nvidia overtook Microsoft as Wall Street’s most valuable public company. Then it fell 13% over three days, its worst such stretch since 2022. Because Nvidia has become so massive in size, the movements for its stock carry extra weight on the S&P 500 and other indexes.Any stock that climbs as much as Nvidia has — up more than 1,000% since the autumn of 2022 — is vulnerable to some of its investors selling shares in order to lock in some profits. That earlier run makes a 13% drop over three days look like a relative trifle.Monday, Nvidia shares rose 6.8%, bringing its market value to $3.10 trillion, behind Microsoft at $3.35 trillion and Apple at $3.21 trillion.Those three companies and a few others are responsible for much of the S&P 500’s returns recently. Investors would prefer a market where many stocks are participating in the gains. There’s been nearly insatiable demand for Nvidia’s chips to power artificial intelligence applications and the company has played a big role in the U.S. stock market’s recent record runs even as the economy’s growth slows under the weight of high interest rates. But the AI boom is moving at such a rapid pace that it’s raised worries about a possible bubble in the stock market and too-high expectations among investors. Derren Nathan, head of equity research at Hargreaves Lansdown, said in a statement that while Nvidia’s stock has declined in recent days, one must also look at the bigger picture.\n        \n    “The shares have still gained 190% on a 12-month view, so it’s no surprise some investors are locking in some profits,” he said.Nathan also isn’t concerned about potential wider spread implications. “Although Nvidia has sneezed, the wider market hasn’t caught a cold with a mixture of less extreme movements in both directions for the rest of the Magnificent 7,” he said.The Magnificent 7, which include Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia and Tesla, are a small group of stocks that are responsible for a big chunk of the U.S. stock market’s total return. Some critics say Nvidia still looks expensive. Its stock is trading at a price that’s 73 times higher than the profit that it’s produced over the last 12 months. That makes it look much more expensive than the broad S&P 500 index, where companies are trading at just 26 times their overall earnings. That itself looks pricey to skeptics, who say the broad U.S. stock market looks expensive compared with history.The thing Nvidia has going for it is the possibility of continued, incredible growth as it ushers in a new era that proponents say will remake the economy.Based on its expected profit over the next 12 months, Nvidia is trading at a still expensive but more reasonable price-earnings ratio of roughly 40. And if generative AI hardware deployments are still only in year two of what could be a three-to-five year deployment cycle, as analysts at Bank of America suggest, the possible runway of growth could make it look even more compelling.Analysts estimate that the company’s revenue for the fiscal year that ends in January 2025 will reach $119.9 billion — about double its revenue for fiscal 2024 and more than four times its receipts the year before that.Associated Press Business Writer Stan Choe in New York contributed to this report. Copyright 2024 The Associated Press. All Rights Reserved."},
{"title": "How major US stock indexes fared Friday, 6/21/2024", "title_link": "https://apnews.com/article/nvidia-dow-jones-wall-street-stock-market-3e36966bd81f19d1e9e614216780ad8b", "published_by": "By  THE ASSOCIATED PRESS", "Description": "Copyright 2024 The Associated Press. All Rights Reserved.U.S. stocks coasted to the close of their latest winning week, as Nvidia’s stock continued to cool from its startling, supernova run. The S&P 500 slipped 0.2% Friday, but it remained near its all-time high set on Tuesday. The Dow Jones Industrial Average edged higher by less than 0.1%, and the Nasdaq composite fell 0.2%. Nvidia dragged on the market again as it closed its first losing week in the last nine. U.S. Treasury yields held steady after a preliminary report suggested U.S. business activity is stronger than expected while pressure on inflation remains muted.On Friday:The S&P 500 fell 8.55 points, or 0.2%, to 5,464.62.The Dow Jones Industrial Average rose 15.57 points, less than 0.1%, to 39,150.33.The Nasdaq composite fell 32.23 points, or 0.2%, to 17,689.36.The Russell 2000 index of smaller companies rose 4.64 points, or 0.2%, to 2,022.03.For the week:The S&P 500 is up 33.02 points, or 0.6%.The Dow is up 561.17 points, or 1.5%.The Nasdaq is up 0.48 points, less than 0.1%.The Russell 2000 is up 15.87 points, or 0.8%.For the year:The S&P 500 is up 694.79 points, or 14.6%.The Dow is up 1,460.79 points, or 3.9%.The Nasdaq is up 2,678.01 points, or 17.8%.The Russell 2000 is down 5.04 points, or 0.2%.Copyright 2024 The Associated Press. All Rights Reserved."}
]